{"status": {"elapsed": 6, "timestamp": "2022-02-18T22:22:22.197860007Z"}, "data": [{"id": "3ff02228-8f6a-4960-9f61-df85c7a845cc", "title": "Weekly Recap Ending February 17", "content": "Notable Messari Intel Updates\n\nBinance Smart Chain will be <a href=\"https://messari.io/intel/event/f9fdeffc-295e-495e-b6f4-41b5f0405f48\">rebranding</a> to BNB Chain. Binance Chain will be renamed to BNB Beacon Chain and will serve as the governance hub of BNB Chain, while Binance Smart Chain will become BNB Smart Chain, an EVM compatible consensus and execution layer.\nThe Flow team has <a href=\"https://messari.io/intel/event/5545511e-eb69-4975-846d-279ec8a9646c\">released</a> a brief post-mortem related to the recent mainnet network instability/unavailability issues which occurred intermittently over the past two days.\nYearn Finance has <a href=\"https://messari.io/intel/event/4b6a267a-1ab3-4bf5-857d-d166a5cf857f\">released</a> information on a vulnerability disclosed by a security researcher on Jan. 30, 2022, impacting Yearn's SingleSidedBalancer strategy that has since been mitigated and did not result in the loss of funds.\nCosmos Developers <a href=\"https://messari.io/intel/event/323829ab-39a6-4bd6-81d3-5acbe0d98de7\">released Gaia v6.0.2</a> on Feb. 17, 2022. This release contains non-state breaking changes since the Gaia v6.0.0 Cosmos Hub Vega launch that occurred at block heigh 8,695,000.\nThe Gravity Bridge team announced in their discord channel that another lane has been added to the bridge, bi-directional traffic between Ethereum and Cosmos is <a href=\"https://messari.io/intel/event/540470b0-b4d2-4b43-aca0-362be019e91d\">now enabled</a>.\n\nNotable Messari Governor Updates\n\nThe Balancer DAO has <a href=\"https://messari.io/governor/proposal/f1e05b83-1ead-4bc6-b052-8bed76a3b89f\">submitted a proposal</a> that aims to terminate its contract with Gauntlet, which uses its Fee Optimization product to control Balancer protocol swap fees. Preliminary discussions are ongoing.\nThe Ribbon DAO has <a href=\"https://messari.io/governor/proposal/39cf2045-f873-499a-82da-9704a7047904\">submitted a proposal</a> that aims to implement Curve's vote-escrow system by introducing the veRBN token. veRBN will be distributed to users who willingly stake either their vault tokens or RBN tokens. RBN stakers can lock up their RBN from 1 week to 2 years and will benefit from boosting (up to 2.5x) and delegated boosting utility. Preliminary discussions are ongoing.\nThe Balancer DAO has <a href=\"https://messari.io/governor/proposal/addee6d7-1928-4f81-9046-8b664af34489\">submitted a proposal</a> that aims to gauge community sentiments regarding a new initiative to redesign OHM token emissions and distribution as Internal Bonds. Internal Bonds are different from regular Bonds and Inverse Bonds. In regular Bonds, bonders provide tokens such as DAI or ETH to get OHM at a discounted price. In contrast, Inverse Bond allows bonders to provide OHM to redeem its treasury backing such as DAI or ETH at a discount. Preliminary discussions are ongoing.\nThe Redacted Cartel has <a href=\"https://messari.io/governor/proposal/aa35ab5e-4b89-4730-88a7-08dcb834173c\">submitted a proposal</a> that aims to delegate $1.5 million of vote-locked CVX (vlCVX) from the Redacted Cartel treasury to The Union and use its services to earn passive bribe rewards in the form of auto-compounding cvxCRV. Preliminary discussions are ongoing.\nThe SpookySwap DAO <a href=\"https://messari.io/governor/proposal/d59a0746-6f40-4398-b26d-7e1e0c618dc5\">succeeded in passing a proposal</a> that aims to introduce a partnership between SpookySwap and Alpaca Finance that will make 181,000 ALPACA available as a reward for staking xBOO and a ALPACA-FTM farm.\n\nWe want to have the reader help guide us on how to evolve the Weekly Recap so that we can provide the most relevant information. This week we will not be showing sector performances but will be taking the opportunity to gather more data related to the survey we conducted last week. \n\nFrom last week’s survey, readers responded they would like to see metrics on TVL, interoperability and NFTs. Having this information, we would now like to ask, what kind of metrics surrounding these three areas would you like to see on a weekly basis additional to the sector performances? Please answer this survey!", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-02-18T15:41:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-february-17"}, {"id": "83e5d8f6-c9e4-4765-bab2-f3ee3b51ef2d", "title": "Blockchains: Changing the Game", "content": "The following report was commissioned by Forte, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nExecutive Summary\n\n  \nThe landscape of blockchain-based gaming is rapidly expanding behind the rise of NFTs and in-game currencies. Its growth can be seen as a continuation of a multi-decade iteration across monetization strategies and business models.\n\nThe rise of worldwide interest in video games and non-fungible tokens (NFTs) in the last few years serve as large catalysts. Globally, the number of video gamers is quickly approaching 3 billion with a projected 5-7% compound annual growth rate (CAGR) over the next few years. Meanwhile, NFT sales surpassed $15 billion for the first time ever in 2021. In fact, secondary sales of the NFTs found in blockchain games themselves accounted for 20% of total NFT sales – with dozens of smaller games consistently generating tens or hundreds of millions of dollars in revenue.\n\nFinally, while the metaverse remains vague, it’s clear that gaming, in particular, has a strong presence in virtual worlds. Virtual world games, like Decentraland and The Sandbox, have generated nearly $500 million in cumulative NFT sales (virtual land and in-game assets). In 2021, virtual world NFT sales witnessed the largest growth, generating over $320 million in transaction volume. As the global understanding of the metaverse further contextualizes, it’s likely that some portion of this new digital experience will utilize blockchains as a core piece of infrastructure – something even more likely to occur as blockchain infrastructure continues to scale to meet the demands of developers and consumers.\n\nThis report will dive deeper into the growth of all three categories: Global gaming, NFT markets, and blockchain games. Though  the industry remains in its infancy, understanding these trends will help provide insights into what the future of gaming may hold.\n\nIntroduction to Blockchain Gaming\n\n  \nLike its fictional characters, the business of games keeps evolving. The industry lies at the edge of disruption, where it has historically discovered innovations and adapted them to ever-changing demands.\n\nTake the evolution of gaming business models as an example. The first mainstream games featured a pay-to-play system. We remember these games predominantly as arcade machines in malls or CD discs in computers or, later on, direct downloads onto machines. The advantage with pay-to-play was simple: Pay just one time; keep playing forever.\n\nAfter pay-to-play came the freemium model of games. Gamers no longer needed to pay to start playing a game in this era. Rather, companies made revenue from players paying to unlock additional components of the game, or more commonly, from sales of in-game purchases such as expansion packs, platform subscriptions, and character cosmetics. For many, freemium games lowered gaming’s barriers to entry and the shift to freemium games helped grow the number of gamers around the globe.\n\nThat takes us to today, where the beginnings of gaming’s next monetization revolution lie around the corner: blockchain gaming. The blockchain gaming sector has earned other names like GameFi or play-to-earn indicative of the new monetization models of this gaming era. Blockchain gaming typically incorporates non-fungible tokens (NFTs) or other forms of tokenized assets as in-game content tradeable for cryptocurrencies – or fiat currency – on markets facilitated by the blockchain. Thus, this core monetization strategy occurs in the form of sales of tokenized assets and subsequent royalty proceeds. Game studios and players share aligned incentives in this new business model since both parties benefit when the game’s tokenized assets increase in value.\n\nAt the heart of this revolution is the idea that gamers should own the content they earn, or at least have more ownership in the digital worlds in which they spend a significant portion of their time and money. This creates two immediate advantages: (1) The longevity of in-game assets increases as those assets continue to exist in their owners’ wallets even after the game is turned off, and (2) both the interoperability and composability of assets – terms describing their portability – enable them to interact with other games, applications, or blockchains. Interoperability among different blockchains allows gamers to lend out their in-game assets, port them to another application, or gain access to real-world events. In addition, blockchains have the potential to offer gamers the ability to safely and efficiently buy, sell, trade, and create in-game assets with fiat or crypto even within the same application; gray secondary markets for games can be rife with fraud, and many emerging markets lack the payments infrastructure for gamers to seamlessly make game-related transactions.\n\nWhile blockchain gaming can be a new monetization source for game studios, it should be warned that the decision to enter the world of blockchain doesn’t come without its own pitfalls. The recent announcement of Ubisoft Quartz, an in-game NFT marketplace of sorts, was met with skepticism from fans, leading to plans of including NFTs in the new game Tom Clancy Ghost Recon Breakpoint getting scrapped. This followed after the popular gaming community Discord saw similar pushback after hinting at integration with Ethereum. The main reasons behind the community pushback were sustainability, unclear user value proposition and the prevalence of rug pulls, among many others. Many if not all of these concerns could have been avoided or alleviated with more deliberate, thought-out rollouts alongside market education; introduction of NFT profile pictures by Twitter and Adidas’ foray into NFTs have shown an encouraging path forward for platforms and intellectual property owners to learn from.\n\nThe Global Gaming Market\n\nGaming is one of the most popular sources of entertainment and it is only expanding. Major franchises such as Fortnite and League of Legends now operate in the global pop culture arena. Fortnite, for example, has partnered with Marvel Studios, Star Wars, and John Wick in the movie industry, worked with Ariana Grande, Neymar, and other influential celebrities, and coordinated with popular brands such as Balenciaga, Ferrari, and Air Jordan. League of Legends, on the other hand, hosts an international-sports league drawing millions of fans.\n\nAnecdotes aside, the global gaming market cannot be evaluated without taking the last two years into perspective. In 2020, lockdowns caused by the Covid-19 pandemic acted as a strong catalyst for the industry. Those who were already gamers found themselves with more time to play their favorite games. Meanwhile, individuals who didn’t play games found themselves with time on their hands to experiment with fresh hobbies. Consequently, global gaming revenue grew 15% in 2020. Mobile, PC, and console games each saw growth with mobile, in particular, surging 26% year over year.\n\nUnfortunately, businesses in 2021 faced a different story. The pandemic’s prolonged disruptions began to highlight unexpected second-order effects in the global gaming market. Disruptions to manufacturing, freight, and logistics processes hindered the launches of next-generation consoles, and PC hardware faced chip shortages and delays on other high-end components.\n\nDespite the ongoing increased interest in gaming seen in 2020, both PC and console segments saw slight decreases compared to 2020 and mobile was the only category to experience growth, due to these supply chain disruptions and tough comps.\n\nForecasts do expect the gaming industry to revert back to the previous levels of growth once the effects of Covid-19 subside. Predictions have the industry reaching $269 billion by 2025, a 53% increase from recent numbers. Over the upcoming three-year period, these fall in line with recent years’ historical 15% CAGR growth, driven by continued changes in consumer behavior post-pandemic and new revenue monetization models from streaming and professional esports.\n\nMeanwhile, the number of total gamers worldwide is predicted to hit just under the three billion mark with 55% coming from the Asia-Pacific region. The main drivers for an ever-increasing user base remain an expanding internet population, better networking infrastructure, and easier accessibility to smartphones.\n\nThese three drivers outlined continue to be reliable for the short term, but as more of the world comes online in regions such as the Middle East, Africa, and Latin America and user growth slows, exploring new avenues to increase participants will be of interest to many companies. Blockchain gaming and its new token-based monetization models present a unique opportunity for game developers to generate more in-game revenue per customer, broaden their customer base, and explore new revenue streams.\n\nNon-Fungible Tokens: Game Changers\n\nNon-fungible tokens (NFTs) act as a core primitive for blockchain assets and as a key value proposition of various blockchain games. NFTs in blockchain games provide various benefits to games including asset ownership, asset programmability, and open new opportunities to incentivization and innovation.\n\nAsset Ownership  \nIn legacy games, in-game assets are controlled and owned by the game developer and effectively rented out to players. Comparably, in blockchain games, players retain genuine ownership over their digital assets, whether in-game currency or more unique assets like skins, account names, in-game land, or other assets.\n\nAsset Programmability  \nSince NFTs are essentially software on blockchain networks, these assets can be programmed to have various qualities or built with in-game utility. NFTs can be designed with single-usage, unlockable content, issued to players that achieve a certain status, or programmed with a number of other unique use cases.\n\nIncentivization and Innovation  \nGame developers are already amongst the most knowledgeable when it comes to incentives. NFTs offer an additional layer of economic incentives by enabling players to earn yield-generating assets, imbue gaming assets with real financial value, and build a more robust gaming economy via in-game currencies and NFT marketplaces.\n\nSince blockchain networks are permissionless, they open up the doors to developer innovation. With NFTs, a single asset category can be automatically licensed to other companies or leveraged in other games. Sorare – the fantasy soccer NFT game – has licensed the usage of its NFTs with other game developers like Ubisoft.\n\nFinally, NFTs also open new forms of monetization. For instance, NFTs issued by companies can earn royalties on all secondary sales producing a new revenue stream for digital asset issuers. Companies can choose to vertically integrate their own marketplaces and activities or integrate with third-party platforms like OpenSea.\n\nThe Growth of NFTs: Analyzing The Secondary Market\n\nTotal NFT secondary sales in 2021 surpassed $15 billion across multiple blockchain networks. As a platform, Ethereum leads NFT sales. However, increased transaction costs on the network have paved the way for newer blockchains and Layer-2 scaling solutions like Solana, Ronin, ImmutableX, Polygon, and more.\n\nEach blockchain or Layer-2 comes with its own set of tradeoffs, including scalability, existing infrastructure, users, and security among others. As such, there’s a variety of game developers building on different blockchains for different reasons. Games that require greater scalability might opt for blockchains like Solana while game developers desiring to utilize Ethereum’s  \nexisting network effects may select Polygon, ImmutableX, or another Ethereum scaling solution.\n\nIn hindsight, August 2021 was the peak monthly activity in 2021 with over $4.5 billion in NFT secondary sales.\n\nAlthough the last few months of 2021 still lagged compared to the peak, it’s important to realize the NFT secondary market is still multiples larger than where it was at the start of 2021. With a growing number of applications and marketplaces that integrate various forms of tokens including NFTs, the NFT secondary market will be poised to retest the level of engagement last seen during August 2021.\n\nNote these charts represent secondary sales, meaning the sale from one person to another. This data, therefore, excludes the initial NFT sale from the gaming company to the first buyer, which can produce meaningful revenue. Secondary sales are a useful metric for gauging the health of both the overall NFT market and the health of an individual game. Increased secondary sales likely translate to a more robust gaming economy and since NFT collections often pass a perpetual royalty to the company at each sale, a healthy secondary market also directly corresponds to increased revenue for the NFT issuer.\n\nData shows Axie Infinity is the clear leader in secondary NFT sales, the vast majority of which occur on its sidechain Ronin. More recently, ParallelAlpha, another strategy card game, has grown in recent months in part due to its intriguing SciFi backstory and intellectual property. Overall, there exist several successful games with over $100 million in secondary NFT sales across multiple blockchain networks, showing that there’s still no clear consensus on which platform is best suited for blockchain-based games.\n\nAlso worth mentioning is the fact that most successful blockchain games today are predominantly card games, compared to the existing gaming industry which favors sandbox games, MMORPGs, and games with more robust gaming experiences.\n\nCurrently, blockchain games are not at the stage of development in which they can support both complex gameplay and economic primitives like NFTs at scale. However, in time, advancements in blockchain technology and user experiences – including improvements launching in the coming year – will open the doors for higher functioning games that operate on blockchain networks.\n\nThe Blockchain Gaming Landscape\n\nAs the blockchain-gaming sector gains momentum, the gaming infrastructure stack has also quickly evolved and is now composed of an ecosystem of studios, games, and key pieces of infrastructure.\n\nLet’s break down the various layers of the blockchain gaming landscape.\n\nGaming Guilds\n\n  \nGuilds aren’t new to blockchain gaming. These social groups – guilds – have been utilized in role-playing games for decades. However, the combination of decentralized autonomous organizations (DAOs)—an entity formed by a community that is organized around a set of rules enforced on a blockchain, usually with no central leadership structure—and gaming enables these guilds to ingest and allocate capital which creates new models for gaming financialization and user acquisition. Well-capitalized guilds like Yield Guild Games, GuildFi, and Merit Circle have sponsored—delegated assets in exchange for part of the game rewards—hundreds of players for games like Axie Infinity.\n\nBlockchain Games\n\nThe largest layer of the blockchain gaming landscape is the games themselves. To date, there exist a variety of game types. Some of the most successful categories include trading card games (e.g. Axie Infinity), MMORPGs(e.g. DeFi Kingdoms), Virtual Worlds (e.g. The Sandbox), and sports games (e.g. Sorare).\n\nAs the gaming landscape evolves, dominant blockbuster games will emerge from each sector. However, many games are currently under development and may take months or years to fully develop.\n\nMarketplaces\n\nAs games issue assets as NFTs, general marketplaces like OpenSea offer access as well as blockchain-specific marketplaces like Metaplex, VIVE, and Magic Eden that facilitate transactions. Further, some pieces of gaming infrastructure like Enjin offer their own marketplaces for Enjin SDK-developed games.\n\nLaunchpads\n\nLaunchpads effectively help upstart game developers raise capital for game development. Often these launchpads raise capital for a specific gaming ecosystem (i.e. Polkastarter for Polkadot) or Magic Eden for Solana). Typically, launchpads enable fundraising through either an initial DEX offering (IDO) or liquidity bootstrapping pool (LBP), each of which enables the initial sale of tokens.\n\nGaming Development Infrastructure\n\nGame development infrastructure like Forte and Enjin often have APIs and SDKs that enable game developers to quickly integrate NFTs or other crypto-economic activities. Building the entire blockchain infrastructure required for a game from scratch can be daunting and time-consuming for game developers. Just as blockchain developers leverage existing smart contract tooling and wallet infrastructure, game developers can leverage blockchain game development software (i.e. Stardust, Enjin, Forte) that supports modular components such as wallets, asset issuance, payments, and other foundational features.\n\nLayer-2 Infrastructure\n\nThe NFT bull market of 2021 resulted in increased investment from Layer-2s into the gaming ecosystem. Axie Infinity chose to vertically integrate, developing its own sidechain, Ronin, and its own DEX, Katana. Elsewhere game development platforms like Enjin have chosen to horizontally integrate, recently <a href=\"https://messari.io/intel/event/a18131ee-379e-4dcd-8d04-b866b5fbd628\">securing</a> a Polkadot parachain auction for Efinity. Still, many existing games are committed to building on Ethereum’s existing network effects, leveraging Starkware (e.g. Sorare), ImmutableX (e.g. Gods Unchained), Polygon (e.g. Zed Run), and others for their scaling needs.\n\nLayer-1 Infrastructure\n\nLayer-1 infrastructure serves as the core foundation for various protocols and applications. While some games are building higher throughput blockchains like Solana and Flow, most Ethereum games have migrated to Layer-2 solutions. The importance of Layer-1s comes from the other composable protocols that games will leverage, including guilds, financialization protocols(e.g. NFTX), identity solutions (e.g. ENS), marketplaces, and other applications or services.\n\nGame Studios\n\nStudios sit at the base layer of the landscape since they are often developers of games as well as Layer-1 and Layer-2 infrastructure. Dapper, Sky Mavis, and Animoca Brands sit as the most well-capitalized game developers with hundreds of millions in capital. Ultimately, not every gaming studio will survive. However, those that develop the next blockbuster games have the potential to become the next Electronics Arts of the future.\n\nBlockchain Games Gain Interest\n\nThe first blockchain game was created in late 2017, but it wasn’t until the recent mainstream foray into NFTs that the subsector found substantial user engagement. With the popularity of games like Axie Infinity and mainstream collectibles like NBA Top Shot, blockchain-based games are now on the precipice of wider adoption.\n\nUser and Funding Metrics\n\nAlthough blockchain gamers comprise a small percentage of the three billion global gamers, recent data released by DappRadar shows October 2021 was the first month where over one million unique daily active wallets interacted with decentralized gaming apps. This number reflects an almost 300% increase from four months prior where the same metric showed only 350K wallet interactions.\n\nThe monthly unique number of NFT buyers of blockchain games is also on the rise. To date, most blockchain games require an individual to own NFTs which places an initial capital burden on gamers, much like purchasing a console. While this model remains the most popular today, it’s likely that more games will experiment with free-to-play models in the future.\n\nFollowing the Funding\n\nApart from wallets as an adoption proxy, another important metric to track is venture funding. Capital investments reflect many things: It reflects interest in the industry; it reflects, to some extent, the ambitions of founders in the space; and it reflects, to a greater degree, the resources at hand available to those challenging the status quo. It’s worth analyzing how the fundraising environment has changed this past year.\n\nNot surprisingly, the numbers continue to further highlight the growth of this subsector. Total venture funding across game titles and ecosystem infrastructure increased more than 100x compared to 2020. The jump still represents a roughly 40x increase from funding in 2018, the year in which funding was at its peak prior to 2021.\n\nVenture funding in 2021 came in such a stark contrast to previous years that multiple businesses raised rounds larger than the sum of all previous years combined. Examples include Forte, an end-to-end blockchain gaming development platform partnering with a host of gaming studios. Perhaps what’s notable about this data is the variety of products and services in this list: Both studios and infrastructure/tooling are represented, not to mention other components of the gaming stack including NFT marketplaces and various Layer-1 or Layer-2 blockchains.\n\nBeyond fundraising amounts, the origination of funding also shifted this past year. Crypto-specific venture funds were no longer the sole game in town. This past year, those who have made investments in the space now include traditional tech funds such as Sequoia Capital, Andreessen Horowitz, and Lightspeed Partners, as well as hedge funds with established track records in growth investing, notably Tiger Global and Coatue Management. On a go-forward basis, this triumvirate of players – particularly the fresh participants – should continue to bring new capital into the ecosystem.\n\nDeveloper Initiatives\n\nMoreover, a recent study of 157 developers in the United States and United Kingdom found 72% of those surveyed have considered integrating blockchain technology into their games, whereas 58% of the same group have plans to do so in the next 12 months. Meanwhile, 47% of participants are already using NFTs in their games, highlighting considerable interest from the developer side.\n\nWhile developers see an opportunity for new content, it should be reiterated that the technology behind such games remains nascent. Furthermore, current challenges around blockchain such as transaction costs, throughput speed, and general scalability limit gameplay mostly to turn-based, card-collecting games rather than the live-action and 3D graphics of AAA-rated games released by high budget studios.\n\nBlockchain Game Case Studies\n\nIn the following section, we’ll take a look at the growth of three recognizable blockchain games, their models, and what they mean for the blockchain gaming ecosystem.\n\nAxie Infinity  \nWidely recognized as the most popular game to date, Axie Infinity has facilitated over $3.5 billion in cumulative volume within its NFT marketplace. The premise of the game is similar to Pokemon. Players own and breed Axie champions, represented as tradeable NFT characters, who go on to either complete adventure levels or battle champions owned by computer opponents or other humans in the Axie Infinity realm.\n\nSuccessful battles or conquests lead to in-game rewards, which can be sold for real-world currency. Axie Infinity spawned the global adoption of the play-to-earn business model. It is estimated 40% of total players are from the Philippines alone, where gamers can earn upwards of $500 per month from playing. Gameplay revolves around two crypto tokens: Smooth Love Potions (SLP) tokens and Axie Infinity Shard (AXS) tokens.\n\nSLP Tokens: SLP tokens are more widely used for practical in-game purposes and grant holders the ability to breed new Axie champions. The process consists of burning SLP tokens to birth a new Axie creature. SLP tokens can be earned through regular gameplay, bought on secondary marketplaces, or engagement with promotional offers.\nAXS Tokens: AXS tokens are the governance token for the Axie Infinity game. Those who own AXS tokens can stake the token inside the network to earn yield. These tokens are also used as currency within the game’s NFT marketplace.\n\nAxie Infinity derives its protocol revenue from various fee mechanisms. The first such mechanism is marketplace fees earned as a percentage of sales facilitated through the NFT marketplace. The other main revenue stream comes from breeding fees paid by players to create new Axie creatures in the game. Two smaller revenue sources include fees earned from sales of in-game land and the original sale of first-generation Axie creatures.\n\nIn sum, the protocol has earned over $1.3bn in revenue from these four sources, with almost all of it occurring after June 2021. This timing coincides with Sky Mavis’s launch of the Ronin network, which helped decrease transaction costs for its users and boosted the game’s popularity.\n\nSegmentation of revenue seems to support this conclusion. Over 99% of total cumulative revenue is derived from activity on the Ronin network. Ethereum merely accounts for 0.19% of the $1.3bn while including revenue earned from land sales and first-generation Axie sales, both of which are not available on the Ronin network. Thus, Ronin’s 99%+ revenue claim is another indicator of the incredible activity from breeding and marketplace fees alone.\n\nThe graph below demonstrates just how much growth occurred in the second half of the year. Surprisingly, revenue begins to tail off in the last few weeks of 2021. Potential explanations for this include the recent Typhoon Rai wreaking havoc in the Philippines (where 40% of total users reside) or shifting interest towards blockchain games with newer gameplay.\n\nAlthough Axie Infinity's circulating market capitalization did fall in recent weeks as revenue growth slowed, a rough benchmark did find the game still comparable with many pure-play game studios. Notably, this methodology compares a singular game (Axie Infinity) with game studios that own multiple titles – further demonstrating how sizable this one blockchain game has become.\n\nAxie Infinity lags behind the largest industry players such as Nintendo, Activision Blizzard, and Electronic Arts – all of which have triple-A rated game studios – but much closer to several others. In the benchmark below, Axie Infinity has a similar circulating market cap as Ubisoft, the creator of famous games like Assassin's Creed and the Tom Clancy series.\n\nSorare  \nMuch like fantasy sports, Sorare offers its players the opportunity to blend real-world sports with digital games – only this time with the inclusion of blockchain technology. Think FIFA Ultimate Team with NFT cards as collectibles. Up to now, Sorare gameplay is limited to football (or soccer, in the United States) as the sport of choice, though the company recently raised $680 million in September to support its continued expansion.\n\nSorare tracks real-world football stats, rewarding players who own the NFT cards of high-performing athletes. Naturally the nature of the game draws a broad audience of football fans. As reflected above, first-time buyers of Sorare NFTs surged in the second half of 2021. The total unique monthly buyers of Sorare NFTs surpassed 20,000 for the first time in December 2021. Data presented here should be noted under a backdrop where, unlike Axie Infinity, gamers aren’t required to purchase NFTs to start playing. This likely means the total number of Sorare gamers exceeds those who made secondary NFT purchases.\n\nSorare is one of the most successful cases to date of NFTs merging with culture. The participation of influential football leagues, including some of the most popular in the world like the English Premier League, Spanish La Liga, and Europe’s top-tier Champions League, and willingness to lend their brand to a blockchain game, is a precursor for future games to come.\n\nDeFi Kingdoms  \nAnother blockchain game, DeFi Kingdoms, bears resemblance to a popular Internet classic, Runescape. Gamers of the latter may feel some nostalgia as virtual characters interact with one another within a retro pixel art world. Unlike Axie Infinity or Sorare, the gameplay of DeFi Kingdoms doesn’t revolve around collecting and battling with cards. Instead, the game incorporates heroes, quests, professions, and a broader array of actionable activities such as mining, gardening, farming, and fishing. The roadmap for the game is massively ambitious. Future gameplay will allow Heroes to join guilds, engage in peer-to-peer battles, hatch pets, and more. Having heroes participate in these various tasks boosts the gamer’s odds of accumulating resources tradeable on blockchain markets.\n\nDeFi Kingdoms, as its namesake suggests, blends elements of gaming and decentralized finance (DeFi), with a larger focus on the latter than many predecessors. The game includes a decentralized exchange, liquidity staking, and native NFT marketplace – all services found in the crypto ecosystem but not traditionally within a blockchain game. In fact, the team behind the game took a reverse approach to that taken by Axie Infinity; instead of starting with the game, DeFi Kingdoms began with traditional liquidity mining incentives and is growing the game out with time.\n\nThe selected blockchain running the game is Harmony. What’s notable about DeFi Kingdom’s launch on Harmony is the sheer dominance of the project across the blockchain network. DeFi Kingdom owns approximately 68% of all Total Value Locked (TVL), a significantly larger share than the two main DEXs active on the network, SushiSwap, and ViperSwap. A launch of DeFi Kingdoms on Avalanche is also expected to be released within the next few months.\n\nUsage data does seem to support the idea of the game gaining interest. Daily user count has continually trended upward since its launch. In early December, the game announced it would expand to Avalanche with the launch of a new realm called Crystalvale. On the date of the news, it was announced Avalanche DEXs such as Trader Joe and Pangolin would immediately begin providing liquidity for DeFi Kingdom’s new Avalanche-purposed in-game token; a few days later, the number of users active on Harmony jumped 64% before giving back some of those gains. Transaction volume also jumped 29% over the following two-week period.\n\nThe Metaverse\n\nOn a broader scale, much of what’s happening in gaming is moving in tandem with another major technology trend: the metaverse. Perhaps the metaverse has already touched your life – it wasn’t too long ago Facebook strategically rebranded itself as Meta – but if it hasn’t, odds are high it will over the next few years.\n\nDefining the metaverse is a little unclear in part because the concept itself remains largely hypothetical. At its base, the metaverse represents a collection of virtual worlds (including AR, VR, and two-dimensional) where we can engage with each other in a digital format. But as it stands today, multiple worlds simultaneously exist, the ecosystem is fragmented, and competition is fierce among those vying to lay the framework for which world applications ultimately get built on.\n\nRegardless of the metaverse’s final form, opportunities for in-game integrations are mostly unexplored. The metaverse widens the scope of gaming by unlocking new types of intellectual property, experiences, and behavior. One early example is Worldwide Webb, an interoperable massively multiplayer online role-playing game (MMORPG). Worldwide Webb allows users to import owned NFTs into the game to serve as digital identities, which marks one of the first  \ninstances where NFT cross-application interoperability appeared in blockchain-enabled digital worlds.\n\nVirtual Worlds Dominance\n\nSince Decentraland’s ICO in August 2017, virtual worlds have long been discussed as a potential application within the metaverse. These virtual worlds are designed to be sandbox games (e.g. Minecraft, Roblox, etc.) where players can buy and build their own assets as well as socialize with other gamers.\n\nThe top four leading metaverse worlds are The Sandbox, Decentraland, Somnium Spaces, and Cryptovoxels. Each of these virtual worlds enables users to purchase scarce digital land and many of these also utilize their own in-game currency (e.g. The Sandbox’s Sand).\n\nTo date, some of these virtual worlds have gained notoriety for specific use cases. For instance, Cryptovoxels users have created 3D art studios and Decentraland hosts casinos and digital offices for various crypto companies.\n\nVirtual worlds have generated nearly $500 million in cumulative NFT sales (virtual land and in-game assets). In 2021, virtual world NFT sales witnessed the largest growth, generating over $320 million in NFT sales.\n\nThe Sandbox led virtual worlds by a large margin with over $235 million in sales. Moreover, Decentraland and The Sandbox both experienced 490% and 739% growth in NFT sales in Q4 alone, respectively.\n\nAs awareness of the metaverse increases, synchronous virtual worlds have experienced increased speculation. Ultimately, these applications are in their infancy, still building content for gamers and trying to find their niche among potential users (i.e. social, gaming).\n\nThe unique value proposition of blockchain networks – asset ownership, permissionless innovation, incentive design, and programmability – likely ensures that these protocols will support the metaverse as a foundational layer or as crucial parts of infrastructure for the secondary and tertiary applications and services.\n\nConclusion\n\nOver the past year, it’s undeniable that blockchain gaming experienced a watershed moment – a historical shift on which future development depends. The perception of blockchain gaming has changed because of successful games like Axie Infinity, the explosive growth of NFT secondary sales, and the broad growth of crypto adopters and more specifically the expansion of blockchain gaming users. In turn, this has catalyzed further funding into the blockchain gaming landscape across a variety of core pieces of infrastructure and dozens of new games and studios.\n\nThe tailwinds of the metaverse have also benefited the gaming industry, which makes up a significant portion of online activity today and will likely be an important area of growth and user acquisition for companies building in the metaverse.\n\nBlockchain ecosystems like Ethereum are developing at an increasing pace, but scaling challenges and user experience issues persist. Still, there are many teams developing solutions for both consumers and game developers to enhance the experience of building and playing blockchain games. Although a common monetization model across blockchain games has yet to emerge, the experiments around issuing NFTs, vertical marketplaces, in-game currencies, and other crypto-economic primitives remain promising.\n\nThis report was commissioned by Forte, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decisions or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Mason Nystrom", "url": ""}, {"name": "Jerry Sun", "url": ""}], "published_at": "2022-02-16T14:30:00Z", "author": {"name": "Mason Nystrom & Jerry Sun"}, "tags": ["Web-3"], "url": "https://messari.io/article/blockchains-changing-the-game"}, {"id": "8de320e8-fc09-4638-b6cc-a3cd06b29c00", "title": "The State of The Sandbox Q4 2021", "content": "The following report was commissioned by The Sandbox, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nIf you would like to view the real-time dashboard that was used in the making of this article, check out our The Sandbox Macro Financial Statements dashboard on Dune Analytics.\n\nKey Takeaways\n\nWhile primary sales volume remained flat, secondary sales volume grew 1,685% compared to the prior quarter. Notes this report only includes Sandbox Sales from OpenSea.\nThe number of active buyers rose ~37% compared to the last quarter and grew each quarter of 2021.\nThe Sandbox launched its limited Alpha version of its gameplay in November 2021 which drew thousands of players.\nThe most traded LANDs of The Sandbox virtual worlds are within the bottom left quadrant\n\nIntroduction to The Sandbox\n\nThe Sandbox is a gaming metaverse – virtual world – where players and creators can make 3D assets and experiences (e.g. games) that can be monetized via NFTs.\n\nThe Sandbox ecosystem leverages a variety of tokenized gaming features including:\n\nSAND – a digital in-game currency used for purchases, monetization, and asset creation\nLAND – digital ownable land within the Sandbox virtual world\nESTATE – a combination of LANDs to create a larger plot\nGAMES – a bundle of assets and scripting logic to create interactive experiences\nASSETS – 3D virtual images created by players\nGEMS – tokens burnt to give attributes to assets\nCATALYSTS – tokens burnt to create ASSETS\n\nThe Sandbox provides Mindcraft-esque gameplay with digital ownership and more robust in-game economics due to the tradeable nature of $SAND and the other assets within the Sandbox virtual world.\n\nSandbox offers a variety of in-game NFTs as well as user-generated NFTs. The VoxEdit NFT builder is used for creating 3D objects (ASSETS) such as avatars, creatures, buildings, and other tools.\n\nMacro Overview\n\nLANDS are blockchain-backed tokens (using the ERC-721 standard for non-fungible tokens, aka NFTs) representing physical parcels of The Sandbox Metaverse. There is a finite amount of Sandbox LAND – 166,464 parcels of which 62% have already been distributed.\n\nNew parcels are released for sale through auctions or at specific price points. In 2021, The Sandbox recorded over $350 million in LAND sales volume.\n\nNotably, 80% of The Sandbox's total LAND volume occurred in the final quarter with secondary sales making up for nearly all of fourth-quarter volume. While primary sales volume remained flat, secondary sales volume grew 1,685% compared to the prior quarter.\n\nSince The Sandbox had a player-capped Alpha release, tracking its active daily or monthly users isn’t useful at this point. However, the number of active buyers rose ~37% compared to the last quarter and grew each quarter of 2021.\n\nMore interestingly, the increase in secondary sales volume and growth in buyers resulted in a 25% turnover in the total LAND assets.\n\nWith 26,000 secondary LAND sales and around 15,000 unique buyers, it's likely that large owners are selling some of their LAND supply and that a subset of buyers are actively trading digital LAND.\n\nSandbox Micro Overview - Land Analysis\n\nThe median price of Sandbox LAND has appreciated from $1,308 at the end of Q3 to a median price of $11,364 by the end of Q4. This nearly 10x increase of the median price is due in part to the growing trend of the metaverse and Sandbox's continued expansion. Upon announcement of its Series B, Sandbox LAND appreciated significantly peaking in December.\n\nThe Sandbox LAND Map\n\nBy analyzing The Sandbox virtual world by total LAND volume per parcel, we’re able to determine which LANDs have been traded the most. Parcels in The Sandbox are separated into 1x1, 3x3, 6x6, 12x12, and 24x24 parcel plots. The heatmap shows the plots that have witnessed the highest aggregate trade volume on the secondary markets. This effectively helps determine which plots of LAND are most desirable (that have been available for sale).\n\nThe redder plots – indicating more trade volume – are predominantly clustered within the lower left quadrant of The Sandbox. One potential explanation is that as The Sandbox has expanded, traders have been drawn towards expanding regions of the map.\n\nDiving deeper, the reddest 12x12 plot is located (outlined in red) adjacent of the Yield Guild Games ESTATE and possesses multiple LANDS for sale on OpenSea (indicated by white boxes). It’s possible being close to YGG or Stakefish (the Doge dog ESTATE) makes the next-door land more valuable.\n\nThe second most speculated on plot (outlined in red) is near the first most traded 12x12 plot and shares a border with Atari, Ludena Protocol, and is close to two Sandbox-owned ESTATES. However, unlike the previous plot, this one has fewer OpenSea listings currently available.\n\nNotably, many of the largest ESTATES (24x24), especially within the center, have low aggregate trading volume. There are a few potential explanations for this effect. First, some potentially coveted parcels don’t trade often and many large ESTATES are owned by The Sandbox or their IP partners which are focused on building within the virtual world. Second, even the highest individual parcels have only sold for $100k-$245k which is below the heat maps second tier. Lastly, it’s possible that large owners don’t really care about making small profits on LAND and are looking to hold onto the LAND for a longer time period.\n\nInterestingly, the top 400 parcels by aggregate volume account for 32.5% of the total volume of the over 16,000 lands that have been traded at least once.\n\nThere is a clear concentration in the top 100 LANDs which account for nearly 17% of the total aggregate volume, showing that the top land within the Sandbox metaverse experiences significant volume.\n\nOne potential reason for this relatively high concentration of volume is that many LANDs haven’t entered the secondary market with the original owner hanging onto their parcels or ESTATES.\n\nThe Top LAND Owners\n\nThe top LAND owners are predominantly investors in The Sandbox (i.e. Binance, Galaxy Interactive, NFT communities (i.e. Whale, MetaKovan, Kongz), or large crypto-focused companies that have committed to building within The Sandbox Metaverse.\n\nThe top 5 LAND owners – one of which is The Sandbox – own 11% of the total LAND supply. Evaluating the percentage of ownership in a digital world is novel to ensure that 1) the amount owned by any one entity decreases over time, thereby facilitating greater in-world entrepreneurship and 2) monitoring that the LAND owners are actively building on their parcels as opposed to holding for speculative purposes.\n\nHigh Priced (Virtual) Real Estate\n\nIt’s worth noting that the Sandbox Heatmap above groups 12x12 parcels to see the total LAND volume and so the most speculated individual parcels of land (most aggregate volume) aren’t necessarily within the highest volume 12x12 grouping. The top five largest purchases – highest price paid for a single parcel of LAND – all exceed $100,000.\n\nCayson.eth, paid $245,000 for a single parcel of land. The buyer – who also owns BAYC 8435 – purchased the 35 surrounding plots for a total $547,119 ($15,632 per unit) and required the final parcel to create a 6x6 (36 plot) ESTATE.\n\nOlikars.eth holds the second, tenth, and fourteenth largest LAND purchases, spending a combined 80 ETH ($343,000) to acquire all three parcels. The account immediately transferred the assets to 0x2793999444f916254ea15b41403c111e9b610465 and then later to 0x64596df940be25aa5186b095c326dcca4660562d. One of the top purchased plots is adjacent to the future Walking Dead game. The other two plots are adjacent to the Atari RollerCoasterTycoon World and the Atari XL ESTATES.\n\nSandbox user Ksaffy – and BAYC #2765 owner – holds the title for the third largest plot transaction, purchasing a parcel near The Sandbox Central Hub where all players spawn into the game.\n\nThe fourth-largest transaction – $101,883 – was by Sandbox user CryptoSue for a single plot located adjacent to the Snoop Dog ESTATE and Weedbits plot. Finally, Club9.eth ranks fifth for the largest transaction purchasing plot 55816 for 24 ETH ($101,760) in November 2021 and later sold the same plot in January 2021 for 3.5 ETH for a significant loss. This same plot was sold again several days later for $4.67 ETH to an unknown wallet.\n\nAnecdotally, the top purchases are typically LAND owners trying to acquire specific plots of land whether that be next to ESTATES, user experiences (i.e. games, concerts), or important locations (e.g. near the spawn point) that the buyer likely believes will help drive traffic to their parcel.\n\nSandbox Ecosystem: Governance & Notable Events\n\nFundraising & Capital Expenditure\n\nThe Sandbox completed its $93 million Series B fundraising round in November led by Softbank. Sandbox has taken a distinct approach towards in-game content partnering with various brands and licensing intellectual property for dozens of companies. In a press release, The Sandbox state that the new capital will also be used to expand its IP licensing efforts and grow its virtual world.\n\nSubsequently, in December, The Sandbox completed a round with Hong Kong based entrepreneur Adrian Cheng to purchase an ESTATE of land within The Sandbox. The plot was purchased from The Sandbox’s “Mega City”, a location set to emulate Hong Kong with ownership across a variety of Hong Kong-based companies and prominent individuals.\n\nSandbox Alpha\n\nIn November of 2021, The Sandbox launched the long-awaited Alpha version of its virtual world which enabled users to interact with other players and explore the “Main Hub” of the Sandbox Universe. As part of the Sandbox Alpha, the Sandbox released 4 NFT avatar collections – Agora, Gearbox, Ducks, and Faction. The Sandbox Alpha was limited to 5,000 passes and had thousands of NFTs distributed to game players. As The Sandbox looks towards growing its user base, the next season of its Alpha is scheduled for May 1, 2022.\n\nPolygon Integration\n\nWhile Sand already maintains a liquidity pool on Uniswap with Ethereum gas fees making gaming on Ethereum’s base layer untenable, The Sandbox announced its intention to integrate with Polygon starting with an mSAND  MATIC staking pool on Quickswap. All Sandbox transactions incur a 5% fee, of which 2.5% is allocated to the various staking pools.\n\nSince there are a variety of transactions required interacting with The Sandbox virtual world (marketplaces, NFT creation, etc) Polygon will enable more interactions between tokens. The Sandbox and Polygon teams are currently working on a custom bridge to make all tokens within The Sandbox available on Polygon.\n\nThe SAND Foundation\n\nThe Sandbox team started the SAND Foundation to support the ecosystem and allocate grants to artists, game developers, and individuals who produce in-game content. Currently, all $SAND transactions incur a 2.5% transaction fee that is allocated to the Foundation Fund.\n\nLAND primary sales  – which accrue as revenue to The Sandbox (a subsidiary company of Animoca Brands – generated $12 million in Q4’21. Meanwhile, both The Sandbox company and The Sandbox Foundation take a 2.5% on secondary sales which resulted in $7 million in revenue in Q4 for each organization. Primary sales revenue will eventually end when all LAND is sold, making secondary sales royalty revenue (on LAND and ASSETS) a key revenue source for the SAND Foundation.\n\nRoadmap\n\nLooking ahead towards the first quarter of 2022, The Sandbox has a few notable developments.\n\nThe Sandbox DAO\n\nWhile not yet deployed, The Sandbox DAO will be able to vote on Foundation grants as well as make decisions on certain game parameters. The Sandbox DAO – set to launch in Q1 of 2022 – will be governed by both SAND token holders and asset owners (e.g. LAND).\n\nContinued LAND Distribution\n\nThe gradual distribution of LAND will continue through the first quarter of 2022. This will be coupled with more locations in The Sandbox Metaverse opening with various experiences available to players.\n\nLaunch of Public In-game Experiences\n\nIn-game experiences – activities for players – are core to growing The Sandbox userbase. Throughout the next two quarters, The Sandbox has planned a variety of experiences including virtual concerts – from LAND owners like Snoop Dogg and Deadmau5 – as well as the launch of games based on licensed intellectual property such as The Walking Dead.\n\nClosing Summary\n\nThe Sandbox recorded a record quarter in secondary LAND sales and Foundation revenue. Additionally, it expanded its total buyer base and released a substantial number of new LAND parcels for purchase on the open market. The Sandbox still remains fairly concentrated in LAND ownership, but with 38% of the total LAND parcels yet to be distributed The Sandbox will hopefully see expand its LAND ownership population as the company continues to gradually auction LANDs.\n\nMost importantly, The Sandbox launched its Alpha game to several thousand players along with a myriad of new NFTs including its own NFT avatar collection. As The Sandbox endeavors to create a virtual world populated with people and experiences, the team has various Q1 in-world events planned as well as the upcoming launch of The Sandbox DAO.\n\nThis report was commissioned by The Sandbox, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decisions or content. Author(s) may hold cryptocurrencies named in this report.\n\n  \nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io. This report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions._", "references": [{"name": "Mason Nystrom", "url": ""}], "published_at": "2022-02-15T15:00:00Z", "author": {"name": "Mason Nystrom"}, "tags": ["NFTs", "Metaverses"], "url": "https://messari.io/article/the-state-of-the-sandbox-q4-2021"}, {"id": "ac589c8a-4269-4331-912f-271ce4cd45de", "title": "Bundling and Unbundling, 1inch by 1inch", "content": "The following report was commissioned by 1inch, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\n“Gentlemen, there’s only two ways I know of to make money: bundling and unbundling.”\n\nJim Barksdale, formerly of Andreeson Horowitz\n\n  \nAggregating over 188 sources of liquidity across 7 supported blockchains, with volumes greater than 134 billion USD, and over 1.6 million users, few DeFi projects epitomize Barksdale’s famous proclamation as much as the 1inch Network. In December 2021, 1inch successfully raised 175 million USD in a Series B, valuing the network at around $2.25 billion, led by Amber Group. The raise is aimed at navigating the regulatory space in Europe and the US, building new 1inch protocols, expanding the utility of the 1INCH token and scaling up the contributor team.\n\nIn an increasingly fragmented DEX landscape with a wide array of chains, sidechains, rollups and their corresponding fee structures, liquidity and slippage, the 1inch aggregator offers a single interface that automatically finds the best price for a given trading pair across multiple sources of liquidity. But it is more than just a comparison shopping engine. The 1inch ecosystem is composed of:\n\nThe 1inch Wallet\nThe 1inch API\nThe 1inch Aggregation Protocol (DEX aggregator)\nThe 1inch Limit Order Protocol\nThe 1inch DAO\nThe 1inch Foundation\n\n2021 was a busy year for the 1inch Network, with a flurry of innovations aimed at improving the DeFi user experience. Let’s break it down.\n\nBundling DEXs for Fun and Profit\n\nAt the heart of the 1inch Aggregation Protocol is Pathfinder - a routing algorithm that finds the most efficient path for a token swap, splitting the transaction into multiple sub-transactions across different protocols and even different order depths within protocols to give you the best rate. The latest version of the protocol enhances an already long list of optimizations with a range of innovations.\n\nBeyond optimizing swap rates, Pathfinder can also reduce the probability of failed transactions thanks to its partial and dynamic fill mechanism. When a user submits a swap, Pathfinder first splits it between multiple liquidity sources. If during the process the rate on one protocol changes unfavorably, that particular branch of the route can be canceled, and only the favorable branches fulfilled. Further, dynamic fills will even allow the amount from the unfavorable branch to be redistributed across favorable branches, and the swap can be fully completed at the rate advertised in the interface. Users can also choose to optimize for the best rate or the lowest gas fee (up to 40%) - causing Pathfinder to modify its routing accordingly. All of these options can easily be toggled from the swap interface.\n\nWith code optimizations in the latest V3 version of the 1inch Aggregation Protocol, 1inch has become one of the most efficient decentralized swap solutions.\n\nSince late 2020, the protocol can also utilize collateral tokens in its routing, such as those minted on Aave and Compound. Such tokens need to be packed or unpacked to be used in a route - and this is done automatically by 1inch for the user, under the hood.\n\nBundling is one of the oldest business models on the internet, and the 1inch contributors team has demonstrated exceptional execution skills in building out their business. Few projects can claim the laundry list of both liquidity sources and optimizations that 1inch offers through its single interface, resulting in a healthy order flow across all the platforms 1inch operates on.\n\nUser growth has also been rapid, with returning users being roughly matched by new users month-on-month.\n\nUnbundling the 1inch AMM - Zero-Fee Limit Orders\n\n1inch also offers its own centralized swap offering with a zero-fee limit order functionality. Most AMMs today offer only market orders which means that once the user places the order, it is executed immediately at the available market price. A limit order is a standing order to execute a swap only when the market reaches a predetermined price or better - typically used by more advanced traders who are able to analyze the market and assess the probability of reaching the limit price.\n\nWhen a user places a limit order, it is added to a centralized database managed by 1inch. These orders can then be filled by any other user, including CEXs and the orders created by Pathfinder in the aggregation protocol. Takers of limit orders cover the gas costs in addition to the trade’s value, which means this is a zero-fee order for the user. The implementation also allows dynamic pricing, conditional offers where users set conditions for execution and Request for Quote (RFQ) offers for specific order sizes.\n\nThis functionality unlocks a host of features. Stop-loss orders, which automatically close when the price limit is reached, trailing stop orders, where the limit is set to ‘trail’ the market price by a fixed amount if it rises, and remain unchanged if the price drops, and auctions such as Maker DAO auctions where the price is dynamically set according to the best bids for a specific order size.\n\nThe version 2 of the 1inch Limit Order Protocol also facilitates gasless limit orders for ETH, enabling users with zero ETH balances to swap supported tokens. This significantly lowers the barrier to entry for new/first-time users. Other improvements include DAI-like permits extended to more tokens, optimized RFQs and others.\n\nUnbundling specific functionalities (order types in AMMs) and building on them to offer a unique selling proposition is another tried-and-tested business model that 1inch has executed well on, with Ethereum volumes projected to cross 800 million in January 2022.\n\nUnbundling Liquidity with the 1inch Liquidity Protocol\n\nYou can earn tokens by participating in 1inch liquidity mining programs and locking LP tokens in pools. While this may seem like any generic AMM, 1inch has an innovation to offer here as well: virtual rates, which are a form of protection against ‘front-running’ attacks.\n\nFront-runners (miners or bots, primarily) observe transactions that are broadcast by a protocol, and insert their own transactions before they are finalized for profit. In AMMs, when a user swaps token A for token B, the amount of token B decreases in the pool compared to token A, becoming more expensive against A. A front-runner can exploit this to change the exchange rate before the user’s transaction by inserting a similar swap before the user in the next block. The two trades execute, and the price for B availed by the front runner is now guaranteed to be less than that after the user’s trade, as both trades successively increase the price of B. This allows them to then sell B back to the pool, with a profit in token A. Sandwiching ‘true’ swaps with such transactions repeatedly can result in large profits for front-runners. The user ends up with a higher rate for B since the front-runner pushed the price up by inserting their swap before the users trade.\n\nVirtual Rates discourage front-runners from such attacks on 1inch liquidity pools. Following a swap, the swap rate changes only for further swaps in the same direction. For swaps in the opposite direction following such a trade, the rate is a virtual rate that matches the previous swap, as opposed to reflecting the true rate dictated by relative volumes of the assets - preventing front-runners from driving the price up and then profiting from the reverse swap. The virtual rate is in effect for a ‘decay period’ following a successful swap, is governed by 1inch DAO participants, and can be set from 1 minute to 5 minutes through direct governance actions.\n\nThe 1inch DAO\n\n1INCH token holders can vote on protocol parameters and governance proposals by staking their 1INCH tokens in the governance protocol. The DAO is being implemented in two phases, the first of which kicked off in December 2020. In this phase, the 1inch Foundation distributed 1INCH tokens to community members through ‘incentivization activities’ according to a lockup release schedule. The initial, core community is expected to implement DAO-based governance in an efficient manner while the protocol governance process is stabilized.\n\nThe second phase is now underway, which will enable full-fledged control over extended governance mechanisms, and a treasury - as governed by this 1IP. Voting power is bestowed by holding st1INCH (non-transferable ERC-20 tokens representing 1INCH tokens staked in the protocol’s governance contract), and v1INCH (representing backer/advisors/core contributor 1INCH tokens locked in the vesting contract) which have 1/5th the voting power of st1INCH tokens. Both of these can delegate their voting weight to other addresses.\n\nCurrently, one address belonging to Binance has around 10% of the voting power, with the next highest being around 6%, as declared on the governance page.\n\nThis concentration of power is due to the 1INCH staking pool on Binance, and is not an individual whale holding 1INCH tokens. The 1inch team is waiting for community contributions and other categories to catch up with the core contributors and have a more even distribution - taking us to the next topic, the 1INCH token.  \n\nThe 1INCH Token\n\nThe 1INCH token has two uses: as a utility token, 1INCH is used in the liquidity protocol to achieve high efficiency routing. As a governance token, stakers of the token will be able to govern the protocol.\n\nThe 1inch community will hold 30% of the total supply of tokens, which means that after the vesting period, the majority of the voting power still lies in the hands of the core team, backers and investors. 8% of the 14.5% given to the Network Growth Fund was given to investors in the latest funding round.\n\nThe 1inch Foundation\n\nThe 1INCH token is issued by the 1inch Foundation, a non-profit dedicated to fostering the 1inch Network and community. It does so by engaging early adopters and growing the population of users staking 1INCH for governance, issuing grants to developers building on the 1inch protocols and yield farming initiatives designed to incentivize liquidity provision across the ecosystem.\n\nCompetition\n\n1inch is the dominant DEX aggregator on Ethereum, with more than $130 billion of volume. On both Ethereum and Polygon, 1inch is locked in a battle for supremacy with the 0x protocol (Matcha is the 0x aggregator Dapp).\n\nUltimately, this is a game of bundling execution, which will be won on the parameters of fees, liquidity, availability of trading pairs, and importantly, integration of other Dapps and Protocols. Within this design space, some tradeoffs are possible. Aggregation can happen not only at the DEX/Dapp level, but also the network level. Since the competitors are essentially aggregating the same DEX’s and Dapps across chains (at least eventually), this space is ripe for commoditization, with those attracting the most liquidity and offering the lowest fees winning out. Execution and speed of adoption and expansion will be the key drivers for success, and 1inch is well placed to remain dominant in this space for the time being.\n\nThe Way Forward\n\n1inch has demonstrated remarkable ability to extract capital efficiency out of the DEX ecosystem, and great execution both in terms of user acquisition as well as fund-raising. The rise of the alternate L1s, however, opens up a new horizon for growth, in two dimensions. The first is merely expanding the list of available DEXs and trading pairs. Indeed, 1inch has just expanded into the Avalanche and Gnosis chains in 2022. The other, more complex path is through cross chain swaps. One example is simply to incorporate multiple chains and L2’s within the pathfinding algorithm. Another example is cross-chain staking - where a user can buy a token through 1inch in one chain, and earn staking rewards from another. Technical concerns from Vitalik Buterin notwithstanding, the multi-chain universe represents a new frontier for 1inch to take their bundling and unbundling prowess to new heights.\n\n  \nThis report was commissioned by 1inch, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Ramshreyas Rao", "url": ""}], "published_at": "2022-02-14T14:43:00Z", "author": {"name": "Ramshreyas Rao"}, "tags": ["Decentralized-Finance"], "url": "https://messari.io/article/bundling-and-unbundling-1inch-by-1inch"}, {"id": "e49f883a-42d7-4282-8374-e95446a5483e", "title": "Weekly Recap Ending February 10", "content": "Notable Messari Intel Updates\n\nThe United States Department of Justice announced on February 8, that law enforcement had<a href=\"https://messari.io/intel/event/16b76ca1-9f67-4a15-b914-829ceae2d4b3\"> seized 94,000 bitcoin</a> (~$3.6B) linked to the 119,754 bitcoin stolen in the 2016 Bitfinex hack.\nThe Acala team <a href=\"https://messari.io/intel/event/9dae91f5-6684-487d-a2c9-26f824f1b782\">announced</a> an allocation of 1M ACA tokens to the Acala Kickoff Rewards liquidity mining program starting on February 10.\nOn February 2, the Optimism team was alerted to the <a href=\"https://messari.io/intel/event/b0d650ca-a541-4f90-91b0-ef5b2ba96d10\">existence of a critical bug</a> in Optimism's Geth fork that would have allowed the creation of ETH by a repeated triggering of the selfdestruct opcode on a contract that held an ETH balance.\nThe Helium <a href=\"https://messari.io/intel/event/8d7dc979-0df5-482f-b29f-830b072f42e7\">blockchain halted</a> at block #1215286. The blockchain has resumed block production, and pending transactions have been cleared.\nThe 1inch team has announced the <a href=\"https://messari.io/intel/event/c44d90cb-1c42-457b-aa45-c34b0fca133e\">launch</a> of 1inch Earn, a set of concentrated liquidity pools optimized for stablecoin swaps.\n\nNotable Messari Governor Updates\n\nThe B.Protocol DAO has introduced a <a href=\"https://messari.io/governor/proposal/1cc8f248-3c5a-4071-87ee-4ca32dcf7a47\">proposal</a> that aims to add a veTokenomics design for B.Protocol that would enable users to lock their BPRO in exchange for veBPRO and bSTABLE tokens for a lockup period comparable to those of veCRV (up to 4 years). Voting is currently active.\nThe Gnosis DAOhas submitted a <a href=\"https://messari.io/governor/proposal/938d1c91-d7ff-4ccb-91a2-8360837c1180\">proposal</a> that aims to spin-off the Gnosis Safe project from Gnosis Ltd in order to create a SAFE Token to govern the Gnosis Safe ecosystem and infrastructure through an independent SafeDAO and setup an independent Safe Foundation in Switzerland to protect strategic off-chain assets (IP, Github repositories, strategic investments), issue the SAFE Token, and foster the Gnosis Safe ecosystem. Preliminary discussions are ongoing.\nThe Uniswap DAO has submitted a <a href=\"https://messari.io/governor/proposal/133d04f0-9d18-43b4-bac4-b8d2fdc5a6af\">proposal</a> that aims to create and fund an Ultrasound UNI Fund with 0.3-1M UNI. The Ultrasound UNI Fund directive will be to utilize the protocol fee switch, which can redirect 0.05% of 0.3% fees accumulated to any Uniswap Governance see fit, towards a distribution that brings some portion of swap fees to UNI holders. <a href=\"https://messari.io/governor/proposal/133d04f0-9d18-43b4-bac4-b8d2fdc5a6af\">Voting will start</a> in two days.\nThe Shapeshift DAO <a href=\"https://messari.io/governor/proposal/8909db66-7acf-45f4-8830-6eb14684680c\">passed</a> a proposal from Messari that aims to commission an initiation of coverage report, via the Messari Hub. The report would touch on key performance indicators and fundamental metrics while also discussing the token mechanics and value accrual mechanisms.\nThe Compound DAO <a href=\"https://messari.io/governor/proposal/b8798d73-6d91-4f3d-a799-2b111538efab\">denied</a> a proposal that aimed to add TrueUSD to the Compound protocol with a 80% collateral factor (from 0% currently) and distribute COMP rewards to TUSD market participants.\n\nSector Returns\n\nFor the first time in over one month of Weekly Recaps, all sectors covered have finished with double digit positive returns. The Gaming sector, which has been one of the worst performers the past five weeks has finally set itself apart, bringing in the highest returns for the week with 26.94%. Even though the DeFi sector took the last spot, it brought an impressive 11.44% return.\n\nTop Assets\n\nTop Assets was the second best performing sector of the week with Ripple (XRP) leading the group, finishing the week with a massive 45.4% gain. The driver for XRP’s substantial outperformance compared to other assets in the sector could be attributed to positive sentiment related to the blockchain-based payments firm’s recent court case news. Avalanche (AVAX) took the second spot with a similarly impressive return of 31.0%. Unlike the top two performing assets of the sector, the rest of the assets traded with high synchrony and ended the week with returns ranging from 19.6% to 12.0%., Solana (SOL) was the laggard of the group.\n\nDeFi Assets\n\nAlthough DeFi was the least performing sector, it was by no means unimpressive. The sector saw a $7 billion influx of fresh TVL since last week, bouncing from the $200 billion support line. Thorchain’s RUNE was the best performer of the week, returning a 24.2% gain, closely followed by Aave (AAVE) with 23.0%. PancakeSwap performed the worst of the pack with a 4.2% return.\n\nSmart Contract Platforms\n\nAvalanche (AVAX) demonstrated resilience as most of the Smart Contract Platform assets experienced a mild drawdown mid week, AVAX continued its “up and to the right” trajectory allowing it to secure the top performer position for the week. The alternate Layer-1 assets returned a 31.0% gain on the week while the next best performer, Ethereum (ETH) was more than 10% away with a 19.5% return. Algorand returned 11.4% for the week, making it the least underperformer of the group.\n\nCurrencies\n\nAmongst the Currencies sector, Ripple (XRP) was the outperformer of the week by a large margin. While the rest of the assets were losing upward momentum, XRP managed to maintain its strength, breaking away from the pack mid week. It closed the week with a 45.4% return while the second spot was taken by Monero (XMR) with a 28.5% return. Dogecoin (DOGE) and Bitcoin SV (BSV) performed the least in the group, with weekly returns of 15.6% and 12.8%, respectively.\n\nWeb3\n\nArweave (AR) was the Web3 sector leader for this week. The data storage protocol brought in a 23.5% return this week marking the first time the protocol claims the best performing asset of the sector since bringing back Weekly Recaps. Basic Attention Token (BAT) was on track to end the week as the worst performer but was able to regain territory allowing it to secure the second to last position with a 15.0%. Ultimately Stacks (STX) took the last spot with a 14.1% gain.\n\nGaming\n\nGaming had an impressive week, taking the spot as the top performing sector. Leading the pack with the highest return was Axie Infinity (AXS) which brought in a 36.0% gain. Next up was Chiliz (CHZ) returning 34.5% for the week. Out of the top 10 gaming assets by market capitalization, Yield Guild Games (YGG) was the only one not to finish the week with a 20%+ gain, returning 10.1%.\n\n", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-02-11T15:45:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-february-10"}, {"id": "9511e41f-bf3c-40be-84bb-e297012c9d5a", "title": "FRAX: A Fractional-Algorithmic Stablecoin", "content": "The following report was commissioned by FRAX, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nMakerDAO created one of the first and arguably the most successful stablecoin, DAI (which is pegged to the USD 1:1). Maker’s DAI launched in 2017 and has been used throughout the DeFi ecosystem for lending, borrowing, and treasury reserves. DAI is created when collateral is placed into the Maker smart contract. To add a layer of stability, Maker requires that DAI is overcollateralized, but this also makes their stablecoin more capital inefficient. DAI, USDT, and USDC became some of the more prevalent stablecoins in the DeFi landscape throughout 2018-2020 as users and protocols leveraged these stablecoins to earn yield and expand their digital product offerings to users. USDC has inherent centralization risks since it’s reliant upon the USD and Maker’s DAI is heavily collateralized by USDC. Regardless, Maker’s DAI and usage attracted the attention of others in the industry as to the necessity and growth potential of stablecoins in the web3 ecosystem.\n\nUntil FRAX launched on Ethereum mainnet on 21 December 2020, stablecoins had either been fully backed by collateral (e.g. DAI) or entirely algorithmic (no collateral backing). Frax Finance was first announced in May 2019 (known then as Decentral Bank) as a fractional-algorithmic stablecoin protocol. The project was founded by Sam Kazemian, Jason Huan, and Travis Moore. Frax was created to be the “world’s first decentralized stablecoin with parts of its supply collateralized and parts algorithmic stabilized.”\n\nFrax is the first stablecoin protocol to implement design principles from both fully collateralized (e.g. Maker Protocol) and fully algorithmic stablecoins to create a new scalable, trustless, stable on-chain money (FRAX Docs). FRAX is pegged 1:1 to USD, which means it attempts to maintain 1 FRAX = 1 USD$.\n\nThe growth of FRAX has been impressive with massive adoption and system-wide traction occurring in Q4 2021 with the launch of Frax v2. As of January 25, the Frax treasury is earning an average of ~$500K income daily (~$180M annualized) through the AMOs, Algorithmic Market Operations Controllers, which the team launched in early Q4 2021. Additionally, the FRAX supply has climbed from under $500M FRAX to an incredible $2.6B FRAX in this same time period.\n\nUnderstanding Frax Protocol\n\nAt genesis, FRAX was 100% collateralized, meaning that minting FRAX only requires placing collateral into the minting contract. Today, Frax is operating in the fractional collateral phase, which means to mint FRAX requires placing the appropriate collateral and FXS into the Frax protocol. While the protocol is designed to accept any type of cryptocurrency as collateral, Frax will mainly accept on-chain stablecoins to keep volatility low so that FRAX can transition to higher algorithmic ratios smoothly. As FRAX gains traction and the system’s velocity increases, it could become easier and safer to include more volatile cryptocurrencies such as ETH and wrapped BTC into future pools.\n\nThe Frax protocol implements a two token system design: a stablecoin, FRAX, and a governance token, FXS. The two token system allows for FRAX to be backed by both collateral and an algorithm (burning and redeeming of FXS). FRAX is minted when collateral and FXS are deposited into the Frax protocol contract. The amount of collateral needed to be deposited to mint 1 FRAX is determined by the collateralization ratio. The Frax collateralization ratio determines the ratio between collateral and algorithm that makes up the $1 FRAX value.\n\nFor example, let’s assume the collateralization ratio is 80%. This means that 80% of 1 FRAX is backed by collateral, like USDC, and 20% is backed by the algorithm that manages FXS supply. For both minting and redemption purposes, the protocol obeys the collateralization ratio, guaranteeing that 1 FRAX is backed by $1 of value.\n\nPeg stability is a crucial component for any stablecoin. FRAX maintains its USD 1:1 peg through deep liquidity pools. One such pool, also the largest liquidity pool, is on Curve Finance in FRAX3CRV. As of writing, the FRAX3CRV pool holds approximately 1.3B FRAX and this deep FRAX liquidity enables FRAX to be traded and swapped for other stablecoins with low or no slippage. The Curve AMO, implemented as part of Frax v2, furthers the stability of FRAX by automatically supplying excess collateral plus FRAX from the Frax protocol to the FRAX3CRV pool to ensure this deep liquidity remains (more on this below in the AMO section).\n\nThe price of FRAX, FXS, and collateral are calculated using a time-weighted average of the Uniswap pair price and the ETH:USD Chainlink oracle. The Chainlink oracle allows the protocol to get the true price of USD instead of an average of stablecoin pools on Uniswap. This allows FRAX to stay stable against the dollar itself which would provide greater resiliency instead of using a weighted average of existing stablecoins only.\n\nFrax is an agnostic protocol and allows the market to determine the collateralization ratio that it will settle on long term. The Frax protocol does not make any assumptions about what collateralization ratio the market will tolerate. Instead, Frax allows for the ratio to fluctuate and the market determines what collateral ratio the market prices FRAX at $1.\n\nTokenomics and Value Accrual\n\nThe FXS supply has been initially set to 100 million tokens at genesis. As more FRAX is used in DeFi ecosystems, this drives value to the FXS holders because minting FRAX requires burning FXS (thus decreasing FXS supply, and increasing value to FXS holders). As the value of FXS goes up, the price stability of FRAX increases creating a positive feedback loop for all those who are lending or borrowing FRAX to do DeFi or other digital economic transactions.\n\nFrax Finance also allows investors to become liquidity providers by bonding FRAX/FXS or FXS/ETH on Uniswap, which generates fee revenue for the liquidity providers on trades and swaps.\n\nThe protocol has also implemented the vote escrowed (ve) governance token model. This model is generally analogous to the well known veCRV framework, with slight variations for the Frax protocol (more on this below). In addition, Frax has developed a unique protocol feature called algorithmic market operations modules, or AMO. These are discussed in further detail below, but this mechanism further drives value back to holders of FXS.\n\nPerformance upgrades: veFXS and Frax v2 AMOs\n\nveFXS and cvxFXS\n\nShortly after the project launched in 2020, FXS holders were allowed to lock up their FXS tokens to generate veFXS (voting escrow FXS) and earn special boost, governance rights, and AMO (Algorithmic Market Operations Controller) profits. The vote escrow, or “ve”, mechanism has been popular across several DeFi protocols. FXS holders are eligible to lockup their FXS tokens for up to four years. The longer the FXS tokens are locked, the more bonuses awarded to the veFXS holders. It should be noted that the veFXS tokens are non-transferable.\n\nAdditionally, veFXS holders are also able to participate in Frax gauges and influencing or directing FXS to different FRAX gauges - a similar mechanism that was established by the Curve protocol and it’s gauge system. veFXS holders are eligible to direct FXS to one or multiple Frax gauges of their choosing. Once all of the FXS has been emitted, the gauges will turn to managing FRAX stablecoin expansion to continue to reward liquidity providers.\n\nRecently, Convex has partnered with Frax protocol to further align the two protocols' incentive programs, specifically around locking veFXS into the CVX protocol. Before diving into this partnership, it’s important to understand Convex’ place in the DeFi ecosystem.\n\nConvex was launched in May 2021 as a platform intended to boost CRV rewards and simplify staking CRV for liquidity providers and stakers by creating an access point to CRV benefits through its native CVX token. Thus, as soon as Convex was launched it began actively acquiring the CRV and veCRV tokens. By early summer 2021, it became the largest holder of veCRV tokens in what’s been dubbed the Curve Wars. Curve Finance rewards liquidity providers with CRV tokens, which allows governance rights on which protocols’ pools are funded with CRV rewards and fee sharing. By the end of 2021, Convex Finance has solidified its lead role as the main shareholder of Curve governance.\n\nWith Convex as the main holder of veCRV tokens, DeFi protocols have begun to acquire and partner with Convex as a way to access the governance rights and benefits allocated to veCRV holders (recall veCRV holders dictate which Curve pools are rewarded with CRV emissions every 10 days).\n\nBack to Frax and Convex. Frax holds 19% of CVX giving them substantial governance power in the Convex protocol, which can be thought of as a proxy for veCRV governance power and directing future CRV rewards.\n\nThe Frax and Convex partnership comes with added benefits to the veFXS holders. veFXS holders are able to lock their veCVX into the Convex protocol in return for cvxFXS. This deposited veFXS will be irreversible and locked forever. All cvxFXS holders will be rewarded with a future FPI (Frax Price Index) token airdrop. In the future, cvxFXS/FXS bonding pair will be created so that protocols and users may exit their cvxFXS position. As of writing, cvxFXS staking and rewards are still being developed and are not finalized yet.\n\nFrax v2: AMOs\n\nFrax v2 launched the algorithmic market operations modules, or AMO. An AMO creates smoother operations for Frax by automating the movement of FRAX and its collateral across the DeFi ecosystem. The Frax AMOs further enable FRAX growth by leveraging Frax’s assets in a capital efficient way by programmatically moving collateral and/or FRAX to capital efficient locations depending on the collateral ratio. Frax has implemented several key AMOs: FXS 1559, Collateral Investor, Curve AMO, Uniswap v3, and FRAX lending.\n\nFXS1559 is an in-protocol rule that all AMOs must utilize. FXS1559 calculates all excess value in the Frax system above the collateral ratio and uses this value to buy FXS for burning. Until October 2021, FXS1559 stated that 50% of value would be used to buy then burn FXS (creating value for FXS holders by decreasing supply) and 50% was given directly to veFXS holders. In October 2021, Frax passed a <a href=\"https://messari.io/governor/proposal/d8780def-fcb1-404e-a570-e12ba26a5610\">proposal</a> to give 100% of AMO revenues and profits to veFXS holders. This change further incentives FXS holders to lock their FXS in the Frax protocol as veFXS rather than hold FXS.\n\nThe Collateral Investor AMO puts idle USDC collateral from the Frax treasury to work across several DeFi protocols such as Aave, Compound, and Yearn. This AMO will loan out or reclaim collateral automatically as the collateral ratio changes. As the collateral ratio lowers and more of FRAX is backed algorithmically, the Collateral Investor AMO will automatically send collateral to the aforementioned protocols to generate additional yield on its USDC for veFXS holders. If the collateral ratio rises and more collateral is required to back FRAX, the Collateral Investor AMO will work in reverse and pull collateral back to the Frax treasury in accordance with the collateral ratio that the market deems necessary to keep confidence in Frax. Since implementation, the Collateral Investor has accrued $63.4M profits for veFXS holders.\n\nThe Curve AMO moves idle USDC collateral and/or new FRAX to the FRAX3CRV Curvel pool to create more liquidity and tighten the FRAX peg. The FRAX3CRV pool will earn Curve trading fees, CRV, and other LP rewards (by loaning out the CRV LPs to Yearn, StakeDAO, and Convex). The trading fees and LP rewards will be used to reward veFXS holders, while the CRV rewards will be used to boost the FRAX3CRV pool rewards. Similar to the Collateral Investor AMO, as the collateral ratio changes, FRAX then USDC will be added (collateral ratio lowers) or removed (collateral ratio rises) from the FRAX3CRV pool to make sure that FRAX is appropriately backed by the right percentage of collateral within the FRAX treasury.\n\nThe Uniswap v3 AMO (or Liquidity AMO) puts FRAX and idle collateral to work by providing liquidity Uniswap v3. This provides liquidity for other stablecoins to be traded and swapped for FRAX. Since the AMO is able enter any position on Uniswap v3 and mint FRAX against it, the Uniswap v3 AMO allows for expansion to other stablecoins and later more volatile collateral that is on Uniswap v3. The trading fees generated from the liquidity provided are brought back to reward veFXS holders. As with the other AMOs, as the collateral ratio changes, FRAX and collateral can be added or withdrawn from it’s LP position on Uniswap v3.\n\nThe FRAX Lending AMO allows for FRAX to be minted into money markets such as Aave to allow anyone to borrow FRAX by paying interest instead of the base minting mechanism. The collateral provided in these protocols treasuries would back the FRAX minted. The mechanism used here is very similar to Maker’s D3M feature, where DAI supply is expanded/contracted from a lending market based on the current borrowing demand. This AMO creates risk as FRAX is backed by collateral held by other protocols, but the protocol is able to moderate this risk by controlling the amount allowed to be minted directly into money markets.\n\nOf these AMOs, Collateral Investor AMO brings in the majority of the profits for Frax Finance. As seen in the graph below, the Collateral Investor has accrued profits worth ~$75M since being implemented in October 2021.\n\nCurrently, there are other AMOs in the works, such as Collateral Hedge and a Tornado Cash integration. These too will follow the same principles that all AMOs comply with. AMOs will likely continue to be proposed and implemented as FRAX is expanded and leveraged as a stablecoin in more DeFi protocols.\n\nMarket Overview\n\nFrax Finance operates in the stablecoin market, which has largely been dominated by fiat-backed stablecoins such as USDC and USDT. Algorithmic flavors of stablecoins have recently seen tremendous growth, specifically FRAX whose market cap has grown nearly 530% since October 2021. This trend will likely continue as the wider ecosystem seeks liquidity to match its overall growth, and algorithmic stablecoins such as FRAX can leverage their capital efficient AMOs to fill this gap.\n\nHowever, FRAX is not the only algorithmic stablecoin seeking to expand it’s supply in the ecosystem and DeFi space. Stablecoins like FEI and UST have both seen rapid growth as of late, with UST hovering around $10.6B in market cap and FEI seeing ~50% growth in its market cap over the past quarter (Q4 2021). Developments and growth are happening at a breakneck pace in stablecoins. One example would be the Fei and Rari protocols merger. With this merger, Fei will look to capitalize on integrating its stablecoin FEI further into DeFi by leveraging Rari’s lending markets.\n\nIt’s unlikely the market has reached a state of winner-take-all dynamics regarding algorithmic stablecoins. Frax and other similar stablecoin protocols will likely continue to grow together as the overall stablecoin market and DeFi products grow. From a systemic perspective, FRAX has done a remarkable job holding its peg, and exhibiting the powerful efficiencies of an algorithmic stablecoin. Now that supply has grown and deep FRAX liquidity exists, it would seemingly require a catastrophic (ecosystem-wide) event to destabilize it. This risk exists for FRAX as well as the other, robust stablecoins.\n\nRoadmap and other partnerships\n\nThe multichain universe\n\nFrax is built to be interoperable across all chains. There is not an independent Frax implementation for each chain. For this reason, the protocol has a bridging system that allows it to maintain a tight peg and fungibility. Importantly, the AMO functions and FRAX gauges can be deployed across different chains, allowing for FRAX expansion into new and growing markets and chains.\n\nAs stated by the Frax team: “The Frax Protocol is a multichain protocol with global state consistent across all deployments. FRAX + FXS tokens are a single distribution across all networks.” Each blockchain has one canonical FRAX and one canonical FXS contract that are referred to as \"FRAX'' and \"FXS\". These tokens are what AMOs expand or contract and users can mint or redeem.\n\nFPI: Frax Price Index token\n\nOn 1 January 2022, Sam tweeted that the Frax team has been and is working on the Frax Price Index ($FPI). This would enable decentralized applications to reference $FPI as an algostable peg. Not much has been said or revealed yet, however, cvxFXS holders will be rewarded a FPI airdrop.\n\nOther recent partnerships: OlympusDAO & Ondo Finance\n\nThere have been other partnerships, such as a token swap between OlympusDAO and Frax Finance (OHM  FRAX) to “further incentivize team] collaboration.” The OlympusDAO team has been actively building a treasury filled with DeFi tokens and stablecoins, which can be bonded to their OHM token. This has allowed OlympusDAO to create an entire marketplace for [protocol owned liquidity.\n\nAnother recent partnership is between Ondo Finance and Frax Finance. This partnership aims to create a product that Ondo will market and sell called “Frax-as-a-Service” or FaaS. The idea is that a new protocol will be able to deposit their native token into an Ondo vault and Frax and Ondo will match the protocol’s deposited amount with equal amounts of FRAX, creating a liquidity pair. This enables the protocol to immediately have liquidity for their token for users and protocols to onboard and offboard without needing to set up liquidity mining programs. As a participating party, Frax Finance will receive 5% APR on the liquidity it provides.\n\nConclusion\n\nFrax allows for the market to determine the collateralization ratio that it is comfortable with for $1 FRAX. As demand for FRAX increases, the veFXS holders will benefit as rewards and profits from the AMOs implemented to leverage idle collateral. While there are risks with FRAX and any token within the web3 finance space to consider, the Frax protocol experiment, a fractional-algorithmic stablecoin, has proven incredibly exciting and innovative.\n\nHaving multiple stablecoins (DAI, FRAX, MIM, UST, etc.) with different designs is a value-add to the crypto and web3 ecosystem as it derisks the blockchain ecosystems. FRAX and FXS are built with a long-term mindset and vision to have FRAX integrating into critical DeFi protocols. The novel fractional-algorithmic stablecoin design of FRAX allows for capital efficient stablecoin creation and allocation, and as the overall market continues expansion, FRAX should be well positioned to further this growth.\n\nThis report was commissioned by FRAX, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Ryan Malden", "url": ""}], "published_at": "2022-02-08T14:30:00Z", "author": {"name": "Ryan Malden"}, "tags": ["Stablecoins"], "url": "https://messari.io/article/frax-a-fractional-algorithmic-stablecoin"}, {"id": "eeeb1326-81df-4ac3-afc3-a9bde3d8384f", "title": "Yearning for Yearn", "content": "This report was originally published as a Messari Pro research article on 11/01/2021 but is now unlocked as a free report on behalf of Yearn Finance. If you are interested in unlocking Messari Pro or Enterprise research reports please reach out to hub@messari.io.\n\nWe all know Yearn. It’s the set-it-and-forget-it yield aggregator running on top of DeFi’s yield-generating protocols like Compound, Aave, Curve, and Convex. Users can passively earn with the click of a button. Within Yearn’s Vaults, strategists continually compete to write the top yield-earning strategies as they are rewarded 50% of the revenue. Over time, the protocol has become synonymous with yield and has garnered an industry reputation as a leading risk-minimized yield source.\n\nBut what do we not know about Yearn? What’s under the covers? Sure it’s grown 11x in terms of TVL since the start of 2021, but where is this growth coming from? It’s an important question to understand as a token investment is, in traditional theory, valued at nothing more than the discounted value of future cash flows. And future growth is defined at the margin - so who is the marginal depositor for Yearn?\n\nYearn’s Anatomy\n\nLet’s first break down Yearn’s multiple products.\n\nVaults: The flagship protocol used by the majority of users, Vaults account for 67% of Yearn’s TVL. Users deposit into a vault which is defined per asset and the underlying yield strategies are executed to deploy the capital. As the first iteration, V1 vaults were limited to single strategies and have since been deprecated. V2 launched at the turn of the year and offers more complex yield aggregation as vaults can be powered by multiple yield strategies.\nEarn: Similar in nature to vaults but even more simple. It originally focused on stable assets which users could deposit and underneath the assets are shifted between money market protocols depending on which offers the highest yield.\nIron Bank (IB): IB is a money market protocol focused on servicing users and protocols. Users are able to deposit approved assets as collateral to earn yield from borrowers or borrow other assets themselves. Protocol users can be whitelisted in order to facilitate under-collateralized borrowing.\nSpecial: This is a catch-all for non-core businesses. It accounts for yGov and yveCurve TVL.\n\nTVL grew significantly from March through May adding over $4B in TVL. Of the new TVL, 68% or $2.8B came from the new V2 Vaults - by far the majority. However, since May, the V2 vaults have been largely flat up until mid-September where Vault TVL again began its upward climb growing over 31% into mid-October.\n\nHere we have two distinct periods of growth in the V2 vaults. One at the beginning of the year from roughly March through May, and another recent move starting in mid-September. As anyone in crypto can surely tell you, these two periods are both times of significant price appreciation in ETH and BTC; begging the question - is this growth due to organic, new deposits or simply underlying price appreciation?\n\nYearn has distinct vaults for each asset it supports. 7 vaults hold over $100M in deposits and account for over 76% of the V2 vault TVL. Assets supported in these vaults include the top stablecoins like USDC, DAI, USDT, and the top market cap tokens ETH and staked ETH as well as WBTC. Splitting these vaults out between stable assets and volatile assets and focusing on the raw token counts shows where deposits are organically increasing irrespective of price.\n\nLooking at the first phase of V2 growth from March to June, both deposits of stablecoins and volatile assets increased significantly. Stables grew nearly 5x during this time and added nearly $1B in new TVL. ETH and stETH (yvCurve-stETH) deposits grew nearly 3x and added $400k in new TVL.\n\nThe second period of growth is noticeably different. Stablecoin token counts in vaults actually declined from mid-September to mid-October while there has been a sharp increase in new token deposits in the ETH denominated vaults - particularly the yvCurve-stETH vault. Over $670M (170k ETH) has been added to the stETH vault between September 15th and October 15th. 6x growth in 30 days.\n\nBreaking out TVL across the top V2 vaults (vaults over $100M in TVL which collectively account for over 76% of the V2 TVL), the recent growth period trend is clear. USDC TVL has decreased 9% over the last 90 days. DAI has modestly increased 2%. ETH and stETH TVL, however, are up over 118% and 109%, respectively, across the same timeframe.\n\nSo there we have it. Two distinct periods of growth for Yearn V2 vaults with different underlying drivers - Phase 1 was heavily influenced by stablecoin deposits while Phase 2 was exclusively ETH and stETH driven. However, despite differences in sources of growth, both phases share one distinctive quality - the sharpness of the growth.\n\nStablecoin deposits went nearly vertical across April. stETH and ETH have been doing the same since mid-September. With such concentrated, rapid growth drivers, another question is raised - are numerous new depositors coming in, or is this the result of a few, large depositors?\n\nTo understand the wealth distribution in the top V2 vaults, various cohorts of depositors are broken out into buckets by how much TVL is deposited from the unique address. For example, depositors contributing between $1 and $100k is one bucket, between $100k and $500k another, $500k to $1M, and so forth. Doing so reveals a distinct relationship between the types of depositors Yearn has in its V2 vaults: wealth concentration.\n\nDespite having over 6,220 active depositors in the top V2 vaults, $2.0B or 76% of the top V2 vault TVL comes from the 30 addresses depositing over $10M. $10M being deposited from a single address isn’t neighbor-nextdoor money, it’s protocol money.\n\n$1.5B or 57% of all the TVL in the top seven V2 Vaults come from 18 identified partner protocol integrations. External protocol partners are directing significant TVL towards Yearn’s vaults in order to repurpose the generated yield as a design component in their protocols.\n\nAlchemix is the largest Yearn depositor contributing nearly $600M in TVL across the yvDAI and yvWETH vaults. Alone it contributes over 76% of the DAI TVL and 44% of the yvWETH TVL.<a href=\"https://messari.io/article/alchemix-bringing-future-yields-to-the-present\">Alchemix</a> protocol takes collateral deposits which are by and large deposited into Yearn’s yield bearing vaults. Yield generated on this collateral is automatically applied as payments to a user’s outstanding loan debt in Alchemix.\n\nSushi’s BentoBox is the second-largest protocol contributor with over $583M deposited across the yvUSDC, yvUSDT, yvWETH, and yvCurve-stETH vaults. BentoBox is a protocol under the Sushi umbrella that acts as a base-layer protocol for other protocols to build on top of. Its key feature is to allocate idle deposits towards yield-bearing strategies - one of which is Yearn Vaults. BentoBox is the largest depositor in the yvUSDC vault, contributes a third of the yvWETH TVL, and nearly half of the $674M TVL in the yvCurve-stETH. The ETH and stETH deposits are most notable as they can be largely tied to one meteoric protocol building on top of the BentoBox app Kashi - Abracadabra. Both yvWETH and yvSTETH are two of the top three collateral assets utilized in Abracadabra to back its stablecoin, MIM.\n\nIn fact, Abracadabra (via Sushi’s BentoBox) and Alchemix play significant parts in the two phases of growth identified previously. Alchemix, initially launched in March with its DAI vault, is largely responsible for the massive expansion of DAI in Yearn during the first period of growth. Abracadabra has increased its TVL by 5x from mid-September and is the driving factor for the second phase of Yearn’s growth which is largely made up of new deposits of stETH and ETH.\n\nAnother linkage between these two protocols is their association with the<a href=\"https://messari.io/article/beyond-defi-2-0-what-is-driving-defi-s-current-innovation\">DeFi 2.0 </a>narrative. It’s important to understand the mechanisms driving this narrative in order to understand how Yearn is growing its influence across the ecosystem.\n\nOutside of the protocol-controlled value (PCV) features, protocols that are commonly associated with the DeFi 2.0 narrative largely utilize Yearn’s yield-bearing vault tokens (yvTokens) as a design aspect to make existing processes more efficient. Abracadabra uses yield-bearing assets to back collateralized debt positions. Alchemix uses Yearn yield to self-repay loans. Frax uses Yearn yield to collateralize its stablecoin. Ribbon uses Yearn yvUSDC as collateral to sell structured option strategies against.\n\nYearn has effectively grown out of being the peoples’ yield aggregator and moved into the role of being the dominant yield partner for other protocols. One could argue Yearn has found the bulk of its growth and product-market-fit as a Yield-as-a-Service protocol (B2B), not as an end-user protocol (B2C).\n\nThis isn’t entirely without design. Back in March, prior to the first growth phase, Yearn announced the Yearnpartnership program in which protocol partners who contribute capital to Yearn vaults can earn back half of the revenue generated (after the strategist 50% revenue).\n\nSuccess with the partnership program comes down to how Yearn is positioned in the ecosystem. Yearn is able to offer a single, trusted integration point to other protocols for yield so that time is not wasted and integration risk is not introduced managing and maintaining strategies themselves. It serves as a capital allocation protocol fully at the disposal of users and protocols alike. However, Yearn differs in the magnitude of the value provided to the two different parties which is manifested in the sources of Yearn’s growth figures. To users, Yearn and its yield is the end goal. To protocols, yield is a means to an end, a tool utilized in the creation of a new product - something that creates additional value and efficiency.\n\nThe Next Phase\n\nWhere Yearn grows from here is largely dependent on its V3 UI, multi-chain strategy, and the defensibility of its position.\n\nYearn’s V3 UI was recently released as a beta in September and introduced a number of key changes focused on improving user experience, scalability, multi-chain adoption, and B2B integrations. The bulk of the updates in the V3 UI are on its back-end architecture. A new SDK is introduced which simplifies data aggregation of on-chain and off-chain data within Yearn. It simplifies the integration process for not just Yearn, but also its partners.\n\nMultichain is a huge benefactor of the new V3 UI architecture. Now architecturally feasible in the back-end, Yearn was able to announce in early October it would be deploying on Fantom followed by numerous other EVM chains (provided they have safe, dependable yield sources).\n\nSo far Yearn has been able to defend its position in DeFi as the dominant yield aggregator. This is evidenced by its ability to command an industry-leading 2/20 fee model which has generated the fourth largest DeFi protocol revenue in the last 180 days without any liquidity incentives.\n\nMaintaining its dominant Ethereum position while expanding into leading positions across ecosystems with potentially new yield sources, new protocols partners, and new competitors will be the next question to address for the protocol.", "references": [{"name": "Dustin Teander", "url": ""}], "published_at": "2022-02-08T14:00:00Z", "author": {"name": "Dustin Teander"}, "tags": ["Decentralized-Finance", "Yield-Farming"], "url": "https://messari.io/article/yearning-for-yearn"}, {"id": "85df39cb-f9d0-4e41-b462-8e5479f25657", "title": "From Burning Bridges to Allbridges", "content": "The following report was commissioned by Allbridge, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nScaling and interoperability solutions are the core plumbing of the crypto industry. Today, there are over 100 active public blockchains. Bridges are essential to enable the transfer of assets and information between one chain and another. But before diving into blockchain bridges, why should blockchains be interoperable in the first place? Reviewing some Economics 101 may help clarify.\n\nConsider a simple world of two economies, Belgium and France, that only produce beer and wine, respectively. It is common knowledge that France is better at producing wine than Belgium. The country has the production facilities, labor, expertise, and climate - though the latter might change with global warming. Relative to beer country Belgium, it is not hard to imagine it costs France more to produce beer. In this simple model, both countries specialize in producing one good.\n\nIn reality, the French (usually) don’t only want to drink wine. In the absence of trade, they are happy to give up some production of wine to produce beer. The problem is that it would be much more efficient if France could export its excess wine and import beer from Belgium. The same reasoning holds for Belgium as a specialized producer of beer. The optimum is evident: both economies can enjoy more goods for the same amount of resources by engaging in trade.\n\nTrade theory shows us that every economy benefits from trade one way or the other. The same train of thought can be applied to blockchain ecosystems. Blockchains also specialize in unique use cases, target audiences, and geographies. The most critical differences follow from the scalability trilemma coined by Vitalik Buterin. All networks have to make a trade-off between being fully decentralized, secure, or scalable. For example, Ethereum prioritizes decentralization and security over scalability. Solana, on the other hand, optimizes performance at the cost of decentralization. In this example, trade theory shows us we should run compute-intensive applications such as derivatives on Solana and process critical transactions on Ethereum. That is if these blockchains can “trade” information with each other.\n\nThe scalability trilemma is exactly why alternative smart contract platforms gained so much traction in 2021. Instead of maximizing Ethereum, users jumped over to different networks for different applications. Over the last year, total value locked (TVL) increased from $18 billion to just shy of $250 billion across Layer-1s and scaling solutions. As the market continues to grow, Ethereum’s dominance may slowly deteriorate over time. Today, Ethereum controls roughly 60% of total assets locked in smart contract platforms. That’s a 30% decline from August 2020 - a clear signal that crypto is moving towards a multi-chain world.\n\nAll of these new blockchains need to talk with each other instead of competing in silos, and effective cross-chain connectors are necessary to induce communication across chains. The need for cross-chain communication is where bridges enter the scene. They open up a whole new playing field: they enable users to access new platforms with their assets, protocols to interoperate with each other, and developers to build out new features and products. There is an incredible opportunity in bridging infrastructure, and Allbridge is laying the foundation.\n\nAllbridge\n\nLaunched in July 2021, Allbridge is a Proof-of-Stake blockchain bridge with on-chain consensus. The platform provides a simple and reliable way to transfer tokens between various networks. Allbridge is backed by APYSwap Foundation and initially focused on bridging Solana with other chains. It was therefore originally called Solbridge. Realizing it could use its expertise to bridge any network, the project rebranded to Allbridge. The team now aspires to create a decentralized multi-chain hub for bridging assets. To fund these ambitions, Allbridge launched its token ABR on the Boca Chica and Smartpad launchpads in September 2021. The project also recently underwent a rebranding to improve user experience and cater to a broader audience.\n\nSource: Allbridge App\n\nAllbridge bridges tokens across Ethereum Virtual Machine (EVM), Layer-2, and non-EVM compatible blockchains and plans to support NFTs in the future. The protocol uses a modular architecture to integrate additional chains more efficiently. The result: the bridge was able to support 47 assets across Ethereum, BSC, Solana, Polygon, Avalanche, and six other networks in seven months. Aurora and Harmony are the latest blockchains to be supported on the platform.\n\nA total of $5 billion has been bridged on the platform to date - a 117% increase from the $2.3 billion bridged in October. In December, $231,000 in fees were collected on the platform, and on average, 2,900 transfers were made on Allbridge every day. Solana is the most active network with a 44% share in fees collected. At the time of writing, close to $380 million in assets are locked in its liquidity pools. Those are healthy numbers for any seven-month-old protocol, and clearly, there’s a significant opportunity left as Allbridge continues to integrate new blockchains and tokens.\n\nHow Is Allbridge Built?\n\nAllbridge has a very intuitive platform for users. Users connect their wallets and execute a send transaction on source blockchain A and a receive transaction on destination blockchain B. The transfer only takes as long as it takes to transact on the two blockchains. This means that the transfer can be completed almost instantly if the confirmation speed is fast enough.\n\nSource: Documentation\n\nBehind this simple user experience lies an innovative protocol design. Users can make four different transfers on Allbridge:\n\nSend native tokens and receive native tokens: Native tokens are locked on blockchain A and unlocked on blockchain B. This works similar to a DEX with two liquidity pools facilitating a swap.\nSend native tokens and receive wrapped tokens: Native tokens are locked in the liquidity pool on blockchain A, and wrapped tokens are minted on blockchain B.\nSend wrapped tokens and receive native tokens: Wrapped tokens are burned on blockchain A, and native tokens are unlocked from the liquidity pool on blockchain B.\nSend wrapped tokens and receive wrapped tokens: Wrapped tokens are burned on blockchain A, and minted on blockchain B.\n\nTransfers are completed by a series of requests between the user, the smart contracts on both blockchains, and the validators. A detailed walkthrough of all transfers can be found in the documentation.\n\nAs an example, transferring native tokens for wrapped tokens, the user sends native tokens to the smart contract on blockchain A. The smart contract locks the tokens and creates a request log when the transaction is completed. Before the user can send the receive transaction to blockchain B, the validators must first check the request log. If the validators conclude the funds are correctly locked on blockchain A, they send a signature to the user, who sends the signature to the smart contract on blockchain B. The smart contract then mints the appropriate amount of wrapped tokens and sends them to the user. The wrapped token tracks the price of the original asset using oracles but is compatible with the other blockchain. This lock-and-mint process ensures a 1:1 relation between the locked and minted tokens across the two chains.\n\nSource: Documentation\n\nValidators play a defining role in Allbridge. Every bridging transaction has to be confirmed by a two-thirds majority of validators. In return, they receive their fair share of the fees when a transaction is signed successfully. To become a validator, one must meet specific technical requirements. These requirements are primarily related to the ability to set up servers and nodes. In addition, validators must stake ABR tokens. These staked funds are slashed in case a validator behaves maliciously. Slashing incentivizes validators to act in the best interest of the protocol.\n\nUnlike most bridging solutions, Allbridge uses an on-chain validator consensus. This means that every validator transaction can be tracked and verified on-chain, which improves transparency for the protocol. A dedicated block explorer will be developed to monitor transfers.\n\nSecurity\n\nAccording to PeckShield, bridges were hacked for a record high of $644 million in Q3 2021. This includes the $611 million stolen from Poly Network in what is likely the most significant theft in DeFi history - even though the funds were returned a few weeks later. In addition, the study found that $147 million, or 55% of illicit assets, were cashed out through cross-chain bridges in the first six months of 2021. Clearly, there is a lot of criminal activity in the bridge space. Therefore, the ideal blockchain bridge should not only be interconnected, high-throughput, cost-effective, and trustless but must also be very secure.\n\nThe team has expressed several measures to upgrade security, such as ordering additional security audits, implementing a kill switch, and limiting the outbound transactions. In October 2021, the audit performed by blockchain security consultant Hacken found Allbridge’s code to be well-secured.\n\nTokeneconomics\n\nThe Allbridge ecosystem is powered by the ABR and xABR tokens. The tokens are used to pay for fees and staking as follows:\n\nUsers are charged a fixed bridge fee of 0.3% for every transfer. These fees are paid in the token that is transferred. Projects must pay a monthly subscription to use the bridge. The subscription fee is paid in ABR. Of all the fees generated on the platform, 80% is swapped to ABR and distributed to stakers. The remainder is distributed to the team.\n\nStakers can lock ABR on all integrated blockchains. In return, they receive xABR tokens one-for-one, which represent their share in the blockchain staking pool. Stakers earn rewards from fees and incentivization programs. When rewards are added to the staking pool, the number of ABR in the pool increases, and xABR becomes worth more than ABR. The xABR tokens are burned in exchange for ABR when users unstake and thus receive more ABR than they initially locked. This is how stakers can generate yield on Allbridge.\n\nSource: Documentation\n\nIn addition to attractive yields, stakers also benefit from dynamic percentage fees. Users that hold xABR on a particular blockchain are charged less for transactions sent from that network. The bridge fees are reduced exponentially. This means that users can enjoy a large reduction in fees by staking only a small amount. At present, as little as 10 xABR reduces the fee from the fixed rate of 0.3% to 0.2%. The bridge fee depends on the user’s pool share and therefore changes dynamically with TVL. The minimum fee is currently set at $0.50. The fee model is designed to incentivize staking and is an important value proposition to users.\n\nA total of 100,000,000 ABR tokens were distributed to the community, APYSwap, team, staking and liquidity pools, incentive programs, and ecosystem DAO. The public sale was held on launchpads Boca Chica and Smartpad in September 2021. There are several categories of recipients for which tokens will be unlocked linearly over a multi-year period and subject to semi-annual or annual cliffs. The initial distribution and unlock schedules were as follows:\n\nSource: Documentation\n\nAre All Bridges Created Equal?\n\nMany developers have realized the opportunity for connectors in the multi-chain world. At the time of writing, there are more than 40 different bridge projects. While they all seek to make the crypto space more interoperable, they are not all created equal. Dmitriy Berenzon best categorized four types of bridges:\n\nAsset-specific: Bridges that provide access to a specific asset from a foreign chain. BTC is the most common asset to be bridged, and BitGo’s Wrapped BTC is the largest bridge of BTC to Ethereum.\nChain-specific: Bridges that connect two different networks. The most popular ones are Layer-2 bridges. For example, Avalanche Bridge allows users to transfer assets from Ethereum to Avalanche and vice versa.\nApplication-specific: Applications that provide access to two or more blockchains, but only for use within those applications. Examples include Compound Gateway and Thorchain, building separate blockchains for cross-chain lending and exchange.\nGeneralized: Protocols that are designed to transfer information across multiple blockchains. Allbridge is a generalized bridge for asset transfers. Another example is Chainlink, which bridges off-chain information across multiple networks.\n\nThrow together 100+ networks and 40+ projects across four categories, and you end up with a market that is inherently fragmented. In essence, Allbridge competes with any project that facilitates asset transfers across networks. Projects like Compound Gateway and Chainlink are therefore not considered as competitors. Note that the competitive landscape illustrated below is not fully comprehensive for the sake of simplicity.\n\nWith the rise of alternative smart contract platforms, bridges to Ethereum are imperative to increase adoption. Ethereum bridges have therefore completely exploded this year. With barely $0.7 billion TVL in April, more than $22 billion worth of assets) are now locked in the market. That’s roughly 9% of TVL in smart contract platforms. At the time of writing, there have been 83,000 unique depositors over the past 30 days, and Polygon bridges hold the largest TVL at $6.0 billion. Avalanche bridges and Axie Infinity’s Ronin Bridge come in second and third at $5.4 and $4.8 billion, respectively. As alternative blockchains become more and more popular, these numbers will only multiply in the future.\n\nClosing Summary\n\nBy now, it is clear that we are moving towards a multi-chain world. So instead of burning bridges, there is a growing need for cross-chain connectors. These bridge projects must support as many assets and networks as possible at the fastest speed and lowest cost possible. And while there is fierce competition in the market, builders must remain disciplined and implement the highest security standards to prevent malicious activity.\n\nAllbridge is working towards a single-window system. It wants to offer a universal bridge where all assets can be accessed regardless of the blockchain. This is reflected in its roadmap. Broadly, the team is focusing on four main topics:\n\nBlockchains: New networks are continuously integrated to strengthen its position as a generalized bridge. With 12 of the largest networks already supported on the platform, Allbridge aims to integrate Tezos, NEAR, Arbitrum, Optimism, and other networks next.\nDecentralization: More validators will be added at the beginning of 2022, and a DAO interface will be launched to become a truly decentralized bridge. There is no planned date for the interface yet.\nMarketing: Following its recent rebranding and UX improvements, Allbridge will launch a series of marketing campaigns and incentivization programs to attract users. The team will also establish DEX partnerships to build out its ecosystem.\nB2B products: As the user-facing bridge becomes more established, Allbridge also wants to build its B2B offering. The team plans to launch an open API in Q1 2022 and implement an interface for project subscriptions. In the future, Allbridge seeks to offer a bridge-as-a-service API solution to AMMs and other projects.\n\nThus far, Allbridge has been able to deliver on its promises. Its modular architecture has proven itself an effective way to bridge new networks. Over the last several months, the platform has offered over 132 bridge directions across 12 networks. The project is also gaining traction, with over $5 billion bridged in total. It remains to be seen whether the team can guarantee security for the protocol and head up against more established players like Multichain. If Allbridge can continue this trajectory, there appears to be an exciting road ahead for the project.\n\nThis report was commissioned by Allbridge, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Michiel Van Tilborg", "url": ""}], "published_at": "2022-02-07T14:30:00Z", "author": {"name": "Michiel Van Tilborg"}, "tags": ["Interoperability"], "url": "https://messari.io/article/from-burning-bridges-to-allbridges"}, {"id": "b86c6700-d3a1-4e86-a37d-9a877c27b49d", "title": "Weekly Recap Ending February 3", "content": "Weekly Recap Ending February 3\n\nNotable Messari Intel Updates\n\nThe Solana bridge, Wormhole, was <a href=\"https://messari.io/intel/event/3e43e899-066e-4fb1-8266-3bdcad714834\">exploited</a> for 120,000 wETH in the second largest DeFi hack to date.\nThe 1inch team has announced the <a href=\"https://messari.io/intel/event/c44d90cb-1c42-457b-aa45-c34b0fca133e\">launch</a> of 1inch Earn, a set of concentrated liquidity pools optimized for stablecoin swaps.\nThe Solana team announced the <a href=\"https://messari.io/intel/event/c44d90cb-1c42-457b-aa45-c34b0fca133e\">launch</a> of Solana Pay, a new payments protocol designed to connect merchants and consumers.\ncLabs has disclosed a <a href=\"https://messari.io/intel/event/b15e4031-15a8-425c-9b6c-9c7002548615\">vulnerability</a> that could lead to a network stall on the Celo blockchain. The team reports that no funds are at risk.\nThe Fei Protocol team has <a href=\"https://messari.io/intel/event/7df43ae4-abc8-4bc7-83b7-184f7035c914\">introduced Tribe Turbo</a>, a lending and credit primitive that allows supported collateral types to borrow FEI with a 0% interest rate.\n\nNotable Messari Governor Updates\n\nThe Balancer DAO has introduced a <a href=\"https://messari.io/governor/proposal/06874782-47fd-4e5f-aeeb-2706b6fcb7fc\">proposal</a> that aims to implement Curve's vote-escrow system by introducing the veBAL token. Preliminary discussions are ongoing.  \n\nThe Synthetix DAO has submitted a proposal that aims to upgrade the Synthetix Network to use the new Off-Chain Reporting (OCR) price feeds from Chainlink on Optimism. Voting is active and can be accessed by following this <a href=\"https://messari.io/governor/proposal/30d958bf-18ba-48cc-8a93-aac333ba3f19\">link</a>.\nThe Friends With Benefits DAO has submitted a proposal that aims to select three artists via community votes for the first cohort of FWB Artists in Residence (FAiR) program. Voting will begin today and can be accessed by following this <a href=\"https://messari.io/governor/proposal/8cb3fcc1-594a-4a3d-8ebb-6ea64bf15da5\">link</a>.\nThe Paraswap DAO has submitted a <a href=\"https://messari.io/governor/proposal/ade1adbb-7206-457b-85f0-fc7386146d8f\">proposal</a> that aims to launch several liquidity initiatives that transfer Paraswap's main liquidity source into a Curve V2 pool partly owned by the ParaSwap protocol. Preliminary discussions are ongoing.\nThe Uniswap DAO has submitted a <a href=\"https://messari.io/governor/proposal/252348af-cf95-436d-9566-08f2fc6fbc95\">proposal</a> that aims to approve Hermes DeFi with an Additional Use Grant to deploy Uniswap V3 on Harmony. Preliminary discussions are ongoing.\n\nSector Returns\n\nThis is the first time in four weeks that not all sectors finish with negative returns. Four of the six sectors covered ended the week with positive returns. Impressively, Smart Contract Platforms, which had the largest decline last week, has seen the highest sector return this week. It took the first place returning 7.67%, followed by the DeFi sector bringing in 4.53%. Top Assets took the last spot as it brought a return of -1.17% for the week.\n\nTop Assets\n\nTop Assets brought a diverse set of returns as the sector had four assets end the week on the green while six were in the red. Solana(SOL) was the best performer of the sector as the alternate Layer 1 broke off from the pack during the second part of the week only to give back the gains and barely end the week on the lead, returning 8.9%. Following closely was Ethereum (ETH) as it ended the week with an 8.5% return. Terra (LUNA) was the clear laggard of the group, trading far below the rest and ultimately finishing the week with a 19.1% decline.\n\nDeFi Assets\n\nAfter three weeks of precipitous decline and $20 billion in total TVL wiped out, the DeFi sector has seen some signs of stability. As hinted on the <a href=\"https://messari.io/article/weekly-recap-ending-january-20?referrer=author:guillermo-avil-s\">January 20 recap</a>, TVL broke the $220 billion critical support line and has settled on the September 2021 top of $200 billion as support. Maker (MKR) was the clear outperformer of the group ending the week with an impressive 26% return while the next best performer, Curve (CRV), was 18.3% away returning 7.7% on the week. Loopring (LRC) ended the week far below the rest of the group, returning a 19.3% loss.\n\nSmart Contract Platforms\n\nThe Smart Contract Platform sector saw the most evenly distributed range of returns as half of the assets ended the week with positive returns while the other half recorded losses. Solana (SOL) was the best performer of the week returning 8.9% closely followed by Ethereum (ETH) with 8.5%. Cosmos (ATOM) and Terra (LUNA) broke downwards from the group early on and traded closely for the rest of the week. ATOM ultimately took the last spot returning -20.5% and LUNA -19.1%.\n\nCurrencies\n\nFor most of the week it seemed as if the majority of the assets in the Currencies sector would end the week with positive returns. Only three of the ten assets ended the week with a positive performance. Zcash (ZEC) was the best performer of the group by an 11.7% margin, returning a 13.3% gain while the next best performer was DASH (DASH) at 1.6%. Bitcoin Cash (BCH) took the last spot for the week ending with a 4.5% decline.\n\nWeb3\n\nRender (RNDR) has not just been one of the best performers of the Web3 sector, but also the market. RNDR finds itself on a 34.8% gain while the rest of the market has been on a decline. RNDR is just one of the seven assets within the Web 3 sector that finished the week with positive returns while Helium (HNT), the best performer of last week, took the last spot with a 12.4% loss.\n\nGaming\n\nEight of the top ten assets by market capitalization within the Gaming sector brought positive returns for the week. The top performer was Yield Guild Games, bringing in a 15.1% return followed closely by Sandbox (SAND) with 14.1%. The rest of the group had returns ranging from 9.8% down to -2.7% with Axie Infinity (AXS) taking the last spot.\n\n", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-02-04T14:44:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-february-3"}, {"id": "c43613e4-3e80-47fd-8624-91bd4424ff22", "title": "Messari Employee Holdings Policy and Disclosures", "content": "Our Dedication to Transparency\n\nMessari’s mission is to organize and curate critical information for crypto professionals. Since day one, we have realized that this means bringing transparency to the space so that information can be trusted. Our internal policies have reflected this in how we source, analyze, and present information. As the business has grown, we have expanded the “people” side, which means that more individuals are focused on three of our core product lines: Pro Research, Registry, and Intel.\n\nIt is essential for individuals in the crypto space to participate in networks so they can objectively evaluate them. Given that these networks are decentralized, our employees are often required to obtain tokens (assets) in order to participate in or transact on them. These assets have value. Assets with value can become investments. There is never a bright line, but we find it important to hold our team to the highest standards of transparency so as to best serve the crypto community.\n\nMessari Lists\n\nMessari Lists features watchlists created by our employees. These lists are created to highlight interesting projects that the team is watching and in no way a recommendation to buy a specific token. Employees may, or may not, personally own tokens on these lists. Please see the below Employee Holdings for a list of what each employee owns.\n\nEmployee Holdings Policy\n\nWe require employees who produce content (research, intel, newsletters, etc.) or participate in the Registry verification process to disclose their investment holdings on a quarterly basis. “Investment holding” is defined as any individual asset that represents more than 5% of an individual's portfolio.\n\nMessari Employee Holdings (in alphabetical order, as of February 4, 2022):\n\nAndrew Silva: ETH, ATOM, DCAU, ELK, JEWEL, ONE, SHDW, SOL\n\nAdam Arreola: ETH\n\nAidan Mott: BTC, ETH, AXS, ANY, FTM, RUNE, YFI\n\nBrandon Goss: BTC, ETH, ATOM, ENS, OSMO, STARS, SUSHI\n\nChase Devens: ETH, ALCX, ATOM, FXS, HNT, OSMO, TOKE\n\nChris Sutherland: ETH, ATOM\n\nCole Muench: BTC, ETH, ILV, TOKE\n\nDustin Teander:\n\nEric Turner: BTC, ETH, ATOM\n\nEshita Nandini: BTC, ETH, FWB, SOL\n\nGarrick Bogue: BTC, ETH, ADA, LINK, LUNA, SOL\n\nGuillermo Aviles: BTC, ETH, LUNA\n\nJack Anderson: BTC, ETH, AAVE, ATOM, OSMO, UNI\n\nJack Purdy: BTC, ETH, ALPHA, HNT, PERP, RGT\n\nJames Trautman: ALGO, AVAX, FTM, LUNA\n\nJennifer Obem: BTC, ETH, ATOM, OSMO, QUANT\n\nJerry Sun: BTC, ETH, SOL, ATOM, DOT\n\nJustin Baba: BTC, ETH, ATOM, MAGIC, METIS\n\nElem Oghenekaro: ANT, OSMO, SNX, SUNNY\n\nKaren Shen: ETH\n\nKaushik Guduru: ETH, AVAX, DOT, LUNA\n\nKel Eleje: BTC, ETH, MAGIC\n\nKunal Goel: BTC, ETH, DOT, MINA, UXP\n\nKyle Malden: ETH\n\nLily Du: BTC, ETH, NEAR, LINK\n\nMaartje Bus: BTC, ETH\n\nMason Nystrom: BTC, ETH, ATOM, HNT\n\nMatthew Markewicz: ETH, ATOM, DOT, SOL\n\nMicah Casella: BTC, ETH, ALGO, MANA\n\nMike Furci: BTC, ETH\n\nMike Kremer: ETH, ATOM, cvxFXS, HADES, JUNO, METIS, OSMO, TETHYS\n\nMoi Stern: BTC, ETH, ATOM, OSMO, METIS\n\nMustafa Demiray: ETH, AVAX, JEWEL, MAGIC, OSMO\n\nNaphat Nawamongkhonchaikit: ETH, ATOM, DOT, KSM\n\nNick Garcia: BTC, ETH, ATOM, DOT, LUNA\n\nRoberto Talamas: ETH, PERP, SOL, LUNA\n\nRyan Selkis: BTC, ETH, LUNA, OpenSea\n\nSami Kassab: BTC, ETH, HNT\n\nSavada Wilson: ETH\n\nSeth Bloomberg: BTC, ETH, ALCX, SOL\n\nStephanie Dunbar: BTC, ETH, DOT, LUNA, SOL\n\nTomas Molin: ETH, RUNE, LUNA\n\nTraver Normandi: ETH, INDEX, MAGIC, MATIc\n\nWilson Withiam: ETH, ATOM, DOT, KAR, HNT, OSMO, RUNE\n\nYule Andrade: ETH\n\nNon-Public Information\n\nIn addition to the Registry verification process, Messari employees may receive material non-public information from teams while conducting research. If this occurs, all covered employees will be prohibited from buying or selling (including selling short) assets in a related project until the information is publicly disclosed.\n\nOutside Business Activities\n\nOur employees are experts in their fields and encouraged to be active participants in the crypto community. Therefore, employees may contribute to companies outside of Messari in their free time. Employees are prohibited from engaging in any outside activities during business hours or representing themselves as agents of Messari in any business dealings. All outside activities must be approved by an employee’s manager in advance, and any conflicts that may arise must be immediately disclosed.", "references": [], "published_at": "2022-02-04T05:00:00Z", "author": {"name": "Messari"}, "tags": [], "url": "https://messari.io/article/messari-employee-holdings-policy-and-disclosures"}, {"id": "da29ae64-f6bf-46b9-994b-58c2e68ff5e9", "title": "UXD - Tackling the Stablecoin Trilemma", "content": "The following report was commissioned by UXD, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nStablecoins are one of the most important aspects in all of crypto. All major trading pairs on CEXs and DEXs alike are denominated in stablecoins. Volumes of stablecoins often exceed BTC volumes and ETH volumes. Stables are by far the most borrowed assets on decentralized money markets (27x more USDC is borrowed on Aave than ETH). Yearn’s most popular yield vaults are stablecoin vaults. Perpetual exchange protocols, which offer the most popular derivatives, are almost always collateralized against stablecoins.\n\nStablecoins are the foundation of nearly all that is DeFi.\n\nHowever, not all stablecoins are alike. Tradeoffs exist for all stablecoin implementations. Each stablecoin exists along a spectrum of decentralization, stability, and efficiency. Together, these aspects formulate the stablecoin trilemma which plagues stablecoin designs as optimization along one aspect usually leads to degradation in another. The stablecoin trilemma can be defined as:\n\nDecentralization: How dependent is the stablecoin on centralized systems?\nStability: Does the stablecoin remain at its peg without large variances, especially during times of market volatility when stable assets become high in demand?\nEfficiency: How much capital is required to secure the stablecoin? More capital required, the less efficient and vice versa.\n\nStablecoin implementations largely fall into three categories: Fiat, Collateral Debt Position (CDP), or Algorithmic (algo). Fiat stablecoins are backed by corresponding fiat dollars (or other currency) in a traditional, centralized entity. For example, USDC is issued/burned by corresponding TradFi banks who are responsible for maintaining cash and cash equivalents in custody to back issued stablecoins. Collateral Debt Position stables are issued by decentralized protocols that accept collateral and issue debt in the form of a stablecoin. Collateral backing CDP is often greater than the amount of stablecoin debt issued in order to protect the protocol from fluctuations in the collateral token price. All in all, CDP stablecoins are backed by individual user deposited collateral. Algorithmic stablecoins have the widest spectrum of implementations with various algo stablecoins having noticeably different properties. However, each algorithmic stablecoin leans on a combination of game theoretic and mechanistic systems to ensure stability of the token.\n\nSince fiat-backed stablecoins require a trusted centralized partner and collateral debt position tokens require overcollateralization due to the volatile assets accepted as collateral, algo stablecoins present the best opportunity for DeFi to solve the stablecoin trilemma with a scalable, decentralized, and efficiently scalable stablecoin. And decentralized markets are echoing this sentiment. Demand for stablecoins which can solve the trilemma and ensure long-term viability have skyrocketed over the previous year.\n\nIn Q4, the Algo stablecoin market cap grew 260%, significantly outpacing fiat and CDP-based stablecoins which expanded market caps by 18% and 87% respectively. At this pace, algo stablecoins are set to pass collateralized debt stables as the second largest category of stablecoins in Q1 2022. However, there is a significant differential between the supply of fiat stablecoins and algo stablecoins. Fiat stablecoin market capitalization is roughly 10x more than both collateral debt and algo stablecoins. This value gap is the market opportunity for algo stables as the more efficient scalability properties play out over the next year.\n\nCurrent leading algo stablecoins include UST, FRAX, and FEI. Each employs a mechanism of redemptions which alongside supply and demand forces work to keep the stablecoin price pegged. UST, for example, works by minting/burning Luna in exchange for UST so that when the UST stablecoin begins to trade over the peg, Luna can be burned and exchanged for UST at a 1:1 dollar ratio (which is at the peg, but below the current price) to be sold into the market for a small profit. Creation of more UST in this scenario pushes the UST price closer to peg via supply and demand forces. This mechanism ensures that UST always has a market for $1. Luna in this scenario absorbs the supply and demand volatility that plagues stablecoins.\n\nFrax works similarly with regards to the redemption mechanism of Luna, except FRAX is algorithmically collateralized by a floating collateral factor. Collateral factor simply defines how much USD value of collateral backs the stablecoin FRAX. At a collateral factor of 1, there is one dollar for every FRAX in reserves. As the collateral factor drops (by design in order to scale efficiently), less collateral is required per FRAX. Redemptions change by issuing FXS, the protocol’s governance token, alongside collateral (USDC) in line with the current collateral ratio. For example, with a collateral ratio of 0.75, redemptions would net $0.75 sourced from the collateral pools of the protocol and $0.25 worth of minted FXS which in total is $1 for every redeemed FRAX. Frax as a protocol also employs other mechanisms contributing to the stability of the protocol which by and large utilize collateral in market operations such as liquidity provisions, investments, or lending (these modules are referred as AMOs by Frax).\n\nWith the release of V2, FEI too deploys a redemption mechanism as the primary stability force for its algo stablecoin. Unlike FRAX, FEI is overcollateralized by its Protocol Controlled Value (PCV) reserves which consist of a variety of assets ranging from stables like DAI to volatile assets like ETH and Ethereum DeFi tokens. PCV serves both to fund 1:1 redemptions of FEI as well as to seed liquidity in trading pools guaranteeing FEI can trade at high volumes. Due to the volatile nature of the PCV collateral, FEI can shift from being overcollateralized to undercollateralized at which point redemptions would be funded with newly minted Tribe. Redemptions enable the supply of FEI to scale at a minimum 1:1 ratio relative to collateral while also enabling a stability mechanism for FEI as market volatility changes supply and demand ratios of collateral and FEI.\n\nRedemptions are the key stability mechanism utilized by current algo stables because each either has a one of or a combination of the following; volatile collateral (FEI), undercollateralized (FRAX), or requires volatility absorption mechanisms via a complementary token (UST). All because of one simple fact, none of these protocols have consistent, guaranteed backing 1:1 of collateral to stablecoins. Why don’t fiat backed stablecoins require sophisticated mechanisms of stability? Because there is faith in 1:1 backing of cash assets to each stablecoin irrespective of market volatility.\n\nSo why can’t an algorithmic stablecoin create the same guaranteed backing but without centralized cash backing?\n\nUXD Stablecoin\n\nUXD is a recently launched stablecoin protocol native to Solana. UXD aims to solve the stablecoin trilemma with a unique algorithmic design that is backed 1:1 for stable-like assets instead of relying on redemption methods to absorb volatility.\n\nEach UXD token is backed by a delta-neutral position on a perpetual derivatives exchange.\n\nWhile sounding complicated, the design is actually rather simple. Users deposit collateral such as SOL to the protocol and receive $1 of UXD in return for every $1 of SOL deposited. The SOL is then deposited to a perpetual exchange protocol (Mango Markets) as collateral and then an opposite short position is taken at the same value of the deposited SOL. So if the price of SOL falls -10%, the deposited SOL collateral would lose -10% of USD value, however, at the same time, the short position would gain +10% of USD value resulting in a net 0% move of UXD’s collateral in USD terms.\n\nHaving a net 0% move relative to the underlying asset is the definition of delta-neutral. Effectively, the UXD protocol simulates having stable assets as collateral but with volatile assets enabling it to back each UXD token 1:1 with decentralized assets.\n\nWhen a user wishes to redeem UXD for collateral, the process flows in reverse. Users burn UXD with the protocol and in return receive the exact USD amount in SOL or the collateral token of their choice. To return the user’s SOL, the protocol closes the SOL short position on the perpetual exchange for the exact dollar amount of UXD burned and the freed up SOL collateral is withdrawn to the UXD protocol at which point it is returned to the user.\n\nAs a result, the supply of UXD can scale much faster and much more efficiently than CDP stablecoins since these require more USD value of collateral than stables issued. UXD with its 1:1 stable asset backed position should more closely resemble the stability of fiat-backed stablecoins, but with the added benefit of being decentralized and censorship resistant. This same stability property is an added advantage compared to other algorithmic stables which rely on redemptions and secondary tokens to absorb volatility. Mechanisms like such are highly complex and have in the past broken peg in times of high volatility.\n\nFraming the UXD token against the stablecoin trilemma:\n\nDecentralization: UXD utilizes decentralized assets to form stable USD positions (delta-neutral) and the UXD protocol is itself designed as decentralized and its overall decentralization is dependent on the perpetual protocols it leverages.\nStability: Collateral in UXD is traditionally volatile but synthetically stabilized via derivatives, recreating the dependability of fiat backed stablecoins without reliance on centralized providers. Also, the protocol design relies on 1:1 backing guarantee with collateral assets rather than complex redemption mechanisms involving non-collateral assets (FXS and LUNA) which have only had a short history combating volatility.\nEfficiency: UXD scales at a rate of $1 UXD for every $1 deposited in collateral which is far more efficient than collateral debt position stables which require more than $1 to mint $1 in stables. While the 1:1 mechanism favors stability, it is less efficient than floating collateral factor stablecoins like FRAX which can have less than $1 in collateral for every $1 in stables. Large enough perpetual markets is the chief constraint on UXD scalability, not collateral.\n\nFor the protocol to have long term viability, a revenue source is required to align incentives and fund growth. UXD Protocol doesn’t plan to collect fees from users but rather to absorb cash flows from an integral part of perpetual exchanges - the funding rate. Funding payments on perpetual exchanges arise due to the fact traders on the exchange are trading representations of tokens, not actual tokens. Since there are no actual tokens involved, the market price on the perpetual exchange can deviate from the true market price of the underlying token being traded. To keep prices aligned, a funding payment is introduced which scales relative to the trade imbalance. If the traders on the perp exchange are overweight on the long side (which is often the case in crypto), then the funding payment would be positive where the long traders pay a percentage fee to traders holding short positions. This mechanism incentivizes traders to take the unpopular side of the trade which has the effect of pushing the perpetual exchange price back towards the true market price.\n\nSince funding historically has been positive in crypto markets, that means traders with short positions like UXD Protocol will receive funding payments from traders with long positions. However, this is not always the case and when funding turns negative, UXD Protocol requires a mechanism to pay funding payments without impacting UXD holders. To do so, an insurance fund is employed which was adequately funded ($57M) in the IDO sale of the UXP token.\n\nOverall, like many stablecoin projects, UXD aims to drive real productive use cases for the stablecoin. Productive use cases are largely centered around financial usage as opposed to speculation or a rewards vehicle. For example, debts denominated in a stablecoin drive real usage as borrowers subsequently use the stable in swaps and continue to hold the stable in regard as their debts are denominated in the token. This drives the need for deep money market pools (borrowing) and for liquid AMM pools (swaps). Less productive uses involve staking and farming which drive liquidity but ultimately are unstable, short-term masquerades of adoption. UXD’s stated roadmap is focused on driving long-term health through more productive uses of the stablecoin.\n\nUXD Tokenomics\n\nUXD protocol is governed by the UXP token. UXP was offered in a public IDO ending November 14th that raised over $57M from 3,676 investors. Funds raised in the IDO are directed towards the insurance fund which is responsible for backstopping any negative funding payments incurred on the perpetual exchanges and any protocol exploit. According to the UXD documentation, the insurance fund at its current size would be able to sustain a year’s worth of -11.4% interest on $500M of UXD. Governing the insurance fund is the responsibility of the forthcoming UXP DAO.\n\nIn addition to IDO funds, UXD raised a $3M seed round from prominent solana ecosystem investors Multicoin, Alameda Research, Defiance Capital, CMS Holdings, Solana Foundation, Mercurial Finance, Solana Founders Anatoly Yakavenko and Raj Gokal, and Saber DEX founder Dylan Macalinao.\n\nUXP holders will be the sole governing body of the UXD DAO. As such, holders are responsible for stewardship of the insurance fund and participating in governing actions. Potential governing actions could include adding new exchange integrations, adding new collateral types, protocol income management, and general improvements to the protocol.\n\nRevenue for the UXD protocol is derived from two main sources. First and foremost is the positive funding payments as a result of the short position on the perpetual exchange. Funding in crypto has historically been positive meaning UXD, over the long term, can be expected to rely on this revenue stream as the primary source of cash inflows.\n\nUXD Protocol’s second form of income is from active management of the insurance fund. Non-essential to business operations, the insurance fund is usually kept idle, only to be used during times of negative funding (shorts traders overweight longs on the perp exchange). For capital efficiency, UXD will explore asset management strategies for the insurance fund. Ultimately though it will be up to the UXP holders to dictate the management of the insurance fund.\n\nProtocol Challenges\n\nOutside of general smart contract risk, there exist a few key challenge areas for a protocol like UXD to not just work, but to scale efficiently to the size a stablecoin protocol needs.\n\nPerpetual Market Size - Currently there is roughly $30M in open interest on Solana Perpetual Exchanges ($17M on Mango across all their L1 token markets and $11M on Drift Protocol). Stablecoin marketcaps require nearly $1B in market cap to be considered successful and to be considered sufficiently liquid for widespread use. In order for UXD to reach significant levels of adoption, the amount of market activity on Solana Perpetual exchanges would need to scale significantly. At the current size of the perp markets, UXD would almost assuredly drive the funding rates negative on the exchanges since it would create an imbalance of positions to the short side. However, this would attract more traders to trade against cheaper fund borrowing rates so there is a self-referential playbook here that can scale both UXD and the perpetual markets on Solana.\n\nNegative Funding Rates - Along the same vein, when funding rates on the perpetual exchange turn negative, it’s on the UXD protocol itself to pay out. Usually, funding rates are positive in crypto due to the much larger demand to be on the long side of assets and in this case UXD protocol would be making additional money via traders paying it funding. However, if UXD scales faster than OI on the exchanges, there exists a real possibility funding could get driven negative and the protocol would be paying. To counteract this probability, sufficient funds are stored in the insurance fund to cover negative funding periods (which have historically not been long in duration). In the unlikely event that the insurance fund is depleted paying funding payments, additional UXP would be auctioned off to replenish the insurance fund. Even in this unlikely event, the insurance fund would not rapidly be depleted via funding payments (no flash crashes, just fairly predictable payments over known periods of time) so UXD holders would nearly always be able to redeem for collateral.\n\nExchange Exit Liquidity - Related to exchange sizes, there needs to exist enough counterside liquidity for UXD to unwind its short positions. UXD by design puts on short positions every time a user deposits collateral into the protocol, but when the UXD holder wishes to exchange the stablecoin for their collateral, the short position needs to be unwound and the collateral returned. For this to happen, there needs to be liquidity (users or market makers) on the exchange willing to sell tokens to UXD protocol in the size required. This risk is more prevalent in times of market volatility.\n\nTreasury Management - UXD as a protocol is designed not to make money from UXD users but in the way it manages its collateral (positive funding rates) and its insurance fund. As the insurance fund is deployed in asset management strategies, the benefit is clearly the capital appreciation of the fund size. However, on the flip side there is introduced risk that funds are subjected to which needs to be taken into account. Not a great concern as presumably the fund will be deployed in low-risk strategies with the only notable risk being smart contract risk.\n\nUXD Supply and Demand - Every stablecoin is subject to fluctuations in demand which can drive prices off peg. What matters is the ability of the protocol to absorb price volatility via redemption mechanisms to remain at peg or user confidence in the future redemption abilities (fiat stablecoins). UXD offers both avenues but as a growing stablecoin, it’s still subjected to the risk - especially in its early stages when concentrated amounts of UXD can experience more volatility pressure than if the supply of UXD was vast.\n\nLooking Ahead\n\nUXD offers a unique solution to the stablecoin landscape. As Solana continues to build out its DeFi ecosystem, having truly decentralized, native stablecoins will greatly benefit the ecosystem as a whole. Market demand for this type of solution is rapidly increasing, not just on Solana, but across DeFi as projects and users alike look for stable assets without centralization risk and that synergistically benefit the ecosystem. UXD has the potential to propel Solana’s already thriving derivatives market into new territory by catalyzing the cost of trading down and providing sufficient stable liquidity.\n\nThis report was commissioned by UXD, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Dustin Teander", "url": ""}, {"name": "Anirudh Tiwari", "url": ""}], "published_at": "2022-02-03T14:30:00Z", "author": {"name": "Dustin Teander & Anirudh Tiwari"}, "tags": ["Stablecoins"], "url": "https://messari.io/article/uxd-tackling-the-stablecoin-trilemma"}, {"id": "080ea4bc-7979-48ed-9baa-55da6821dfca", "title": "State of Compound: Q4 2021", "content": "The following report was written by Messari Hub Analyst(s) and commissioned by the Compound Grants committee, a member of<a href=\"https://messari.io/hub\"> Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nTo expand on this report, we held a live Crowdcast event featuring Dustin Teander, Sami Kassab, and Getty Hill, co-founder of GFX Labs and 2021 Compound Grants Committee member. View the full recording now!\n\nIntroduction to Compound\n\nLaunched in September 2018, Compound is a leading interest rate protocol built on Ethereum that enables users to permissionlessly borrow and lend assets from a pool of collateral. It sets interest rates for those assets algorithmically using an interest rate model based on the proportion of assets lent out, which it calls the utilization ratio. Compound launched its V2 protocol in May 2019, which introduced additional assets, individual risk models, and smart contract gateways for each asset, among other features. In April 2020, Compound replaced the administrator of the protocol with community governance, empowering COMP token holders to take control of the protocol. In June 2020, Compound <a href=\"https://messari.io/article/the-agricultural-revolution-of-defi-is-underway?referrer=grid-view\">began distributing</a> COMP to users via a pioneering liquidity mining program reserving 42% of the total COMP supply to be distributed to users over the next four years.\n\nCompound Markets - Macro Overview\n\nFueled by strong overall market conditions that saw two all-time high breakouts from Bitcoin in Q4, Compound closed the quarter with quarter-ending highs in several key categories - namely outstanding loans and outstanding deposits.\n\nStrictly looking at quarter-ending figures, outstanding loans and outstanding deposits saw modest growth at 7.5% and 1.0%, respectively. Net income grew over 19% as market conditions dramatically improved from Q3, which attracted new borrowing demand, driving increases in interest income (+11%) and liquidation income (+27%).\n\nPlaguing the quarter-ending figures, however, are two key periods worth noting. On the quarterly close date of Q3, the COMP distribution bug caused roughly $3B worth of closed loans and withdrawn deposits. As a result, Q3 quarter-ending figures drastically underrepresent the state of usage of Compound at the time. Comparison of the underrepresented Q3 figures to quarter-ending Q4 figures masquerades modest declines in usage as modest growth.\n\nUpon resolution of the COMP distribution bug in mid-October, capital quickly reestablished prior levels of usage at approximately $18B of deposits and over $7B of outstanding loans. Capital levels remained at these levels until late November when broader crypto markets began to sell off causing leverage demand and collateral deposits to wane going into the last month of the quarter. As such, Q4 quarter-ending figures represent a state of a slow decline of usage as opposed to the modest growth reflected in the quarter-to-quarter figures.\n\nOutstanding Loans, while up 7.5% on the quarter, are down 23% from the highs established in early December. Loans remain predominantly in stables (USDC and DAI) as borrowers overwhelmingly favor stable forms of debt over volatile debts. During the contraction in borrow demand across December, DAI exhibited less overall loan contraction (-23%) than the more favorable borrowed USDC (-30%). As a result, DAI surpassed USDC as the most heavily borrowed asset on Compound to end the quarter.\n\nBorrower interest rates saw upwards volatility in October, with interest rates normalizing shortly afterward through the end of the quarter at slightly higher levels than otherwise seen in Q3. The average annualized borrowing rate for the quarter saw a moderate increase from 4.1% in Q3 to 5.0% in Q4. October’s borrowing rate volatility was due to two primary factors acting in tandem. First was the relatively slow redeposits of stables following the rapid withdrawals during the COMP distribution bug leading to a low supply of the most borrowed assets. The second was the general market conditions reaching all-time highs driving significant demand for leverage. Both forces working together - one causing low supply and the other demand spikes - resulted in borrowing rate volatility.\n\nSimilar to outstanding loans, by the end of the quarter, outstanding deposits had fallen 26% from the quarterly highs established, resulting in a relatively flat quarterly growth rate of 0.2%. With rising asset prices factored out, growth rates would have turned negative for Q4. WETH remained the largest deposited asset on Compound while DAI contributed the most to outstanding deposit growth as Coinbase’s new ‘DeFi Yield’ product opened a new influx of DAI through December to counteract the general withdraws occurring across Compound markets during the month. DAI is now the second most deposited asset in Compound and the most borrowed asset.\n\nOutside of rate fluctuations during the COMP Distribution withdrawal period, depositor interest rates during the quarter stayed relatively in line with Q3’s all-time-low interest rates. Rates slightly increased over the quarter with the average annualized depositor rate increasing from 1.8% to 2.0%. Rate stabilization at these levels is indicative of product maturity as Compound liquidity consistently matched borrowing demand.\n\nCompound’s aggregate utilization ratio continued to trend downwards, starting at the beginning of 2021, which best highlights the trend of depositor growth continuing to outpace loan growth. Additional sources of on-chain leverage coming online mid-2021 and rapidly maturing stablecoin liquidity continue to ease down Compound utilization rates as supply meets demand.\n\nQuarterly interest income rebounded in Q4, increasing 16% from $78 million to $90 million, as the combination of interest rate spikes and sustained periods of high deposits and borrowing drove additional income compared to Q3’s largely risk-off environment. DAI and USDC accounted for the greatest drivers of interest income due to their borrowing popularity, representing nearly 75% of all interest income generated in Compound markets for the quarter.\n\nCompound generates protocol income by implementing a “reserve factor,” which is a percentage taken out of the interest paid by borrowers that can be used by governance for a variety of use-case or act as an insurance against borrower default. Reserve factors vary by asset, with DAI having the highest reserve factor of all stablecoins (the most borrowed asset on Compound) on the platform at 15%. For this reason, DAI has consistently been the most significant contributor to protocol income over the past five quarters, generating over 50% of protocol income in Q4. Protocol income increased 11% in Q4 rising from $9 million to $10 million, primarily attributed to DAI representing a larger share of the outstanding loans.\n\nNew loans (originations) continued to trend downwards significantly (-31% on the quarter) while overall outstanding loans remained relatively flat. Nearly 65% of the Q4 originations occurred in October when liquidity reestablished levels prior to the COMP distribution bug. Following this period, new loan demand dampened across the quarter ultimately leading towards regression in overall loan volumes in December.\n\nDeposit volume increased significantly in the quarter which can be attributed to both deposits flowing back into Compound markets after the COMP distribution bug resolution and the new Coinbase ‘DeFi Yield’ product. DAI made up 70% of the deposit volume in Q4 with 75% of the new DAI deposits occurring after the launch of the Coinbase integration in early December.\n\nLiquidations increased 28% in Q4 from $27 million to $34 million, which is relatively low compared to previous quarters. Liquidations remain near the lowest levels seen in the past year due to relatively muted volatility and maturing markets.\n\nLastly, one of the key drivers of all the activity in the Compound markets is the COMP token incentives for depositors and borrowers. Token incentives on a USD basis declined in Q4 by -35%, driven by COMP prices continuing to decline to a new low not seen in nearly a year. However, on a token basis, COMP rewards were only down -4.6%, primarily due to the COMP distribution bug remediations and pausing of COMP rewards for borrowing COMP.\n\nCompound Markets - Micro Overview\n\nCompound’s markets saw quite a few changes in Q4, including modifications to risk parameters across various assets, the addition of a Pax Dollar (USDP) market, and a flippening in the largest borrowing market compared to Q3. Stablecoins continue to be the most popular borrowing asset over more volatile assets, following the trend from previous quarters of stablecoins maintaining high utilization rates while the volatile assets remain in the single digits for utilization. The five largest Compound markets are further analyzed below.\n\nDAI\n\nIn Q4, DAI became Compound’s largest market by loans outstanding and was the single greatest driver to outstanding loan growth in the quarter, increasing 35% from $2 billion to $2.8 billion. DAI was also the most significant driver of outstanding deposit growth this quarter, increasing 37% from $2.5 billion to $3.4 billion, with deposit volume increasing 587% from $6.5 billion to $44 billion. This large increase in demand and outperformance compared to other markets can be attributed to Coinbase’s integration with the Compound protocol within their new DeFi Yield product, which allows users to earn a variable interest rate on DAI. The utilization rate decreased 1.2% by the end of the quarter, causing borrower interest rates to stay relatively flat, decreasing from 4.7% at the beginning of the quarter to 4.5% by the end of the quarter.\n\nWith the large inflow of DAI entering Compound’s markets, DAI ended the quarter replacing USDC as the most popular borrowing asset, representing 46% of all the outstanding loans.\n\nUSDC\n\nUSDC saw a decrease of 7% in outstanding loans this quarter after being the largest driver to loan growth in Q3. Utilization rates decreased roughly 5% due to subsiding borrowing activity, which resulted in interest rates decreasing from 7.6% to 4.4% by the end of the quarter.\n\nUSDT\n\nUSDT was largely a similar story to USDC in Q4. Low growth of around 1% in outstanding loans coupled with a nearly 6% increase in overall deposits resulted in a 4% decline in utilization. USDT interest rates fell slightly from 5.6% to 4.8% at the end of the quarter as a result.\n\nWBTC\n\nOutstanding loans for WBTC increased 13%, ringing in an all-time quarterly high of $135 billion. Outstanding deposits slightly decreased 2% in the quarter despite BTC’s price rising from $43,825 to $47,121. This increase in price artificially supported the outstanding deposit metric, which would’ve decreased 12% from Q3 to Q4 if BTC’s price would have stayed constant. After the BTC price peaked in late October, WBTC deposits remained relatively flat throughout the end of the year.\n\nWETH\n\nWETH is Compound’s largest market by deposits outstanding but had a slightly negative quarter decreasing 3% from $5.5 billion to $5.4 billion. ETH’s price increased from $2,938 in Q3 to $3,739 in Q4, a 27% increase. Without ETH’s price appreciation, deposits outstanding in Q4 would have been down 28%.\n\nWETH represents 38% of Compound’s deposits outstanding, with DAI now being the second largest at 24%, surpassing USDC.\n\nGovernance & Key Events:\n\nKey Events\n\nCoinbase Integration\n\nIn early December, Coinbase announced its users in 70+ countries (excluding the US) would have access to Coinbase’s first DeFi protocol integration product, ‘DeFi Yield’. With ‘DeFi Yield’ users are able to earn a variable yield on DAI through the Compound Protocol. Coinbase offers the product without gas cost, fees, or lockups. As a result, the average daily DAI deposits tripled following the announcement. Average daily DAI deposits in the quarter prior to the announcement were $0.16B while after the product release on December 9th, $1.4B DAI on average was deposited into Compound.\n\nCOMP Distribution Bug + Continuous Audits\n\nExecuted just prior to Q3 close,<a href=\"https://messari.io/governor/proposal/d0c0861c-96a2-49df-b483-439d6d6f7d8f\">Proposal 062</a> implemented a bifurcation of COMP rewards between deposits and borrows while also unintentionally introducing a bug that exposed certain markets to excess COMP rewards should users choose to claim the erroneously accrued COMP. As a result, ~200k COMP ($68M) was sent to the Compound Controller and misallocated.\n\nShortly after the bug’s discovery,<a href=\"https://messari.io/governor/proposal/8176960c-8d68-4390-9ee3-3a3db52142ec\">Proposal 064</a> was passed and executed to patch the bug.<a href=\"https://messari.io/governor/proposal/29a8ee16-0e17-48d7-9fdf-95cefd629fef\">Proposal 065</a> quickly followed in mid-October, which implemented a mechanism to recover over-accrued COMP and reestablished COMP rewards across the protocol.\n\nTo safeguard against future security concerns like the accrual bug, the Compound community invited proposals from a variety of firms to perform ongoing security reviews. In mid-December,<a href=\"https://messari.io/governor/proposal/f264556c-82d8-496e-9492-4aa8a925ef43\">Proposal 076</a> approved engagement with OpenZeppelin for continuous audit and security solutions.\n\nMakerDAO Deposit Module\n\nIn early December, GFX Labs and the Compound community proposed to MakerDAO to prioritize a Compound DAI Direct Deposit Module (D3M). D3M is a Maker Protocol implementation that enables Maker to directly inject DAI into the Compound DAI borrowing market. Currently, Aave is the only protocol to which D3M has been implemented. Voting passed on the MakerDAO poll in January 2022.\n\nGovernance Decisions\n\nProposal 076 - OpenZeppelin Continuous Protocol Audit - December 21st, 2021\n\nOpenZeppelin would provide a dedicated continuous audit services for all Compound governance proposals and will work with the Compound community to develop security requirements and to implement best practice security monitoring.\n\nOpenZeppelin has revised its original proposal to exclude performance fees. OpenZeppelin’s fee will be the equivalent of $1 million USD in COMP every quarter for one year, to provide these services. This fee covers all services defined in the proposal.\n\nOpenZeppelin’s proposal was considered by the community alongside Trails of Bits and ChainSecurity proposals. OpenZeppelin ended up winning the bid to provide continuous audit and security services to Compound.\n\nProposal 074 - Risk Parameter Updates for WBTC, BAT, and LINK - December 20th, 2021\n\nProposal 074 aimed to adjust three total parameters across three Compound assets. It changed the WBTC, BAT, and LINK markets as follows: cBAT Collateral Factor from 60% to 65%, cLINK Collateral Factor from 65% to 70%, cWBTC2 Collateral Factor from 65% to 70%.\n\nProposal 073 - Add PAX Dollar (USDP) - December 20th, 2021\n\nPaxos Standard was added as a stablecoin on Compound with the proposed risk parameters: collateral factor 0-25%, reserve factor 20-30%, no COMP speed, borrow cap 80%.\n\nProposal 072 - Risk Parameter Updates for WBTC, UNI, and COMP - December 8th, 2021\n\nProposal 072 adjusted three total parameters across three Compound assets. It changed the WBTC, UNI, and COMP markets as follows: WBTC Collateral Factor from 65% to 70%, UNI Collateral Factor from 60% to 70%, COMP Collateral Factor from 60% to 65%.\n\nProposal 071 - Risk Parameter Updates for DAI, BAT, ZRX, and ETH - November 27th, 2021\n\nProposal 071 adjusted four total parameters across four Compound assets to align with the moderate risk level chosen by the Compound community. It would: Set cZRX collateral factor to 60.0%, set cBAT collateral factor to 60.0%, set cDAI collateral factor to 80.0%, set cETH collateral factor to 80.0%.\n\nProposal 069 - Risk Parameter Updates for LINK, MKR, SUSHI, and YFI - November 17th, 2021\n\nProposal 069 adjusted 4 total parameters across 4 Compound assets. This proposal is a batch update of risk parameters to align with the Moderate risk level chosen by the Compound community. These parameter updates are the second of Gauntlet's regular parameter recommendations as part of Dynamic Risk Parameters: set cLINK collateral factor to 65.0%, set cMKR collateral factor to 55.0%, set cSUSHI collateral factor to 55.0%, set cYFI collateral factor to 60.0%.\n\nProposal 068 - End cCOMP Borrow Rewards - November 12th, 2021\n\nProposal 068 stopped COMP rewards for cCOMP borrowing using the new Comptroller function allowing for splitting COMP speeds. COMP rewards will remain the same for cCOMP suppliers.\n\nProposal 066 - Risk Parameter Updates for AAVE, LINK, MKR, SUSHI, USDC, and YFI - November 9th, 2021\n\nProposal 066 adjusted 6 total parameters across 6 Compound assets. The adjustments were as follows: set cAAVE collateral factor to 60.0%, set cLINK collateral factor to 60.0%, set cMKR collateral factor to 45.0%, set cSUSHI collateral factor to 45.0%, set cUSDC collateral factor to 80.0%, set cYFI collateral factor to 55.0%.\n\nProposal 065 - Correct Over-Accrued COMP - October 19th, 2021\n\nThis proposal corrects the amounts of over-accrued COMP due to the bug in Proposal 62 (September 29th) and fully restores the functionality of COMP rewards. It contains an exact list of users who have over-accrued COMP along with the exact amounts they over-accrued and calls a newly introduced one-off function, fixBadAccruals, to correct the over-accrued COMP.\n\nProposal 064 - Fix COMP Accrual Bug - October 9th, 2021\n\nProposal 064 patched the bug introduced in Proposal 62 and pessimistically allow COMP reward withdrawals until the bad COMP accruals can be fixed.\n\nThis new proposal also corrected proposal 63 which prevents further COMP from being distributed until the correct logic is restored but causes issues for protocols that integrated with Compound and required the claim functionality.\n\nGovernance Discussions\n\nCOMP Distribution Speeds\n\nAfter analyzing Compound and its markets’ compSpeed, GFX Labs proposed reducing compSpeed across markets. CompSpeed is essentially the amount of COMP distributed to suppliers and borrowers and acts as a liquidity incentive. GFX Lab’s core premise is that the roughly $160M spent annually in compSpeeds is overpaying for liquidity when sufficient liquidity already exists (new markets added being the exception).\n\nDiscussion centers around either reducing compSpeed to zero, gradually reducing the compSpeed, or doing nothing at all.\n\nGrant Program Overview:\n\nThe Compound Grants Program (CGP) 1.0 was an enormously successful experiment that ran from March 2021 to September 2021 with the simple idea of funding contributors to improve Compound. The program funded over 30 grantees with over $1 million in funding which went towards open-source dashboards, analytics, hackathons and much more.\n\nWith the conclusion of the first iteration of the grants program, a pause has been put on all new grants leading to zero grants being distributed in Q4. With the success of the initial grant pilot program, the grant committee members are preparing to double-down and create a grant program that is superior to GCP 1.0 in grant size, speed, and structure. GCP 2.0 is currently being built with no launch date announced yet.\n\nRoadmap\n\nNear-term objectives for Compound are to continue to add new markets and refine risk parameters, especially with the newly added OpenZeppelin continuous audit, which removes the burden of security from the community.\n\nFurther out objectives are largely centered around two main efforts from Compound Labs: Treasury and Gateway. Treasury is Compound’s B2B offering which aims to offer Compound yields to traditional firms. Gateway is the larger undertaking that is poised to holistically re-architect Compound to efficiently meet global scale demands.\n\nGateway\n\nIn March of 2021, Compound Labs announced a prototype based on a whitepaper for Compound Chain, an independent blockchain that would serve as infrastructure for cross-chain interest rate markets, known as Gateway. Gateway intended to be a Substrate-based blockchain that would facilitate borrowing and lending of native assets across various external blockchains. The goal was to introduce a new stablecoin, CASH, to be Gateway’s native unit created through borrowing, much like MakerDAO’s DAI, where all interest would be earned and paid in CASH.\n\nThis cross-chain interoperability was an ambitious and challenging undertaking with the potential to revolutionize the cross-chain lending and borrowing industry. Since the announcement of the Gateway project last year, the Compound Labs team had released multiple versions of a Gateway prototype, numerous other teams started experimenting with multi-chain approaches, and several cross-chain protocols lost assets to security incidents.\n\nDue to those events in the past year and the incredible speed at which the crypto ecosystem has been developing, the Compound Labs team decided to adapt and proposed an alternate approach to what they believe is the correct multi-chain strategy. The team decided that it was prudent to initially focus on launching Compound on EVM-compatible chains as fragmented markets rather than launch Gateway connected to starports on external chains. This alternate approach eliminates the risk and complexity involved with a shared liquidity pool, which the community can eventually decide to upgrade to in the future.\n\nIn Compound’s markets, stablecoins continue to be the most popular asset to borrow while more volatile assets are more popular as collateral. From this observation, one of the biggest design changes Compound Labs is proposing for their multi-chain approach is to only allow a single borrowable asset with an N number of collateral assets. This would create only one asset with an interest rate model, which would improve protocol risk and reduce the code base.\n\nThe next steps Compound Labs have outlined are to complete the initial code-base, begin security audits, deploy to test nets, and eventually launch the protocol on Ethereum when the community decides. From there, the community will have the ability to deploy the protocol on any external blockchain.\n\nClosing Thoughts:\n\nBeing a financial services business, Compound will always be influenced to an extent by the broader market and macro environment. Q4 started with a strong recovery in outstanding loans and deposits as capital flowed back into Compound markets after the COMP distribution bug caused a liquidity contraction at the end of Q3. Capital remained at those elevated levels throughout the quarter until the broader market began selling off towards the end of the year, driving Compound’s metrics down with it. Overall, Compound’s quarter-ending figures sit at all-time highs in key metrics like outstanding loans and deposits, as well as strong growth in net protocol income.\n\nWith Compound being one of the first protocols that has moved towards distributed governance and distributed development, incidents such as Proposal 062’s COMP distribution bug are a reflection of the organization model’s experimental nature. The Compound community has used this incident as a catalyst for change, where more participants will be involved with the governance and development process, leading to more thorough analysis and reviews on proposals going forward. The community has come out of Q4 stronger and with more lessons and tools under its belt. With the community focused on new protocol updates, exchange and protocol integration, and institutional adoption of DeFi, the future of the Compound protocol continues to shine bright.\n\nThis report was written by Messari Hub Analyst(s) and commissioned by the Compound Grants committee, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research by community analysts through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Dustin Teander", "url": ""}, {"name": "Sami Kassab", "url": ""}], "published_at": "2022-02-02T13:00:00Z", "author": {"name": "Dustin Teander & Sami Kassab"}, "tags": ["Decentralized-Finance", "Quarterly-Reports"], "url": "https://messari.io/article/state-of-compound-q4-2021"}, {"id": "27fd8606-5cf7-49aa-adb2-93f22692dc23", "title": "Centrifugal Transparency for Tokenized Assets", "content": "The following report was commissioned by Centrifuge, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nOne reason for the financial crisis of 2008 was the lack of transparency into the quality of the loans packaged for resale. Mortgages were bundled off-chain, tranched off-chain, marketed off-chain, and painstakingly pieced back together off-chain when the financial system collapsed.\n\nFounded in 2018, Centrifuge’s vision is to enable a DeFi structured money market where transparency exists right down to the individual asset (e.g., title to a piece of commercial real-estate) contained in a pool of collateral. Different participants will work together to bring the relevant data on-chain: asset originators, financial auditors, fraud scoring specialists, and valuation experts. When Centrifuge’s vision becomes a reality, financial services will be provided more transparently and efficiently by crypto native innovators. Similar to how Web2 brought massive efficiencies and economies of scale to commerce, Web3 bridged to real-world assets will eliminate rent-seeking behavior from intermediaries such as banks, lawyers, notaries, assessors, and underwriters.\n\nCentrifuge wants to increase transparency, but not at the cost of revealing private data for everyone to see on the blockchain. The Centrifuge protocol has native support for managing these privacy requirements. For example, only parties with a need to know the borrower’s identity have access to it.\n\nCentrifuge aims to prove that tokenizing and financing real-world assets on-chain is more efficient and more transparent than the existing solutions in traditional finance. The first dozen asset pools have been live since 2021, with more to come.\n\nReal-World Assets\n\nReal-world assets are different from other crypto assets. Crypto assets often derive their value from other crypto assets. Real-world assets (RWA) are very tangible (e.g., a title to a house), somewhat tangible (e.g., an invoice for 1,000 tires due in 60 days), or less tangible (e.g., future streaming royalties of a collection of songs by a particular artist).\n\nTo securely finance real-world assets on-chain, there needs to be a legal and commercial framework in place for ensuring that the process of providing the title to the asset as collateral is sound and that someone lending against the collateral can be assured legal recourse in the case of a non-performing loan. In mature markets, such as the US, well-established frameworks exist for repossessing an asset in such a case, and Centrifuge - at least initially - builds on these frameworks. Appropriately, it will take time before Centrifuge becomes available to borrowers in countries with less developed legal frameworks.\n\nCentrifuge’s main achievement has been developing a technology and a framework for bridging RWAs and DeFi. Centrifuge is not a lender; it is a platform providing the right primitives for lending based on real-world collateral.\n\nThe Centrifuge Chain and the Centrifuge Token\n\nSource: Centrifuge\n\nThe Centrifuge stack has a peer-to-peer messaging protocol to store and exchange business documents in a private, secure way, at the lowest layer.\n\nThe middle layer comprises the Centrifuge nominated proof-of-stake chain and the artifacts required to run real-world use cases as decentralized applications: NFTs linked by Anchors to privately shared documents off-chain. The first application is called “Tinlake” soon to evolve into the “Centrifuge App.” Other projects could build their own apps on top of the Centrifuge protocol, which is starting to happen: FinTech issuers are working on integrating automatic tokenization into their own technology platforms, one issuer is building a new UI specific to their asset class, and more.\n\nThe top layer connects Centrifuge to Decentralized Finance (DeFi) apps, such as Maker and Aave, where DeFi users have access to RWA lending.\n\nCentrifuge uses its own native token - the Centrifuge (CFG) token. It incentivizes validators and nominators to participate through a block reward. Similar to other chains, the token is used to pay fees for transactions and services, including storing business data for the long term and participating in governance. Users of Centrifuge can obtain rewards paid in CFG. These rewards are paid for through inflation. A balancing burning mechanism, where a portion of the fees are burnt, could help to stabilize token supply in the long term.\n\nAs Centrifuge grows in transaction volume, the CFG token is poised to accrue value from increased fees, governance, and burning mechanisms.\n\nBridging Real-World Assets\n\nCentrifuge is the platform allowing the exchange of value as shown:\n\nSource: Centrifuge\n\nFinal borrowers: e.g., entrepreneurs needing working capital to buy a property to “fix and flip” (example taken from New Silver, one of the first asset originators on Tinlake).\nAsset originators (AO): takes care of tokenizing (into NFTs) the assets (e.g., houses) and provides borrowers with fiat currency.\nSpecial Purpose Vehicle (SPV): an entity set up by the AO in a cookie-cutter way (framework provided by Centrifuge) to facilitate the legal agreements. It legally holds the tokenized assets and theoretically can be sued in real life (IRL) by the lenders or sue the final borrowers on default.\nLenders: individual investors or Maker vaults accepting Centrifuge-issued ERC-20 tokens in exchange for DAI.\n\nDROP and TIN are ERC-20 tokens specific for each lending pool (e.g., New Silver 2), representing the senior and junior tranches, respectively. The senior tranche gets stable and predictable interest and is the first to be paid back. The junior tranche takes on default risk by being the last party to be paid back and taking first loss, and in return, collects the difference between the (higher) interest paid by the borrowers and the (lower) interest paid out to senior tranche holders.\n\nAsset originators invest a portion of their working capital in the junior tranche to signal to the market that they have skin in the game. This portion is visible in the Centrifuge app under “Junior provided by Issuer.”\n\nReal Life Asset Pools\n\nIn February 2020, Centrifuge was preparing to launch with a handful of asset originators.\n\nAt the time of writing, there are 11 active pools on Tinlake, the decentralized app built on Centrifuge. The pools cover a range of real-world use cases, as shown:\n\nLink to Pools: https://tinlake.centrifuge.io/\n\nProtocol Performance\n\nCentrifuge set out to prove to the world that its model works, and the protocol has seen steady growth in TVL since last summer. After initial experimentation and yield farming (CFG rewards), the number of investors has consolidated, but the average ticket size has increased.\n\nAs of mid-December, high net worth individuals had the most significant share of the value locked, with protocols (currently only Maker) following second.\n\nCentrifuge Investor Onboarding\n\nCentrifuge is not an RWA financing app. Centrifuge is an on-chain securitization platform that provides the architecture and financial primitives for RWA financing apps to be built on top of. Those apps will be open, decentralized, and permissionless.\n\n- Jeroen Offerijns, CTO, 2021-12-11\n\nCentrifuge and other involved parties need to “Know Your Customer” (KYC), something they have solved by using Securitize, which takes care of storing and validating a users' name, email, physical address, local tax ID, and a copy of the user’s passport.\n\nOnce KYC is passed, a contractual relationship with the Asset Originator (e.g., New Silver) is established. This is in the form of a contract on Docusign. The contract has 41 pages.\n\nThe contract stipulates arbitration in the state of Delaware and explicitly waives the right to a court trial. This seems to have become a common way of reducing risk for the company.\n\nAnother step in the process is the necessity to fill in a US tax form, known as W8BEN. The PDF form contains some helpful hints, as it may be difficult for some users to find the required information regarding specific clauses of tax treaties and percentages of tax withholding.\n\nIt remains to be seen how this process can evolve in the future and to what extent it is suitable for non-professional investors. Having to sign a 41-page-contract and submitting a US tax form may be a deterrent for some users and may seem miles away from the ease and playfulness of DeFi.\n\nAave Real-World Assets\n\nAave just launched the “Real World Assets Market.” The company (a Centrifuge spin-off, soon to be a DAO) behind it still requires KYC and a subscription agreement, but it is lighter than the current one. The DAO then plays the role of the Lender, which is relied upon for taking any recovery steps in case the loans become non-performing. Essentially, users invest in an Aave pool backed by different RWA collateral. The APY will be floating based on the utilization of the pool. Centrifuge is hoping for a TVL of $25-50M, representing about 50-100% of the current TVL.\n\nCentrifuge’s strategy is to focus more on professional, institutional investors, who have more assets to invest, have a longer time frame than typical retail yield farmers, and are encouraged rather than deterred by the legal frameworks.\n\nRoadmap\n\nMoving Tinlake to Polkadot\n\nCurrently, Tinlake is a dApp on Centrifuge, which is interoperable with Ethereum, the blockchain with the largest available capital and liquidity but the highest transaction costs and the slowest transaction speeds. Interoperating with Polkadot removes these two barriers. There will still be a bridge to Ethereum so that the massive liquidity on Ethereum can still be tapped into, but most of the data will be managed on the Substrate chain.\n\nIntegrating Centrifuge with Polkadot\n\nIn December 2021, Centrifuge started participating in the crowdloan campaign for auction batches 6-11. At the time of writing, it appears Centrifuge will win slot #8 in January 2022. Obtaining a slot will enable the protocol to move its stand-alone chain to a parachain on Polkadot.\n\nBy taking advantage of Polkadot’s security model, the security of Centrifuge increases, and therefore the investor’s risk premium goes down. This should benefit the protocol.\n\nBy taking advantage of cross-chain bridges within the Polkadot ecosystem (XCMP), Centrifuge gets access to a larger group of investors (compared to a stand-alone chain).\n\nCompetition & Risks\n\nCentrifuge is a first player in a very immature market. They expect the market to grow massively and mature over the next five years. This will invariably bring many competitors into the game. As first movers, Centrifuge is well-positioned if they continue to innovate, improve the user experience, and invest in increasing adoption for asset originators and investors.\n\nPotential risk scenarios:\n\nA major player in the real estate financing market adopts similar techniques and implements a similar platform. Through their marketing machinery and strong network of asset originators and investors, they acquire the lion’s share of the market, forcing Centrifuge into other asset classes.\nA major player in the crypto lending space branches out into RWA and dilutes Centrifuge’s market share (less likely, since connections IRL are essential).\nA major player in the metaverse real estate financing market branches out into RWA. Today it is uncertain who that could be, but anything seems possible in crypto.\n\nConclusion\n\nCentrifuge is proving that bridging real-world assets to the blockchain is possible. The integration with Maker and Aave shows how Centrifuge is deeply integrated into the DeFi ecosystem.\n\nGiven the sheer size of the assets that could be tokenized and put on-chain, it appears there is a massive opportunity for Centrifuge. Seizing the opportunity relies on a combination of well-established legal frameworks in the jurisdictions Centrifuge operates in and a well-functioning technology stack ranging from P2P messaging to blockchain bridges and token economics.\n\nHowever, many issues may still need to be solved, especially on the KYC user experience side, before RWA transactions are as seamless as today’s crypto-only DeFi transactions.\n\nThis report was commissioned by Centrifuge, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Matthias Funke", "url": ""}], "published_at": "2022-02-01T14:30:00Z", "author": {"name": "Matthias Funke"}, "tags": ["Decentralized-Finance"], "url": "https://messari.io/article/centrifugal-transparency-for-tokenized-assets"}, {"id": "eae8aa3d-d765-44b8-b5d4-9ed44ef6a6b9", "title": "Weekly Recap Ending January 27", "content": "Weekly Recap Ending January 27\n\nNotable Messari Intel Updates\n\nRipple announced that it <a href=\"https://messari.io/intel/event/cd6e7f35-6a44-435f-8999-0aa7be8b684a\">bought back</a> the shares from the investors who financed its $200M Series C round in December 2019.\nThe Compound team has <a href=\"https://messari.io/intel/event/e059aaac-d871-4050-a706-8cb4e6e2f153\">released updates</a> to the Gateway project multi-chain strategy.\nThe Espresso hard fork has been <a href=\"https://messari.io/intel/event/12795df1-1a4c-46f2-984c-de7cd77b9fa4\">pushed back</a> to block number 11838440, which should occur at 12:15 PM PST on Mar. 8, 2022.\nThe Diem Association (as reported by WSJ and others) is <a href=\"https://messari.io/intel/event/1ec3a218-78f3-441a-a849-d681ca72f928\">winding down operations</a> and selling its technology to Silvergate Capital Corp.\n\nNotable Messari Governor Updates\n\nMagic Internet Money DAO submitted a <a href=\"https://messari.io/governor/proposal/b58fee72-31a8-4bd5-b5b9-cb708d342fb2\">proposal</a> that aims to use 98B SPELL tokens to acquire the Wonderland Money Treasury and merge the two projects. Discussions are currently open.\nOlympus DAO submitted a <a href=\"https://messari.io/governor/proposal/f6c9e11e-d107-490d-91c7-93750284aebb\">proposal</a> that aims to authorize the Olympus DAO Policy team to create and launch Inverse bonds as a market lever that ensures OHM trades above its treasury backing. The off-chain vote passed with a 99.88% approval.\nSaffron DAO has submitted a proposal that aims to move SFI buy-backs to Bancor in exchange for Liquidity Mining rewards of 2,500 BNT per week (5,000 BNT with multiplier) for 8 weeks. <a href=\"https://messari.io/governor/proposal/07fa7065-f835-491b-a3fb-1fa1bb7742a6\">Voting is currently active</a>.\nThe SpookySwap DAO <a href=\"https://messari.io/governor/proposal/bbf5fa17-a253-4cec-9384-fbdf433d7d52\">failed</a> to pass a proposal that aims to increase the amount of BOO that is staked in xBOO and then concurrently staked in 0xDAO to farm OXD. The proposal allows voters to select the amount of BOO added from: 0, 100,000, 200,000, or 300,000.\n\nSector Returns\n\nThe markets continue their downward trajectory as this week marks the third week in a row with negative returns across all sectors. Four of the six sectors covered suffered double digit negative returns with Smart Contract Platforms and Web3 within less than one percent apart to be tied for last place. Ultimately Web3 had the highest drawback of -22.09% followed closely by Smart Contract Platforms returning -21.26%. Gaming was the sector with least amount of decline at -6.62%.\n\nTop Assets\n\nAll assets ended the week with double digit negative returns. The sector traded with high correlation throughout the week with Bitcoin (BTC) and Dogecoin (DOGE) trading places various times. The two ended the week with almost identical returns, Bitcoin (BTC) having the least losses by a margin of 0.1% returning -11.5%. The asset with the largest decline was Solana (SOL) with a return of -31.7%.\n\nDeFi Assets\n\nMaker (MKR) broke away from the pack on Saturday and traded well above the rest for most of the week but lost momentum towards the end as some of the assets from the sector recovered lost ground. The Dai-issuing platform – MakerDAO – ended the week in second place, returning -14.6%. As the rest of the tokens gained footing, Loopring (LRC) trended upwards faster than the rest but its late week surge was not enough to end the week with a positive return. It finished with a -7.4% decline while the laggard of the sector was Curve (CRV) returning -31.2%.\n\nSmart Contract Platforms\n\nIt was a tough week for Smart Contract Platforms as it was the second worst performing sector in the report and recorded double digit negative returns across all assets. Cosmos (ATOM) broke upwards from the group on Monday but quickly lost momentum and rejoined the rest towards the end of the week. Even though Cardano (ADA) was one of the most discussed projects this week due to the launch of the first DEX on the Layer 1, many were frustrated with the congestion that this caused in the network. ADA took third place, losing 18.5% on the week. Cosmos (ATOM) took first place with the least decline of the sector, returning -14.1% while Solana (SOL) took last place for the second time in this recap, ending the week with -31.7%.\n\nCurrencies\n\nThe Currencies sector traded with similar synchrony to the Top Assets sector with all assets ending the week in double digit negative return territory. Bitcoin (BTC) suffered the least in the sector, returning -11.5% while the worst performer was Zcash, declining 30.1% on the week.\n\nWeb3\n\nEven though no sector had an asset end the week with a positive return, Helium (HNT) was the closest one to do so. The decentralized IoT network made a clear U shaped recovery on the week but it was not enough to finish in the green, returning -0.6%. The rest of the assets were left far behind with the next up returning -14.2% (BAT) while Theta (THETA) took the worst hit of the sector, returning -33.3%.\n\nGaming\n\nWhile all Gaming assets traded closely for most of the week, two projects: PLA (PLA) and Ultra (UOS) broke out towards the end of the week. Unfortunately this was not enough to give rise to positive returns as PLA (PLA) ended the week with a return of -10.3% while Ultra (UOS) followed closely, returning -10.8%. The worst performer of the pack was Alice (ALICE), ending the week with a substantial 33.3% decline.\n\n", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-01-28T14:53:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-january-27"}, {"id": "153f983d-a8b9-4539-8e4c-ce99a54eebdb", "title": "State of Avalanche Q4 2021", "content": "The following report was commissioned by Ava Labs, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nJoin us live on Crowdcast on Wednesday, February 2nd at 1pm EST to hear Ryan Selkis, Chase Devens, and James Trautman have a more in-depth conversation with the Ava Labs team about the current state of Avalanche and their roadmap for the future. Sign up to reserve your spot now.\n\nKey Takeaways\n\nAvalanche recorded all-time highs in active addresses, transactions, TVL, and market capitalization during Q4 fueled by incentive campaigns and network partnerships.\nThe arrival of Aave and Curve sparked a network-wide DeFi boom; the number of contracts deployed and unique contract deployers to the network both reached an all-time high in December.\nSeveral patches were introduced at the network level to combat spiking transaction fees.\n\nIntroduction to Avalanche\n\nThe Avalanche network is a Proof-of-Stake (PoS) smart contract platform for decentralized applications. Whereas most competitors use consensus mechanisms in the Classical or Nakamoto families, Avalanche differentiates itself through its creation and implementation of a new consensus family known as “Avalanche consensus.” Following years of research, the Avalanche mainnet was launched in September 2020 and featured the release of all three Avalanche chains (the P, X, and C chains). As the first edition of quarterly coverage on Avalanche, this report will highlight important developments since the launch of Avalanche’s mainnet in addition to standard evaluation of the network’s most recent quarterly performance. A full appendix of quarterly events and data are available at the end of the report.\n\nNetwork Overview\n\nOne of the defining narratives of 2021 was the rise of alternative Layer-1 smart contract platforms that began eating away market share from the industry leader, Ethereum. Due to congestion on the Ethereum network and slow rollout of Layer-2 scaling solutions, newer Layer-1 platforms were able to offer better support for marginal users. After its late 2020 mainnet launch, the Avalanche network found itself in the right place at the right time to welcome new participants into its economy.\n\nThe launch of the official <a href=\"https://messari.io/intel/event/aca2f972-e29b-4756-8e01-9293b199a917\">Avalanche-Ethereum bridge</a> in February 2021 saw the first small group of users trickle into the network. However, these early adopters would be forced to wait until Q3 for more company in this uncharted ecosystem. Material network growth began in the second half of August following the release of an upgraded bridge and the announcement of liquidity mining incentive programs. Avalanche averaged around 10,000 daily active addresses during Q3 before experiencing exponential growth throughout Q4 and averaging roughly 70,000 active addresses per day. Whether this can be attributed to long-term network effects or temporary incentives will be an area to monitor going forward.\n\nNot surprisingly, transaction activity on the network followed a nearly identical pattern to that of address growth. The mid-October spike in transactions can be partially attributed to the launch of Aave and Curve on the network as part of the $180 million Avalanche Rush liquidity mining program. It should be noted that the dollar value for the Avalanche Rush campaign announcement was quoted when AVAX was trading at around $20.\n\nOn aggregate, Avalanche finished Q4 averaging about 475k transactions per day, a number that is almost 40% of Ethereum’s roughly 1.25 million average transactions per day. Given this rapid adoption, Avalanche is becoming an enticing platform for upcoming projects that want to maintain EVM compatibility while attracting fee-sensitive users. While gas fees were trending up in tandem with transaction volume on Ethereum, Avalanche’s daily average transaction fees remained relatively stable despite an increase in transaction volume. Q4 witnessed a few notable spikes in transaction fees, but at its peak, users were only forced to pay an average of $3 for their requests, still a fraction of Ethereum’s Q4 daily high of $62 per transaction.\n\nAvalanche recorded its highest quarterly relative valuation growth in Q1 2021. Given that the network supported less than 2,000 average active addresses and only generated an average of 11,000 transactions per day, it appears the 917% quarterly market cap growth was driven primarily by speculation. This resulted in a 373x price-to-sales (P/S) ratio. Fundamentals began catching up to the forward-looking valuation in Q3. The distribution of Avalanche’s network revenue (transaction fees) is atypical for smart contract platforms; rather than distributing transaction fees to validators, 100% of fees are burned from the network’s circulating supply. This drives value to all token holders in the form of increased scarcity rather than compounding the balances of validators and delegators. Q3 transaction volume grew 228% from Q2 while transaction costs remained relatively stagnant, allowing the network to produce just over $7 million worth of revenue and bringing its P/S ratio down to 267x - a 56% decrease from its quarter-ending high of 604x in Q2.\n\nAs the market's valuations cooled off in Q4, Avalanche's revenue continued to grow at an exponential rate in tandem with its transaction growth. The network produced $30 million in revenue during the quarter and saw its P/S ratio nearly half again to 160x. Comparing this Q4 P/S ratio with its PoS competitors, Avalanche comes in behind Binance Smart Chain (58x) but ahead of Fantom (228x), Polygon (424x), Solana (676x), Near (2,784x), Terra (5442x), and Cosmos (11,953x).\n\nBecause all transaction fees are burned, Avalanche staking rewards consist solely of new token issuance. Given the early state of the network, Avalanche’s staking rewards were highly inflationary during 2021. Most months hovered near double-digit nominal yields. A key feature of AVAX staking is that the vesting supply can still be staked. This resulted in a higher percentage of engaged stake and significantly lower real yields early in the year. Yields between March and May were volatile due to network upgrades and short periods of offline validators. A supply unlock coincided with a decrease in engaged staking rate in June before yield and engaged stake volatility declined. In Q4, engaged stake saw a slight decline which coincided with a small rise in real yield. This could be attributed to smaller stakers exiting to take advantage of Avalanche Rush incentives within DeFi.\n\nEcosystem & Development Overview\n\nAs highlighted in the section above, network usage soared over the final four months of 2021. This can be primarily attributed to the growth of familiar DeFi services on the network (decentralized trading via Pangolin and Trader Joe, borrowing and lending via Benqi) along with the expansion of leading Ethereum protocols (Aave and Curve) into the Avalanche ecosystem. Although the rate of AVAX market cap growth slowed during Q4 to a 56% relative rate, its TVL exploded 714%. While correlation doesn’t imply causation, it appears that users wanted exposure to the Avalanche Rush incentive program that was boosted by the arrival of Aave and Curve in October.\n\nQ4 was an expansionary quarter for the crypto market as a whole with aggregate TVL increasing 40% to $240 billion. Avalanche’s TVL grew at the fastest rate among its competitors within the Layer-1 and Layer-2 network categories (+2.75% TVL dominance). The Terra ecosystem (+2.48% TVL dominance) was a close second. It appears that a significant portion of Avalanche growth came not only at the expense of Ethereum (-4.31% TVL dominance) but also Binance Smart Chain (BSC) (-2.94% TVL change). It makes sense to see Avalanche grow against Ethereum considering the native Avalanche bridge only supports a path between these two networks and has been one of the most widely used solutions?startdayuniquedepositors=2021-09-30%2000%3A00%3A00&startdaytvl=2021-09-30%2000%3A00%3A00) to emigrate away from Ethereum in Q4. The growth against BSC is less clear, but we can speculate that it may be related to BSC’s EVM compatibility and similar low-fee environment.\n\nZooming into the relative TVL share of applications on Avalanche during Q4, we clearly see the effect of Aave and Curve’s arrival on the rest of the Avalanche DeFi ecosystem. Pangolin was already unseated as the market-leading DEX when Trader Joe went live and took over in Q3, but Benqi still sat atop the DeFi throne heading into Q4 with a monopoly in the borrowing and lending markets. Benqi’s moat dried up nearly instantly and Aave, Ethereum’s leading borrowing and lending market, steamrolled the competition thanks in part to its liquidity mining partnership through Avalanche Rush. Aave would finish Q4 as the ecosystem leader with over $3 billion TVL.\n\nThe other notable TVL trend across Q4 was the growth of the long tail DeFi protocols on Avalanche. Entering Q4, only 29 protocols had amassed $1 million TVL, but 60 protocols would reach that mark by the end of Q4. This emergence of new players is also supported in the developer metrics for Q4.\n\nQ4 developer activity in the Avalanche ecosystem aligns closely with the network’s overall TVL growth. The number of unique contracts and the number of unique deployers of these contracts grew an order of magnitude during the final quarter of 2021. We can see that a significant spike in contracts deployed in September preceded the growth of Avalanche’s long-tail DeFi TVL growth. It wouldn’t be surprising to see December’s surge in contract deployments contribute to continued adoption of the network’s long-tail protocols in Q1 2022.\n\nThe growth rate of events in the Ava Lab’s Github repository declined slightly throughout 2021. While the rate declined, the number of events still indicates a consistent buildout of the network’s infrastructure from its core team.\n\nStaking and Decentralization Overview\n\nThe security of PoS networks requires users to lock up the network’s native tokens and participate in validation duties. A distributed network of validators and active participants can help ensure the network functions as intended.\n\nAs discussed above, engaged stake trended down throughout the year before finding an equilibrium around 60% at the end of 2021.\n\nStaking activity during Q4 was rather uneventful. Such predictability and lack of volatility is generally good for network health. Validator stake was consistently about 5.5 times greater than the amount of delegated stake for the quarter. A few days witnessed higher than normal amounts of unresponsive validator stake but the total amount of offline stake never came close to levels that could compromise the network.\n\nThere was a similar lack of events in the staking data by entity. The number of delegators consistently outnumbered the number of validators, a pattern consistent with other PoS networks that support native delegation. The number of offline validators increased slightly during December but returned to its three-month average by the end of the month. Finally, the number of delegators decreased sharply in early December but recovered to close the quarter.\n\nThe Nakamoto coefficient is a metric first introduced by Balaji Srinivasan to quantify the decentralization of blockchain networks. The number itself represents the minimum number of actors who can collude to disrupt the network. For Avalanche, the Nakamoto coefficient is equal to the number of validators that control ⅓ of the network’s stake. Avalanche’s Nakamoto coefficient hovered in the low 30s to begin 2021 but fell to 25 in June. Since this decline, the coefficient has remained relatively stable in the upper 20s, putting Avalanche above the industry average for other Layer-1 networks.\n\nKey Events and Catalysts for Ecosystem Growth\n\nQ4 of 2021 proved to be pivotal for the Avalanche ecosystem. Indeed, a flurry of activity contributed to Avalanche's ecosystem growth, as evidenced by the data presented in the previous sections of this report. But what were the key events and drivers of growth? Outside of the many Initial DEX Offerings (IDOs), DeFi, and NFT launches, the theme of Q4 was primarily centered around major exchange listings, high-profile partnerships, and the continued deployment of the Avalanche Rush liquidity mining program.\n\nOctober 2021\n\nAvalanche's Q4 began with arguably one of the most sought-after landmarks for any crypto project – the ever-desired Coinbase and Coinbase Pro exchange listings. The listings were announced on September 29th, and by the first day of Q4, AVAX volume was off and running on Coinbase. The Avalanche Rush liquidity mining program expanded its reach in that same week when it added Trader Joe (JOE), the largest native DEX on Avalanche. Announced on September 30th, $20 million of rewards in AVAX and JOE were set to be paid out over the following three months. Furthermore, BenQI (QI), an algorithmic liquidity market protocol, announced on October 4th, phase two of its liquidity mining program, with $4 million in AVAX to be paid out over the following 45 days. Likewise, on October 4th, Aave (AAVE) went live on Avalanche with $20 million in AVAX liquidity mining incentives to be paid out over an unknown period. As highlighted above, these three DeFi protocols ended the quarter as the largest protocols in terms of TVL.  \n  \nFollowing an action-packed first week of Q4, Curve (CRV) was deployed to Avalanche bringing its famous like-asset trading to the network. Curve, a participant in the Avalanche Rush incentive program, became the fourth largest DeFi protocol on Avalanche by the end of the year, growing from $175 million in TVL to over $1 billion.\n\nBy week three, the attention shifted from exchange listings and the Avalanche Rush program to the NFT marketplace and high-profile partnerships. One of the oldest collectible companies in the US, Topps, launched the 2021 MLB Series 2 Baseball NFT collection. The launch featured a brand-new baseball card-inspired release in conjunction with Major League Baseball and MLB Players, Inc. Further, renowned visual artist Jason M. Peterson launched a 1-of-1 NFT for the collective ownership of his newly created mural of Kanye West in Chicago.\n\nOctober concluded with another high-profile partnership, additional project launches, and Avalanche Rush participants. On October 20th, a partnership with Andretti Formula E Autosports was announced. The multi-year agreement marked the first title sponsorship from a blockchain company with a Formula E team with a natural alignment between organizations committed to sustainability. On October 21st, Alpha Finance Lab deployed Alpha Homora V2 on Avalanche while Penguin Finance (PeFi) joined Avalanche Rush with $2.5 million in incentives.\n\nNovember 2021\n\nNovember was a continuation of October’s blitz of new project launches and partnerships. On November 1st the Avalanche Foundation launched Blizzard, a $200 million fund dedicated to accelerating development, growth, and innovation across the Avalanche ecosystem. The fund came into existence through financial contributions from the Avalanche Foundation, Ava Labs, Polychain Capital, Three Arrows Capital, Dragonfly Capital, and several others. In addition to Blizzard, one of Avalanche's early and much-anticipated use cases, Initial Litigation Offerings (ILOs), became a reality with the launch of the Apothio Initial Litigation Offering, the first tokenized litigation funding for one of the largest US crop destructions in US history.\n\nBy the middle of November, the Avalanche ecosystem welcomed the native launch of Tether (USDT), the largest stablecoin by market capitalization, and announced another high-profile partnership with Big Four accounting firm Deloitte. The strategic alliance with Deloitte was formed to enable a new disaster recovery platform that uses Avalanche to help state and local governments easily demonstrate their eligibility for federal emergency funding.\n\nNovember was capped off with another exchange listing and partnership. On November 17th, Binance.US announced the listing of AVAX and opened trading on AVAX/USD and AVAX/USDT pairs. Two days later, Orange Comet, an NFT and blockchain experience company built on Avalanche, announced its multi-year partnership with the New York Islanders hockey team and UBS Arena to produce and sell NFTs on the Orange Comet Marketplace.\n\nDecember 2021\n\nDown the final stretch of Q4, the Avalanche ecosystem continued full steam ahead with more project launches, incentives, exchange listings, and partnerships. On December 2nd, DeFi Kingdoms, a popular play-to-earn game built on Harmony, announced their first cross-chain expansion to Avalanche with the launch of a new realm, DeFi Kingdoms: Crystalvale. Near the same time as DeFi Kingdom's expansion, one of 2021's fastest-growing DAOs, Olympus DAO, expanded to Avalanche. Early December also marked when Alpha Finance Lab joined Avalanche Rush with a $6 million allocation, bringing incentives to its ecosystem of cross-chain DeFi products that launched on Avalanche in October. By the end of the first week of December, one of renowned street artist Banksy's most iconic pieces, Love is in the Air, became a fractionalized NFT on Avalanche. The NFT was made possible by Particle, which partnered with Avalanche to bring fine art on-chain in November.\n\nBefore Q4 and the broader year came to an end, AVAX was listed on FTX and Kraken, two of the top five exchanges by trading volume. To celebrate FTX integrating AVAX C-Chain, FTX teamed up with the Avalanche team to give away up to $800,000 worth of AVAX. On the same day the FTX listing was announced, Ava Labs was selected for the Mastercard Start Path Program. The program will enable Ava Labs to connect with Mastercard's ecosystem of partners to support innovation. Together, their mission will be exploring and solving how blockchain technology can democratize use cases for all users. Finally, the second-largest stablecoin by market capitalization, USDC, launched on Avalanche to close out December.\n\nEcosystem Challenges\n\nQ4 represented a major period of growth for Avalanche, but it didn't come without growing pains. As the Avalanche C-chain recorded new highs for daily transactions and witnessed the number of unique developers in its ecosystem double, the network temporarily experienced higher than usual transaction fees. The Avalanche community quickly responded, a unique mechanism around gas caps limiting block space and Metamask struggling to estimate fees due to the mechanism.\n\nThe anticipated solutions to scaling include governance, pruning, and subnet development, which will involve removing the gas limit mechanism, among other optimizations. The higher fees may have been a signal that the network wasn’t quite ready for the growth it experienced over Q4; however, the proposed solutions are top of mind as the Avalanche team and community look ahead into 2022.\n\nThe Road Ahead\n\nCurrently, Avalanche does not maintain an updated public-facing roadmap, so the protocol developments are not prescribed. However, it is expected that Avalanche Rush will continue to accumulate participants as the $180 million liquidity mining program has not been exhausted.\n\nIt is also anticipated that core platform upgrades will continue. Significant upgrades, known as <a href=\"https://messari.io/intel/event/3e8c075d-37b7-4455-8d90-cbe1f800d217\">Apricot</a>, are being implemented in phases, in which phase five of six was implemented successfully during Q4. As part of phase five, several patches were implemented aimed at PC chain atomic transfers and C-chain fee algorithm optimizations. All phases of Apricot broadly represent one of the solutions (pruning) to the high transaction fees experienced during Q4.\n\nAnother area of focus is expected to be the development of subnets. Avalanche will continue to pursue developing flexible and customizable subnets with the aim of enabling individuals and institutions to create custom blockchains tailored to their needs and go to market more efficiently. A major milestone was reached in December with the launch of Subnet-Ethereum Virtual Machine (EVM), which is a custom VM that enables users to create their own EVM-compatible blockchain. Ultimately, further development in this area is expected and, if successful, could serve as another catalyst for further ecosystem growth.\n\nAvalanche on-chain governance is also still in development. AVAX will at some point be used to provide on-chain governance for critical network parameters where participants can vote on changes to the network and settle network upgrade decisions democratically. Parameters will include factors such as the minimum staking amount, minting rate, and transaction fees.\n\nWhile Avalanche Rush may continue to serve as a catalyst for ecosystem growth and garner more project launches and partnerships, significant technological advancements are on the horizon for the teams developing the Avalanche core platform and are critical to the network's ability to sustain further growth.\n\nClosing Summary\n\nIntuitively, due to congestion on the Ethereum network and the slow rollout of Layer-2 scaling solutions, newer Layer-1 platforms offered better support for marginal users. With the combination of the Ethereum-Avalanche bridge and Avalanche Rush, Avalanche found itself in a position to grow its user base and welcome new participants into its economy. As individuals and institutions piled in, Avalanche recorded all-time quarterly highs of active addresses, transactions, TVL, and market capitalization.\n\nThe arrival of high-profile partnerships and project launches like Aave and Curve triggered network-wide DeFi growth and the number of contracts deployed. Unique contract deployers to the network also reached all-time highs during the quarter.\n\nAlthough Q4 of 2021 proved to be pivotal for the Avalanche ecosystem, it also surfaced intermittent scaling issues as evidenced by temporarily increased transaction fees. This issue is not unfamiliar, and solutions are in motion and at the forefront for the teams developing the core platform. Tracking the growth of the network and its progress towards core platform optimization will be top of mind looking ahead into 2022.\n\nThis report was commissioned by Ava Labs, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.\n\nAppendix\n\nEvents\n\nSeptember 29, 2021 - Coinbase Exchange Listings\nSeptember 30, 2021 - Trader Joe Joins Avalanche Rush\nOctober 4, 2021 - BenQI Joins Avalanche Rush\nOctober 4, 2021 - Aave Launches on Avalanche\nOctober 4, 2021 - Topps Launches MLB Series NFT Collection\nOctober 11, 2021 - Jason M. Peterson Launches NFT of Kanye West Mural\nOctober 20, 2021 - Andretti Formula E Partnership\nOctober 21, 2021 - Alpha Homera Launches on Avalanche\nOctober 22, 2021 - Penguin Finance Joins Avalanche Rush\nNovember 1, 2021 - Avalanche Foundation Launches Blizzard\nNovember 1, 2021 - First Initial Litigation Offering (ILO) on Avalanche\nNovember 10, 2021 - Tether (USDT) Launches on Avalanche\nNovember 16, 2021 - Strategic Alliance with Deloitte\nNovember 17, 2021 - Binance.US Exchange Listing\nNovember 19, 2021 - NY Islanders and UBS Arena NFTs\nNovember 29, 2021 - Olympus DAO Expands to Avalanche\nDecember 1, 2021 - Alpha Finance Lab Joins Avalanche Rush\nDecember 2, 2021 - DeFi Kingdoms Expands to Avalanche\nDecember 3, 2021 - Banksy Fractionalized NFT\nDecember 9, 2021 - FTX Exchange Listing\nDecember 9, 2021 - Mastercard Start Path Program\nDecember 14, 2021 - Circle (USDC) Launches on Avalanche\nDecember 21, 2021 - Kraken Exchange Listing\n\nData Tables\n\n", "references": [{"name": "Chase Devens", "url": ""}, {"name": "James Trautman", "url": ""}], "published_at": "2022-01-27T15:00:00Z", "author": {"name": "Chase Devens & James Trautman"}, "tags": ["Layer-1", "Quarterly-Reports"], "url": "https://messari.io/article/state-of-avalanche-q4-2021"}, {"id": "87cd798b-8336-4b40-905d-36f54d93651d", "title": "The State of Livepeer", "content": "The following report was commissioned by Livepeer, a member of <a href=\"https://messari.io/hub\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nIf you would like to view the raw data and charts that were used in the writing of this article, check out our Livepeer Macro Financial Statements dashboard on Dune Analytics.\n\nICYMI, we held a live Crowdcast event featuring Ryan Selkis, Mason Nystrom, and Doug Petkanics of Livepeer, where they dove deeper into this report and discussed Livepeer's performance and plans for the future. You can view the full recording of the livestream here.\n\nKey Takeaways\n\nIn Q4’21, Livepeer processed a record ~30 million minutes of transcoded videos, a 37% increase from its previous quarter which was also an all-time high.\nToday, the majority of supply-side revenue comes from staking rewards, with orchestrators generating $17 million in rewards in Q4 and nearly $40 million in 2021\nLivepeer orchestrator transcoding fee revenue increased significantly throughout 2021, generating $154,000 in Q4, an increase of 113% compared to the previous quarter.\nLivepeer’s Q4 acquisition of MistServer will enable Livepeer to support video ingestion, content delivery, storage, and serve as the foundation for end-to-end live streaming infrastructure.\n\nIntroduction to Livepeer\n\n<a href=\"https://messari.io/asset/livepeer\">Livepeer</a> is a video transcoding network utilized by video service providers and app developers/streaming applications. Video transcoding – the process of reformatting raw video files into viewable files based on the user’s bandwidth and device – is a core internet service utilized by streaming providers and social networks like Youtube and Twitch.\n\nLivepeer reduces the costs of live-streaming services (transcoding, media servers, content delivery) by potentially 10x compared to existing services for individual streamers. Unlike Amazon Web Services (AWS) or other transcoding providers, Livepeer offers transcoding pricing based on usage versus server space.\n\nLivepeer has a few key stakeholders within its network:\n\nVideo Miners - Orchestrators and Transcoders\n\nNode operators – termed orchestrators in Livepeer – are responsible for receiving video from broadcasters and returning transcoded results. Orchestrators stake LPT in order to perform services on the Livepeer network. Transcoders are responsible for performing work on the Livepeer network, providing computation capacity to transcode the video files to orchestrators.\n\nDelegators\n\nDelegators – individuals who own <a href=\"https://messari.io/asset/livepeer\">LPT</a> tokens and stake their tokens with orchestrators in exchange for a fee and a proportion of minted LPT tokens. Orchestrators with more LPT staked can perform more work on the Livepeer network. Additionally, orchestrators can stake their own capital or choose to accept capital from other delegators (but take a percentage of the fee and staking rewards for their service).\n\nBroadcasters / Applications\n\nApplications – also referred to as the broadcasters – are apps or services that require streaming or the use of live video in their functionality. Broadcasters pay orchestrators for transcoding services.\n\nLivepeer – Macro Overview\n\nLivepeer Network Growth\n\nA core function of the Livepeer network is transcoding video for streaming applications and therefore transcoding network usage is an important metric to track to evaluate the health and growth of the Livepeer protocol.\n\nTo date, the Livepeer network has transcoded over 73 million minutes of video, 41% of which came in Q4’21. Throughout 2021, Livepeer’s network usage achieved all-time highs in each subsequent quarter, experiencing the most significant growth in Q2 with ~170% in network usage growth.\n\nThroughout Q4’21, Livepeer processed a record ~30 million minutes of transcoded videos, a 37% increase from its previous quarter which was also an all-time high.\n\nLivepeer’s increased adoption aligns with the accelerated growth of video apps utilizing the network, such as Korkuma (enables live shopping videos for companies) and PlayDJ (DJ streaming service). Gaming also remains a core vertical with Livepeer.com – the hosted service built on top of the public Livepeer protocol – partnering with Vimm, a streaming platform for gamers and creators powered by the Hive blockchain. While Livepeer powers a variety of use cases, the majority of usage comes from user-generated content applications (i.e. gaming, music, streaming), but includes popular verticals such as sports, media, and events.\n\nVideo NFTs and Computational Service Growth\n\nTo date, most NFTs that incorporate video have experimented with relatively short (1-15 second) time lengths. However, the potential for video NFTs – pre-recorded and live – in the minutes to hours presents new types of content and monetization opportunities for creators.\n\nLivepeer has already started experimenting with video NFTs and is poised to serve a core piece of infrastructure for live video NFTs.\n\nIn Nov 2021, in conjunction with Glass Protocol, Livepeer cohosted COLLIDE, a live concert – digital and real-world – that captured and minted live video NFTs. Glass Protocol creates a marketplace for creators to issue video NFTs that have instant liquidity as they are bought and sold. Notably, the COlLIDE concert is the first concert where live video was minted as an NFT.\n\nVideo NFTs and the continued growth of UGC applications will likely proliferate into the future amidst the backdrop of the creator economy’s adoption of Web3 primitives (e.g. NFTs). In 2022, Livepeer aims to further increase its protocol usage for 4k video and expand into other potential functions including AI-based smart video, AI-enhanced content moderation, object recognition, song title detection, and video fingerprinting.\n\nLivepeer Network: Video Miners\n\nWhile the demand side of the Livepeer network is driven by broadcasters – applications requiring streaming – the supply side of the network is run by node operators (orchestrators).\n\nThe Livepeer network divides the orchestrator role into two specific parts – staking and transcoding. Staking LPT is required in order to provide transcoding services on the Livepeer network.\n\nGiven that not every single video miner wants to also operate an orchestrator, video miners can choose to allocate their computational resources to a specific orchestrator pool (private or public). These pools – public and private – compete to perform transcoding work with private video miner pools being selective of the miners that join.\n\nIt’s worth noting that the mining process for video transcoding differs from that of Bitcoin or PoW mining. With GPUs, the transcoding processing is handled by a specific chip on a video card and therefore doesn’t demand the same energy requirements compared to an ASIC miner (used for Bitcoin / Ethereum mining). As a result, GPUs can allocate transcoding services to Livepeer while simultaneously playing video games or performing other activities.\n\nPublic mining pools – like Livepool – that enable anyone to connect their GPU video cards to transcode video have become widely used. In fact, Livepool currently ranks 8th in terms of orchestrator fee revenue and 11th in total LPT staked.\n\nNetwork Revenue\n\nIn 2021, Livepeer usage experienced a breakout year with revenue for orchestrators and stakers increasing substantially.\n\nNotably, the entirety of the Livepeer network revenue is directed towards supply-side participants (node operators, transcoders, and delegators). Supply-side revenue in Livepeer consists of network-usage revenue (e.g. fees for transcoding services) and staking rewards.\n\nStaking Reward Revenue\n\nToday, the majority of supply-side revenue comes from staking rewards, with orchestrators generating $17 million in rewards in Q4 and nearly $40 million in 2021. Note, revenue is calculated by the price of LPT on the day earned and so orchestrators who hold a percentage of LPT rewards have likely produced far greater returns.\n\nAlthough the net amount of LPT staked – and rewarded – has fallen considerably throughout 2021, the price appreciation of LPT has led to a significant increase in LPT staking rewards in U.S dollar terms.\n\nNetwork Usage Revenue\n\nOrchestrators are permitted to set their fees for transcoding by the price per pixel, meaning transcoding services can be price for different qualities of video (e.g. 4K contains four times as many pixels as 1080p and can be priced accordingly). Network usage (e.g. transcoding services) revenue – which is paid in ETH – makes up a small portion of orchestrators’ revenue.\n\nLivepeer orchestrator transcoding fee revenue increased significantly throughout 2021, generating $154,000 in Q4, an increase of 113% compared to the previous quarter.\n\nThis growth in fee revenue directly corresponds to the growth in usage with the first quarter of the year experiencing the greatest percentage growth in fee revenue. Impressively, each subsequent quarter in 2021 witnessed positive percentage growth in service fee revenue.\n\nLike many Web3 infrastructure protocols, the Livepeer network subsidizes node operators with LPT rewards until fee revenue increases to a sustainable level. This initial subsidization is core to Livepeer’s economic model and enables the protocol to compete with existing transcoding providers like Amazon and Google.\n\nLivepeer Dynamic Rewards\n\nLivepeer utilizes a dynamic mechanism for staking rewards. As long as the network staking participation remains above 50%, inflation reduces by 0.00005% per day until inflation hits zero. If at any point the participation rate (% of LPT staked) drops below 50%, then staking rewards increase. Ideally, as the Livepeer network grows, LPT will become deflationary as network participants try to acquire it in order to provide transcoding and computational services on the network.\n\nIn June 2021, the percentage of LPT staked began to reach an equilibrium, fluctuating around the 50% threshold.\n\nAs a result, Livepeer staking rewards were deflationary throughout 2021 with the exception of the fourth quarter which experienced a 7% increase in staking rewards compared to Q3’21.\n\nSince fee revenue doesn’t generate enough cash flows, it’s likely that orchestrators either raise capital from outside sources to subsidize operations or sell a percentage of their LPT rewards to maintain operations. Notably, there is also a seven-day unbonding period for LPT staking which, while a useful disincentive mechanism, creates capital inefficiency for orchestrators, transcoders, and delegators. However, liquid staking protocols for Web3 infrastructure tokens like Tenderize – set to launch in Q1’22 – will potentially increase liquidity for staked LPT.\n\nLivepeer Ecosystem: Governance & Notable Events\n\nFundraising and Capital Expenditure\n\nLivepeer announced its $20 million <a href=\"https://messari.io/intel/event/cd4059b1-cd51-4a18-a107-7a3daacc4d75\">Series B</a> funding round in July 2021 with the intention to scale its video streaming platform, expand its technical capabilities, and support more blockchain networks. Subsequently, in Jan 2022, Livepeer announced a $20 million Series B Extension round to expand functionality for broadcasters, ramping up demand generation amongst video developers.\n\nMistServer Acquisition\n\nIn Oct 2021, Livepeer Inc. made its first acquisition: MistServer, a media toolkit that helps developers set up streaming servers. This acquisition was fairly strategic considering that Livepeer has been using the MistServer for several years and was the largest user of MistServer (most instances running around the world) prior to its acquisition. More specifically, MistServer performs another key service in the live streaming process – transmuxing.\n\nIt’s easiest to view transmuxing as the inverse of transcoding. So, where transcoding takes data and processes it into a different type of encoding, transmuxing, conversely, takes data and repackages it (without changing the content) so that it can be passed onto a different point.\n\nLivepeer has utilized MistServer to build Livepeer.com, the hosted transcoding service run by the Livepeer team. Additionally, Livepeer.com leverages MistServer to take in streams in formats that can’t be directly input into the public Livepeer network, sets the streams up for transcoding, and forwards that output to Youtube.\n\nGovernance & Protocol Improvements\n\nLIP 73 & LIP 74: Confluence Upgrade\n\nSince Livepeer staking smart contracts are built on Ethereum, Livepeer has suffered from rising gas costs. More specifically, broadcasters have to pay high transaction fees to pay for transcoding services. Similarly, orchestrators and delegators pay high fees to receive their fees and staking rewards. This makes it less economical for smaller video miners (orchestrators or transcoders) and delegators to participate in the network.\n\nTo help resolve these issues, the Livepeer team proposed the <a href=\"https://messari.io/intel/event/13f816f2-89d4-4283-a29c-47e8f8276e9a\">Confluence upgrade</a> which would 1) <a href=\"https://messari.io/intel/event/23638352-249e-4e67-812d-481a18dddaea\">migrate</a> Livepeer staking contracts to Arbitrum, 2) support multi-delegation, and 3) enable participants to obtain existing staking LPT rewards by bridging reward issues on Ethereum to Arbitrum for collection. Since gas fees on Arbitrum are substantially lower, the Confluence upgrade will also increase profit margins for all network participants and enable a larger number of smaller participants to profitably join the network. The Confluence public testnet was deployed on Jan 13, 2022, and will proceed to launch on Arbitrum – assuming the vote is approved – after the auditing process is completed.\n\nTranscoding Verification Improvements\n\nAs part of the Streamflow network upgrade in 2020 – which introduced GPU transcoding to the network – slashing was disabled in favor for real-time statistical verification that could be performed by broadcasters. However, this caused several issues including increased latency for streams – since there was a delay to verify before using the transcoded video – and increased the computation burden for broadcasters to verify the transcodings. This year, the Livepeer team <a href=\"https://messari.io/intel/event/9752bc9f-d145-4219-850c-12c0d118f0f3\">proposed</a> and subsequently enabled <a href=\"https://messari.io/intel/event/1e451f53-27b4-40d0-959a-a4a28482247e\">fast and full verifications</a> which allowed broadcasters to receive and verify video segments in near real-time. The Livepeer team achieved this by enabling broadcasters to insert video into their streams faster while creating an offline dispute resolution process that imposed significant economic penalties – slashing or freezing the ability to participate in the network – on malicious actors. Further, the proposal aimed to publicly relay to broadcasters when a video miner acted maliciously, thereby hurting that miner’s public reputation.\n\nClosing Summary\n\nWith only a select number of companies capable of delivering live video transcoding at scale (i.e. Google, Amazon, Microsoft), Livepeer offers a unique solution – based on cryptoeconomic primitives – to compete with these existing giants. In 2021, Livepeer’s network started to demonstrate strong signs of growth across network usage and supply-side revenue. As the Livepeer network matures and shifts to Layer-2 scaling solutions, the promise of allocating GPU bandwidth for video transcoding becomes enticing for newer individual miners and larger, non-crypto native players.\n\nLivepeer’s Q4 acquisition of MistServer was arguably its most important advancement in 2021, since the integration will ensure that Livepeer can support video ingestion, content delivery, storage, and serve as the foundation for end-to-end live streaming infrastructure. Combined with the network’s upcoming migration to the Arbitrum network – which will reduce costs for existing video miners and enable more video miners to join the network – Livepeer is poised for an eventful 2022.\n\nThis report was commissioned by Livepeer, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Mason Nystrom", "url": ""}], "published_at": "2022-01-26T14:30:00Z", "author": {"name": "Mason Nystrom"}, "tags": ["Web-3"], "url": "https://messari.io/article/the-state-of-livepeer"}, {"id": "d0640696-25d1-4f04-abdc-bb187fa7e500", "title": "An Ocean of Liquidity: OpenOcean and the Quest to Become the CeDeFi Aggregator", "content": "The following report was commissioned by OpenOcean, a member of <a href=\"https://messari.io/hub?utmsource=messari&utmmedium=website&utmcampaign=openoceanhublanding\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nA common problem that crypto traders face is fragmented liquidity and asymmetric market information, leading to trading inefficiencies. Aggregators aim to solve this by providing access to multiple sources of liquidity in a single place. Through algorithms, aggregators route orders across various exchanges to find the best price while taking into consideration slippage, fees, and gas costs. It’s not just the aggregation of liquidity for trading, but other financial services too, such as derivatives.\n\nBesides trading, liquidity aggregators can be helpful for other financial services too. When you want to enter the futures market or lend your crypto assets for example, an aggregator can find the best position or rate across different platforms.Virtually all aggregators currently focus on decentralized markets. But imagine a single platform where users can access financial services from both DeFi and CeFi markets. That is the vision that OpenOcean is building.\n\nWhat is OpenOcean?\n\nOpenOcean aims to serve as a liquidity aggregator across both centralized and decentralized markets, as well as across blockchains. Currently, OpenOcean aggregates asset exchanges, but plans to expand to other services too, such as derivatives and asset management services. Its ultimate goal is to become the one-stop shop for access to the full spectrum of crypto liquidity.\n\nOpenOcean was launched in September 2020. The protocol is currently deployed on 13 public networks, including Ethereum, Binance Smart Chain (BSC), xDai (also known as Gnosis Chain), Avalanche, Polygon, Solana and Ethereum Layer 2 solutions (Arbitrum and Loopring). OpenOcean is connected to one centralized exchange: Binance.\n\nIn March 2021, OpenOcean concluded a $2m strategic fundraise which was led by Binance, and included Multicoin Capital, LD Capital, CMS, Kenetic and Altonomy. The fundraise was completed with a private placement and advisory fundraise which included AU21, FBG, DAO Maker and TRON Foundation. Huobi Ventures Blockchain Fund also made a strategic investment in OpenOcean in July 2021.\n\nHow Does OpenOcean Work?\n\nOptimizing for the best swap rate is the essence of aggregators. At the heart of OpenOcean is a routing algorithm that optimizes for multiple parameters, including a better price, lower gas consumption and lower slippage. OpenOcean’s aggregation protocol gets price quotes from all exchanges and then finds the trading route with the best price and low slippage.\n\nTo find the initial trading route, OpenOcean utilizes the D-star algorithm, which is an optimized version of the Dijkstra algorithm. It then optimizes the route using machine learning. In October 2021 OpenOcean V2 - aka OpenOcean Atlantic - was released. The new version provides an improved algorithm and other protocol upgrades.\n\nThe aggregator protocol is free to use and traders only pay the regular blockchain gas and exchange fees for trades. OpenOcean plans to charge fees (unless a user holds the OOE token) for other services when they become available. Examples include investment strategies run through OpenOcean’s custom-made UI, premium memberships and other future products.\n\nOpenOcean’s UI\n\nOpenOcean has two interfaces: “Go Swap” and “Go Advanced”. The “Go Swap” page is the basic version for swapping assets on decentralized exchanges only. To start trading, the user first needs to select the “Connect Wallet” button on the page. The platform offers several wallet integrations for the different chains, including MetaMask. Once connected, the trader can select a trading pair and amount. The price across the different exchanges are then shown and the user can execute the trade to get the optimal price.\n\nOverall, the user interface is clean and simple, and includes similar features relative to other aggregators. While users can see how much they save on a trade compared to directly using exchanges, it would be helpful to see a comparison with other aggregators.\n\nThe interface includes a helpful visualization of the routing for each asset swap. For larger orders, the routing can become quite complex. The example below illustrates the advantage of using an aggregator vs. manually executing all individual trades.\n\nTo access centralized exchanges such as Binance, the “Go Advanced” version of OpenOcean is needed. In this version, the DEXes and CEXes are displayed next to each other. The spread between prices on CEXes and DEXes is also shown. In order to access centralized exchanges, a registration with OpenOcean is required. Besides market orders, the centralized exchanges also offer limit orders. This feature is not available yet for trades on decentralized exchanges.\n\nLooking into the Future\n\nAs mentioned earlier, OpenOcean currently provides only an asset exchange service, but the roadmap highlights there is more in the pipeline. OpenOcean will continue with algorithm upgrades and expand to more networks. Limit orders are also planned to be introduced soon, and OpenOcean will start offering aggregate derivative products. Furthermore, a SaaS product will be launched that allows for automated arbitrage between centralized and decentralized exchanges.\n\nLooking into 2022, OpenOcean plans to release futures aggregate trading and margin products. Cross-chain aggregation will become available, which allows for cross-chain swaps. Over time, OpenOcean will also integrate other financial products such as lending, insurance and other investment services. In 2023, it aims to launch an intelligent asset management platform for financial solutions, or in other words OpenOcean would be a one-stop shop for centralized and decentralized financial solutions.\n\nThe OOE Token\n\nThe OOE (OpenOcean Ecosystem) token will become an essential part of OpenOcean. The token serves two purposes: utility and governance. The token’s utility is expressed through several incentives that token holders get when participating in the OpenOcean ecosystem. This includes a means to pay for gas and trading fees, earn liquidity mining and trade rewards and get access to VIP membership and other services. For example, if users want to swap assets across separate chains, the OOE token would function as a means to pay gas fees.\n\nThe governance function implies that OOE token holders can put forward proposals and participate in voting. The voting power is proportional to the token holdings. OpenOcean has off-chain governance where proposals can be submitted and discussed in a designated channel on OpenOcean’s Discord. So far no votes have been held and details on how the governance structure will look like are still worked on.\n\nThe OOE token is a token minted on Ethereum with a maximum supply of one billion tokens. 78,989,286 tokens were distributed on 12 July 2021 and about 150 million are currently in circulation. The remaining supply will be distributed over the coming five years according to the following split:\n\n5.6% is distributed over 2 years to strategic investors\n7.5% over 2.5 to 3 years for private placement and a second strategic round\n29% over 3 years for OpenOcean Lab to support protocol development, onboard ecosystem partners, community developers and bounty programs\n33% over 5 years for liquidity mining\n7% over 3 years to the ecosystem foundation that manages community incentives, marketing and campaigns\n15.9% over 3 years for the team and advisors\n2% to early users, which were distributed upon token issuance\n\nThe OOE token is listed on a few exchanges, including KuCoin and Gate.io. OOE has a circulating market cap of around $40m, which compares to a market cap of around $780m for 1inch, which is the current market leader of DEX aggregators.\n\nTraction of OpenOcean\n\nSince its launch, OpenOcean has seen about $3b in trading volume, just under 400k addresses and more than 1.4m transactions. The majority of OpenOcean’s volume comes from asset swaps on BSC (about $2.8b), as do the number of addresses and the number of trades. In recent months, Polygon and Avalanche have also started to attract larger volumes and number of transactions. In the case of Avalanche, November saw $70m in volume and over 8500 swaps, compared to $13m in volume and 2900 trades in October. OpenOcean also added support for Fantom in October and saw $50m in volume on that network during that month, and has continued steady growth with $107m in volume for November. With regards to centralized exchanges, OpenOcean has just over 11.5k registered users and has seen a total trading volume of $2.5m.\n\nOpenOcean Competitor Analysis\n\nThere are already several aggregators, of which 1inch, Matcha and ParaSwap are amongst the most well-known. These aggregators are active on multiple chains, though not as many as OpenOcean.\n\nA key differentiator for OpenOcean is that it offers access to both a centralized exchange and numerous decentralized exchanges. Moreover, OpenOcean seems generous when it comes to slippage. OpenOcean users receive 100% in case of positive slippage, and the protocol plans to subsidize trading related costs with OOE tokens.\n\nAmong the aggregators, 1inch is the clear market leader in volume, seeing almost $15b on Ethereum alone in October. While 1inch dominates the market with quite some distance, competitors such as Matcha and Paraswap are slowly catching up. In October, these two aggregators saw about $3.5b and $2b in volume, respectively. Other statistics such as the number of users and trades also underline that 1inch is the market leader by a wide margin.\n\nMeanwhile, OpenOcean has very little traction on Ethereum. As a comparison, OpenOcean routed just over $1m in trades on Ethereum in October. March and May were the most active months for OpenOcean, seeing well above $10m in monthly volume. OpenOcean also has room for improvement when looking at the number of wallets and trades compared to 1inch, Matcha and ParaSwap.\n\nIt is fair to say that OpenOcean’s volume mainly comes from other chains, such as Binance Smart Chain and Polygon. However, 1inch is also the dominant DEX aggregator on these blockchains. 1inch has seen a total volume of over $12b and has more than 115k monthly users on Binance Smart Chain. This compares to about $2.8b in the case of OpenOcean. In the case of Polygon 1inch has seen over $7.4b in volume compared to $50m for OpenOcean.\n\nOne route to potentially improve usage is to show users how well OpenOcean’s routing algorithm works. For example, whenever OpenOcean quotes a price for a trade, it could show the comparison with other DEXes and DEX aggregators. Showing users that OpenOcean does indeed offer the best price should help improve traction.\n\nA Race to the Bottom\n\nCompetition between exchanges and aggregators is very high. Users aren’t necessarily loyal and mainly care about getting the best price. Aggregators thus compete through developing the superior routing algorithm. As part of releasing its V2 in October 2021, OpenOcean conducted performance tests. Of the 4500 swaps done on Binance Smart Chain, OpenOcean offered a better price than 1inch and ParaSwap in 60% of the cases. For trades on Ethereum, OpenOcean delivered better returns”in more cases compared to other DEX aggregators”. However, the earth doesn’t stand still and aggregators will continue to upgrade their algorithms to beat the competition. It ultimately becomes a race to the bottom.\n\nAnother question is to what extent the OOE token is able to capture the value that OpenOcean creates. Aggregators play a crucial role in bridging fragmented liquidity, but with a race to the bottom, it is not clear how aggregators will make money in the long-run. As such, OpenOcean’s intention to provide additional (premium) financial services in the future makes sense.\n\nWhile OpenOcean is still trailing the market leaders by some margin, it is tapping into a big opportunity by giving the user single access to both DeFi and CeFi markets. OpenOcean is still a young project in a very competitive space and it has an ambitious roadmap. Time will tell if it can fulfill its vision of becoming a one-stop shop for aggregate liquidity.\n\nThis report was commissioned by OpenOcean, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information.", "references": [{"name": "Steven Biekens", "url": ""}], "published_at": "2022-01-24T14:30:00Z", "author": {"name": "Steven Biekens"}, "tags": ["Centralized-Exchanges", "Decentralized-Finance", "Decentralized-Exchanges"], "url": "https://messari.io/article/an-ocean-of-liquidity-openocean-and-the-quest-to-become-the-cedefi-aggregator"}, {"id": "fffc1fc8-0d58-44cc-a5ce-6f5bd4d63b9a", "title": "Weekly Recap Ending January 20", "content": "Weekly Recap Ending January 20\n\nNotable Messari Intel Updates\n\nSecret Network announced the launch of a $225M <a href=\"https://messari.io/intel/event/e0104542-d50d-4211-bd37-dadff8b99016\">ecosystem fund</a> targeting development at the application layer and a $175M accelerator pool designed to provide capital, grants, and ecosystem incentives to users and developers.\nAfter a successful hardfork, <a href=\"https://messari.io/intel/event/28c6c524-1bb9-4b1a-b0ba-a2902d050a1c\">EIP-1559 has gone live</a> on Polygon Mainnet.\nThe <a href=\"https://messari.io/intel/event/af802fa5-a87a-499d-9437-8211d1518716\">Harmony blockchain halted</a> as shard 0 could not produce blocks. An internal leader node became overwhelmed by spam traffic following a network upgrade, and the chain forked, resulting in consensus not being able to be met. After validators upgraded to a new binary, block production resumed and performance has since stabilized.\nThe Threshold Council <a href=\"https://messari.io/intel/event/968ecaca-a7c8-4a59-8977-d73866efc510\">deposited</a> ~$20M into the Curve T+ETH pool and staked the LP tokens into Convex. A share of the resulting CRV/CVX rewards will accrue to the DAO, with the stated goal being to diversify the treasury and allow Threshold to build governance power in strategically relevant protocols as a way to facilitate the success of future tBTCv2 pools.\n\nNotable Messari Governor Updates\n\nIdle DAO submitted a <a href=\"https://messari.io/governor/proposal/8ff91a87-c515-45fe-b2b2-d1ffcf708001\">proposal</a> that aims to introduce new governance features to Idle Finance via the introduction of a gauge voting model and farming boost modules. Discussions are currently open.\nThe Sushi DAO has submitted a proposal that combines elements of both initial proposals from Arca's Sushi DAO Restructure and Frog Nation to provide a final version of a proposed restructure of the Sushi DAO. <a href=\"https://messari.io/governor/proposal/d13ee12a-fc8b-46df-a7cb-753dca3cb1dd\">Voting is currently active</a>.\nBitDAO has submitted a proposal that aims to allocate $200M to fund an Ethereum Scalability and Adoption DAO entitled zkDAO. <a href=\"https://messari.io/governor/proposal/5e289566-e770-4ebd-9048-d51a489ada7e\">Voting is currently active</a>.\nThe Illuvium DAO <a href=\"https://messari.io/governor/proposal/d56defb5-313d-4834-8a82-2ba52c660d14\">failed</a> to pass a proposal that aimed to reimburse users who lost funds in relation to the emergency DAO's (eDAO) response to a Jan. 3, 2022, attack in which the eDAO minted a large amount of sILV to drive the price of the asset to zero in the Uniswap pool.\nThe Balancer DAO <a href=\"https://messari.io/governor/proposal/936d89a8-3c9b-4a8b-8e3c-c55b320be85d\">approved</a> a proposal that seeks to include subDAOs within the Balancer DAO structure.\n\nSector Returns: Down Only\n\nThis week saw continued losses across all sectors ranging from -3.60% to -9.32%. The Currencies sector suffered the least, finishing -3.60% from the previous week. Interestingly, the highest and lowest market cap sectors had the most losses this week. Top assets ended the week with -9.32% returns and gaming with -16.10%.\n\nTop Assets\n\nAll but one asset finished the week with negative returns this week. Dogecoin (DOGE) barely finished above water at 0.4% and possibly due to the fact that it rallied after Elon Musk tweeted that DOGE can now be used to buy Tesla merchandise. However, towards the end of the week, the momentum faded away and finished the week where it started. Avalanche suffered the heaviest losses this week, finishing with -12.5%.\n\nDeFi Assets\n\nAll DeFi tokens finished the week in the red. The sector also had the widest range of returns (from -2.5% all the way to -29.0%). DeFi TVL is at a critical support line at $220B. TVL has remained above this line since October of last year and if it breaks below, the market could experience further drawdowns to the next closest support at $199B. Yearn Finance (YFI) replaced Thorchain (RUNE) on the top ten DeFi assets and finished the week in second place with a return of -4.1%. Coming in last was Loopring, taking a heavy loss of -29.0% on the week.\n\nSmart Contract Platforms\n\nYet another sector with all assets finishing the week in the red. Losses within this sector ranged within -0.7% and -14.6%. Cardano (ADA) and Terra (LUNA) were tied for first place as they barely took losses at -0.7%. This week, anticipated Cardano DEX SundaeSwap launched creating <a href=\"https://messari.io/intel/event/56fa4699-db4c-44b3-9adc-a44e96e99508\">network congestion</a> while LUNA established the <a href=\"https://messari.io/intel/event/e6f7ecd4-5314-4011-adf1-67f56fbd00a8\">Luna Foundation Guard</a>, a non-profit tasked with building reserves to better safeguard the UST peg during adverse market conditions. The rest of the assets did not have a similar fate experiencing more significant declines with Algorand finishing last of the smart contract platforms with a drawdown of -14.6%.\n\nCurrencies\n\nMonero (XMR) and Dogecoin (DOGE) were poised to have a double digit return week but lost their momentum and halfway through the week found themselves dancing within the double and single digit returns. They were not able to return to double digit areas but were the only two assets of the group that finished the week with positive returns. Monero (XMR) performed best on the week with a return of 1.5% while Dogecoin (DOGE) followed with a 0.4% return. Stellar was the laggard of the group, finishing the week with a -13.5% loss.\n\nWeb3\n\nWeb3 tokens traded with very high correlation compared to the other sectors all the way through the middle of the week. Afterwards, three tokens broke off the pack while the rest traded downwards in unison. One of the assets that broke off from the pack was Stacks (STX). The Bitcoin-linked blockchain was recently listed on Coinbase which prompted a 29.9% jump but quickly lost ground and ended the week in third place with a loss of -5.4%. Arweave (AR) traded below the pack for most of the week and ended in last place with a -20.1% decline.\n\nGaming\n\nAs a sector, gaming was the clear loser of the week. All of the assets suffered a sharp decline right after the weekend, which led to seven of the ten top gaming assets by market cap to finish the week with double digit losses. Contrary to last week, gaming traded with high unison throughout his week, having no clear outliers within the group. Axie Infinity (AXS) experienced the least decline ending the week with -6.6%. The rest of the assets ended the week in the -9.3% to -19.0% performance range with PLA (PLA) taking the last spot.\n\n", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-01-21T13:37:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-january-20"}, {"id": "8f765503-b378-43e2-bd74-632459d188d5", "title": "State of Uniswap Q4 2021", "content": "The following report was commissioned by Uniswap Labs, a member of <a href=\"https://messari.io/hub?utmsource=messari&utmmedium=website&utmcampaign=unihublanding\">Messari Hub</a>. For additional information, please see the disclaimers following the article.\n\nIf you would like to view the raw data and charts that were used in the writing of this article, check out our Uniswap Macro Financial Statements dashboard on Dune Analytics.\n\nKey Takeaways\n\nUniswap hit an all-time high transaction volume in Q4 2021 behind $238.4bn worth of trades, more than 61% above the previous quarter.\nThe launch of V3 on Arbitrum and Polygon helped kickstart new liquidity pairs, resulting in the total number of markets increasing by 17%.\nThe governance decision to enable a 0.01% fee tier helped drive stablecoin trading activity. Transaction volume between USDC/USDT increased more than 100% in Q4.\nA frothy trading market in Q4 benefitted Uniswap’s liquidity providers, who earned 54% more in fees than in Q3.\n\nIntroduction to Uniswap\n\nUniswap facilitates the trading of tokens on the Ethereum network along with scaling solutions such as Optimism, Arbitrum, and Polygon. The protocol is recognized as a pioneer among decentralized exchanges (DEXs), particularly for its popularization of the X*Y=K model of pooled liquidity. This model represents the initial driver of Uniswap’s automated market making (AMM) operation and has since been implemented across many other DEXs in the industry.\n\nTo quickly recap, AMMs pair tokens into pools balanced by the aforementioned algorithm. Liquidity providers (LPs) can contribute funds into those liquidity pools where traders can make trades by swapping tokens in and out – in effect, making trades with the pool. In exchange for providing liquidity, LPs earn trading fees paid by traders transacting with each liquidity pool.\n\nImportant updates to the protocol in the past year include the launch of V3 – notable for its revamp of the market-making module, which provides LPs with the ability to concentrate liquidity in specific price ranges, and new support for Ethereum scaling solutions, including Optimism in July, Arbitrum in September, and Polygon in December. Both changes and their respective effects will be covered further below. (Note: Optimism underwent its Regenesis upgrade in November and removed all prior transaction history. For the contents of the report, all Optimism activity tracked in the data occurs post-upgrade.)\n\nThis report will review Uniswap’s key metrics for Q4 2021. As it also marks the end of a volatile trading year, metrics will be benchmarked against previous quarters and the rest of 2021. A full appendix of quarterly data is available at the end of the report.\n\nMacro Overview\n\nUniswap’s trading volume increased from $57.8bn in 2020 (when Uniswap first began facilitating trades in May 2020) to $681.1bn in 2021. A total of $91.8bn worth of trades occurred in Q1 while the protocol ended Q4 with $238.4bn of trading volume, marking a 160% increase. Growth did not occur steadily, however, as trading volume from Q2 to Q3 declined 13% before jumping 61% to finish the year.\n\nUnsurprisingly, periods of high volatility in May and December led to the largest daily transaction volume. December 4, 2021 was the second highest day of the year with $5.8bn volume occurring across all Uniswap markets.\n\nV3 transaction volume rose quickly and overtook V2 volume within the first month of going live. In Q2, the quarter in which it launched, V3 generated $58.9bn worth of trades. Comparatively, Q4 had $180bn worth of trades, or a 205% increase.\n\nWhile liquidity between V2 and V3 isn’t a direct comparison due to higher capital efficiencies in the latter, it’s still worth studying total reserve numbers behind both markets. Over the last half year, V3 slowly built up its liquidity, eventually hitting the point where total liquidity in V3 overtook V2. A chronological review shows a month after its launch, the total USD equivalent of all token reserves in V3 was 50% of V2. By the end of Q3, that number reached 66%. With the introduction of V3 on Arbitrum, Optimism, and Polygon, the V3-to-V2 ratio now exceeds 100%. Over time, one would expect this ratio to continue to grow as the Layer-2 ecosystem expands further and V2 pools are replaced with concentrated V3 versions.\n\nDaily fees earned by LPs in V3 markets overtook V2 markets on May 24, 2021 — and though a few days in the rest of the year did see V2 markets earning higher single day fees than V3 markets, the general trend was more revenue earned by the latter. In fact, liquidity providers in the Q4 time period generated 183% more cumulative revenue from V3 than V2, attributable to the higher transaction volume negating the result of lower fees-per-trade from lower fee tiers.\n\nUniswap began the year with 27,545 total markets on V2, a significant jump from July 2020 when it only had 1,681. While 2021 did not see quite the same leap in percentage gains, total markets rose by a larger amount on a nominal basis. On December 31, 2021, Uniswap ended the year with 67,231 trading markets, up 17% from the previous quarter and 144% on the year. Naturally, Uniswap benefited heavily from crypto’s breakthrough to retail investors. The influx of interest led to a significantly larger number of new projects. Corresponding project tokens required marketplaces for trading, which became an attractive opportunity for Uniswap and other DEXs.\n\nMicro Overview\n\nDifferences in Q4 trading activity across Uniswap’s various platforms can best be summarized as an increase in memecoin interest within V2 markets and more traditional blue-chip token trading driving volume in V3 markets.\n\nTop V2 Markets\n\nThree of the top four markets by trading volume are analyzed further below. The selected exclusion from the four is the USDT/WETH market which closely mirrors the activity in the USDC/WETH market.\n\nThe number of accounts providing liquidity to Uniswap pools followed broader user activity for most of 2021, particularly in the second half. One notable exception occurred around mid-May when the number of new liquidity provider accounts plummeted to nearly the lowest point of the year. The second half of the year for this metric was, on average, lower than the first half as the shift to V3 broke the LP regards model and LPs took their capital to other Layer-1 protocols and/or competing DEXs.\n\nUSDC / WETH\n\nAs mentioned prior, the USDC/WETH market was the most active Uniswap V2 liquidity pool in Q4. Roughly $3.5bn of value was transacted between traders and liquidity providers during this period, an increase of 59% from the previous quarter. Perhaps the most notable takeaway is the drop in volume compared to previous quarters for the same liquidity pool, but it’s worth remembering the launch of V3 pulled liquidity from the V2 pool into the concentrated V3 pools. In total, $29.1bn worth of trades occurred within this pool throughout the year exclusively through V2.\n\nSAITAMA / WETH\n\nThe remaining two V2 markets are best categorized as token pairs popular during the bull market. The first is SAITAMA (or SAITAMA INU), the native project token for the Saitama community.\n\nSAITAMA / WETH did not see much trading activity until October 2021. Thus, SAITAMA / WETH would not have seen high volume in any other quarter, a statistic confirmed by the jump to $2.3bn in volume from $0.2bn in Q3.\n\nOctober 2021 was when liquidity provider fees began to surge with a gradual tapering starting in December. However, the annualized daily APR liquidity providers received during parts of the summer almost reached 600%. The combination of low volume and high APR means the total count of liquidity providers was not high, likely affirming the notion SAITAMA did not have much prior recognition by crypto investors until late-summer.\n\nELON / WETH\n\nIt should be easy to tell why Dogelon Mars (ELON) token generated investor interest in Q4. A combination of the Dogecoin meme, fandom for Elon Musk, and a common desire for Mars-high valuations in the project name certainly appealed to a subset of speculative investors. Unlike the market for SAITAMA / WETH, ELON jumped at two separate points during the year: mid-May and early-November. Not much activity happened in between when the overall crypto market fell into a lull.\n\nNot surprisingly, liquidity provider yields were volatile and offered high returns when retail interest in ELON came alive. Annualized daily APRs peaked at almost 450% though the same metric generally fell under 10% for most of the year. Similar to SAITAMA, there was relatively low liquidity during the period from May to October. ELON / WETH hovered roughly around $6M in combined deposits, though this number did pick up in Q4. Regardless, it’s a far cry from the $200mm or so worth of token reserves in the USDC / WETH market above.\n\nTop V3 Markets\n\nIn May, Uniswap released V3 of its DEX, which introduced the concept of fee tiers in each market. The idea behind the tiers was to increase capital efficiency by separating different markets by their volatility. More volatile markets would charge a higher trading fee while pairs that move more closely together would charge a lower fee. Three tiers were created at the time of V3’s launch: 0.05%, 0.30%, and 1.00%. In Q4, Uniswap governance passed a fourth 0.01% fee tier designed to tackle stablecoin trades and compete with specialized AMMs such as Curve Finance.\n\nIn sum, 12% more users made a trade through V3 in Q4 than in Q3. Segmenting the data further highlights higher volatility in the number of users trading in the 1.00% market compared to the others. This is particularly noticeable in May and December, which as stated previously, were two periods in the year where market volatility was high. Due to rapid demand in low cap coins, the 1% fee tier saw significant volatility spikes as traders chased price movements. With 1% fee tiers usually reserved for non-blue chip tokens, liquidity in these pools can earn significant returns as demand rapidly shifts from little to much in short periods of time.\n\nUSDC / WETH\n\nTrading volume in the USDC/WETH market grew 59% over Q4. Liquidity, meanwhile, grew 80% and liquidity provider fees grew 19%.\n\nIn the V3 USDC/WETH market, what’s most interesting is the decline of trading volume in the 0.30% tier and the growth in the 0.05% tier.\n\nThis trend reflects how competitive exchanges are. Capital competes with capital for fees – in order to undercut each other, jumping to the lower fee tier and concentrating liquidity is a frequent strategy in the hope of attracting trading volume a LP wouldn’t have gotten in a higher tier. It would stand to reason that trading volume moving to lower fee tiers would occur across other markets as well, which does also occur in the WBTC/WETH market below. This trend will be interesting to watch over the next year.\n\nUSDC / USDT\n\nTrading volume in the USDC/USDT market grew 114% after declining 30% from Q2 to Q3. Meanwhile, liquidity increased 53% while liquidity provider fees declined 13%. One explanation for the increase in liquidity could be increased volatility and bear market fears, driving investors to move more of their capital into stablecoins.\n\nStablecoin markets also heavily benefited from Uniswap’s creation of the new 0.01% fee tier. Trading of stablecoins in Q4 increased significantly from the previous quarter, though it’s unclear how much of that was due to the new fee tier compared to increased volatility in the quarter. Immediately after the launch of the new tier, the volume in the USDC/USDT market increased significantly and volume in the lower tier now routinely represents multiples of the volume in the higher tier, though daily LP fees are not significantly higher than before.\n\nWBTC / WETH\n\nOverall trading volume in the WBTC/WETH market grew 54% from the previous quarter. Meanwhile liquidity grew 36% and liquidity provider fees increased 38%.\n\nThe takeaway from the WBTC/WETH market is similar to the USDC/WETH market above, namely the competitiveness of exchanges driving volume away from higher fee tiers in favor of lower tiers. Though most trading volume occurred in the 0.30% tier in the first few weeks post-V3 launch, significantly more volume is now occurring in the 0.05% today. WBTC/WETH does appear to fluctuate at times between the two in a manner which USDC/WETH does not.\n\nMarket action between 0.05% and 0.30% did increase in Q4 compared to Q3. Whereas a consistent 70 - 80% of trading activity took place in 0.05%, trades in Q4 were routed to the higher tier during those days where there was higher volatility.\n\nGrant Program\n\nThe Uniswap Grant Program (UGP) batches grant funding in waves, which are not correlated with any specific quarter or predisposed length of time. The data for five waves dating back to March 2021 are publicly available while a sixth wave is already completed and not yet released. UGP is currently on its seventh wave of grants. Note that several grants funded in Wave 5 occurred in Q3 2021.\n\nAlmost 50% of Wave 5’s funding was earmarked for sponsorships. An additional ~20% was spent towards community-oriented and tooling-oriented projects. The remaining capital went towards usability and governance grants. Governance was a new category in Wave 5. This was also the first wave that did not have any grant money for Request for Proposals and Challenges. Some of the largest grants from Wave 5 include for the following initiatives:\n\nEthereum Execution Layer Support – $250,000\n\nUGP, alongside equivalent donations from Compound Grants, Lido, Synthetix, The Graph, and Kraken, contributed $250K to further the continued development of Ethereum execution-layer client teams. The $1.5M was raised to supplement existing funding provided by the Ethereum Foundation. Besu, Erigon, Geth, Nethermind, and Nimbus were the five selected recipients of the funding round.\n\nDeFi Alliance – $150,000\n\nDeFi Alliance is a DeFi and Web3 accelerator backing entrepreneurs building projects in the crypto ecosystem. Protocols who came out of the program include dYdX, SushiSwap, OlympusDAO, Synthetix, and many others. In support of the accelerator, UGP contributed $150K to help fund a cohort of ambitious startups.\n\nValve Finance – $100,000\n\nA $100K contribution was made to Valve Finance to develop optimization algorithms for the routing of large orders during times of insufficient liquidity. The goal of the grant is to formulate multi-path trading strategies from Token A to Token B, thus providing traders better pricing for their transactions. Additional features such as advanced real-time data and simulation tools would also be explored as part of the grant.\n\nMessari – $60,000\n\nMessari is a research and data analytics firm. The grant allocated to Messari integrates Uniswap into the research portal. Messari will also publish four research reports, such as this quarterly report and <a href=\"https://messari.io/article/dex-education-uniswap-optimistic-rollups-and-the-layer-2-dex-landscape\">another</a> on the rollout of V3 on Optimism, for the Uniswap community and Messari’s institutional client base.\n\nGovernance Updates\n\nDecember 21, 2021 – <a href=\"https://messari.io/governor/proposal/d63fe95c-2775-4b18-978a-0e08a9737127\">Provide Voltz with Uniswap V3 Additional Use Grant</a>\n\nVoltz Protocol requested a use grant of the code base from V3 within its interest rate swaps AMM in exchange for 1% of its token supply. Under the guidelines of the Business Source License, which allows for the temporary limited production use of software with the future agreement to become open source, Voltz would not be permitted to portions of the V3 code unless approved by the Uniswap community.\n\nDecember 3, 2021 – <a href=\"https://messari.io/governor/proposal/f4b4bb99-dce8-4b13-88cb-c6201babe288\">Incentivize Liquidity on Optimism and Arbitrum</a>\n\nA consensus check was passed intended to gauge community interest in incentivizing liquidity to kickstart increased activity on Optimism and Arbitrum. As a leading player in DeFi, Uniswap has the ability to help bootstrap usage in Layer-2 protocols through its large treasury. The proposal is still in discussion with the community and interest in being gauged.\n\nDecember 2, 2021 – <a href=\"https://messari.io/governor/proposal/daf2cf21-5788-472e-b943-9da7edf8656f\">Deploy Uniswap V3 to Polygon</a>\n\nOn December 2, the community officially passed a consensus check to authorize Uniswap Labs to deploy the Uniswap V3 protocol onto the Polygon network. As part of the proposal, the Polygon team was willing to commit up to $15M for liquidity mining purposes and up to $5M for general development of Uniswap on Polygon, as well as other qualitative support such as design around liquidity mining programs, promotion of the Uniswap protocol, and more. The proposal was executed via on-chain vote on December 23.\n\nNovember 2, 2021 – <a href=\"https://messari.io/governor/proposal/9de48658-ddca-4db4-89aa-b865128773a2\">Add One Basis Point Fee Tier</a>\n\nThe proposal to add a new one basis point fee tier was designed for Uniswap to better compete in the stablecoin markets dominated by protocols such as Curve. 100% of the vote was for this proposal and the proposal was executed on November 12.\n\nFinal Thoughts\n\nThe Fed’s decision to raise interest rates reverberated across all markets. Crypto was among the industries which took a hit. Yet as an exchange, Uniswap was actually a beneficiary of the macro environment. Combined with strong retail interest in the first half of the quarter, Uniswap helped facilitate higher transaction volumes in Q4 and liquidity providers earned higher fees during that time.\n\nLooking ahead, Uniswap’s decision to engage with Layer-2 scaling protocols could be a catalyst for continued growth. The addition of a new fee tier for stablecoin trading also allows it to be more competitive across the DEX landscape. Both of these changes are relatively early, so there’s reason to be optimistic moving into the new year.\n\nThis report was commissioned by Uniswap Labs, a member of Messari Hub. All content was produced independently by the author(s) and does not necessarily reflect the opinions of Messari, Inc. or the organization that requested the report. Paid membership in the Hub does not influence editorial decision or content. Author(s) may hold cryptocurrencies named in this report.\n\nCrypto projects can commission independent research through Messari Hub. For more details or to join the program, contact hub@messari.io\n\nThis report is meant for informational purposes only. It is not meant to serve as investment advice. You should conduct your own research, and consult an independent financial, tax, or legal advisor before making any investment decisions. Past performance of any asset is not indicative of future results. Please see our terms of use for more information._\n\nAppendix\n\n", "references": [{"name": "Jerry Sun", "url": ""}], "published_at": "2022-01-20T14:00:00Z", "author": {"name": "Jerry Sun"}, "tags": ["Decentralized-Finance", "Decentralized-Exchanges"], "url": "https://messari.io/article/state-of-uniswap-q4-2021"}, {"id": "3841326f-5b93-4d6d-aec0-0cfcb3a65b26", "title": "Weekly Recap Ending January 13", "content": "Weekly Recap Ending January 13\n\nNotable Messari Intel Updates\n\nOffchain Labs has <a href=\"https://messari.io/intel/event/7a8f7d0f-1ef8-44d7-8a50-eac10780b08c\">released details</a> about the Arbitrum network halt on Jan. 9, 2022.\nThe Polygon Zero team has introduced <a href=\"https://messari.io/intel/event/34f90fc2-436c-4b90-afcc-9816d415a384\">Plonky2</a>, a recursive SNARK that the team claims is \"100x faster than existing alternatives and natively compatible with Ethereum\".\nThe dYdX team has <a href=\"https://messari.io/intel/event/20723bd7-af7e-4cd4-b310-d81fd118f3ba\">released information</a> on the dYdX V4 upgrade, a new version of the protocol planned to be released by the end of the year 2022.\nCelo’s <a href=\"https://messari.io/intel/event/12795df1-1a4c-46f2-984c-de7cd77b9fa4\">Espresso hard fork</a> has been scheduled for block 11,354,500 (estimated to occur on Feb. 8, 2022, at 20:06 UTC)\n\nNotable Messari Governor Updates\n\nRen DAO submitted a <a href=\"https://messari.io/governor/proposal/aae3256e-f126-4b5a-b021-fda6f3fe34d3\">proposal</a> that aims to introduce the BurnAndMint transaction type and define its fee parameters.\nGnosis DAO has released a <a href=\"https://messari.io/governor/proposal/807b1778-f9e5-4776-b9ea-edeb104dfa2f\">proposal</a> that aims to rebrand the Gnosis Protocol and GNT token to CowDAO and COW token.\nIndexed DAO has submitted a proposal aimed to use drained assets to fund litigation against the hacker who carried out a $16M exploit. Voting is currently active. To find more information or cast your vote, follow this <a href=\"https://messari.io/governor/proposal/3d75d185-3c7a-4e46-b102-e432af9f1cb0\">link</a>.\nBalancer has submitted a proposal seeking to introduce subDAOS for Operations, Treasury, Partnership, and Marketing. Voting is currently active. To find more information or cast your vote, follow this <a href=\"https://messari.io/governor/proposal/936d89a8-3c9b-4a8b-8e3c-c55b320be85d\">link</a>.\nThe Bankless DAO approved a <a href=\"https://messari.io/governor/proposal/ec4d9b55-bcc5-4d1a-8b7a-35e1ac7fa549\">proposal</a> that aims to introduce a series of changes to governance that will help the community gather consensus before moving a proposal to Snapshot.\n\nSector Returns\n\nThis week saw losses across all sectors ranging from -0.48% to -7.50%. The Currencies sector remained the most stable, finishing -0.48% from the previous week. Web3 and Gaming, being the most speculative of the group, suffered the highest losses. They finished the week with similar returns at -7.5% and -7.1% respectively.\n\nTop Assets\n\nThis week saw the top assets trade fairly close to each other even as they formed a U shape pattern. However, towards the end of the week, 7 out of the 10 top assets were able to recover lost ground and finished the week with positive returns. The top performer was Cardano (ADA) at 7.5% and the worst performer was Ethereum (ETH) at -5.2%.\n\nDeFi\n\nAll DeFi tokens finished the week in the red. Although DeFi was one of the worst performers of the week (-5.76%), TVL has remained within a range ($223b-$259b) it has kept since the end of October last year (currently at $240b). Loopring (LRC) briefly spiked towards the end of last week but lost footing and started trading more closely to the other DeFi tokens, ending the week in the eighth spot with a -9.0% return. SPELL Token from Abracadabra lagged behind the rest of the tokens for most of the week, finishing last with a -15.3% return.\n\nSmart Contract Platforms\n\nThe smart contract platform sector saw the most evenly distributed returns for the week, with half of the assets finishing the week with positive returns and the other half with negative returns, even though at the halfway point, all assets were in the red. NEAR (NEAR) was the best performer of the week, finishing on top with a return of 9.8% after <a href=\"https://messari.io/intel/event/c8d8956f-b7bb-409c-8e1e-22465a507b73\">announcing</a> its $150 million fundraising round led by Three Arrows Capital. Algorand (ALGO) took the last place with a return of -6.5%; slightly above was Ethereum (ETH) with a return of -5.2%.\n\nCurrencies\n\nDash (DASH) was the clear leader of the week. DASH saw its trading volume more than double from its low of $165 last friday to $455m in just one day, allowing it to break off the pack and follow through to take the first place, bringing in a return of 16.3%. Aside from the one outlier of the group, the currency sector had similar returns, trading in unison throughout the week. Bitcoin Cash (BCH) took the last spot finishing the week at -4.5%.\n\nWeb3\n\nChainlink (LINK) was the only asset in the sector that finished the week with a positive return (5.4%), possibly due to the fact that it has been one of the most heavily bought Ethereum-based-tokens throughout this decline. The majority of the group (rank 2nd to 9th) traded with high correlation throughout the entire week, with returns within a 5% range. Similar to how LINK traded at a distance from the middle of the pack, Livepeer (LPT) did so in the opposite direction; lagging from the start until the end, it experienced the greatest drawdown with a -17.9% return.\n\nGaming\n\nWith gaming having the lowest market cap ($15.5b) of the sectors discussed, it is normal to experience weeks of high volatility, and this week was no different. As can be seen from the graph, gaming assets currently share much less correlation with each other, a sign of a young and high speculation driven market. Yield Guild Games (YGG) took the first spot this week followed closely by Enjin (ENJ) with 2.1% and 1.3% returns respectively. Dvision Network saw the most significant decline with an 11.9% drawdown.\n\n", "references": [{"name": "Guillermo Avilés", "url": ""}], "published_at": "2022-01-14T15:39:00Z", "author": {"name": "Guillermo Avilés"}, "tags": ["Macro"], "url": "https://messari.io/article/weekly-recap-ending-january-13"}]}